zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz66/pic32cx2051bz66048-pinctrl.h
/*
 * Copyright (c) 2026 Microchip Technology Inc.
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef MICROCHIP_PIC32CX2051BZ66048_PINCTRL_H_
#define MICROCHIP_PIC32CX2051BZ66048_PINCTRL_H_

#include <dt-bindings/pic32c/pic32cx_bz/common/mchp_pinctrl_pinmux_pic32cxbz.h>

/* Indicates that direct mode is enabled; use this macro when configuring for direct mode
 * instead of PPS.
 */
#define PIN_DIRECT_MODE        MCHP_PINMUX(direct, NA, NA, NA, directmode)
/* pa0_accmpten_in */
#define PA0_ACCMPTEN_IN        MCHP_PINMUX(a, 0, 0x18c, 1, periph)
/* pa0_ac_cmp0_out */
#define PA0_AC_CMP0_OUT        MCHP_PINMUX(a, 0, 0x208, 40, periph)
/* pa0_ac_cmp1_out */
#define PA0_AC_CMP1_OUT        MCHP_PINMUX(a, 0, 0x20c, 36, periph)
/* pa0_ac_cmptout_out */
#define PA0_AC_CMPTOUT_OUT     MCHP_PINMUX(a, 0, 0x20c, 37, periph)
/* pa0_ac_cmptrdy_out */
#define PA0_AC_CMPTRDY_OUT     MCHP_PINMUX(a, 0, 0x208, 41, periph)
/* pa0_can1rx_in */
#define PA0_CAN1RX_IN          MCHP_PINMUX(a, 0, 0x190, 19, periph)
/* pa0_can1_tx_out */
#define PA0_CAN1_TX_OUT        MCHP_PINMUX(a, 0, 0x20c, 38, periph)
/* pa0_cclin0_in */
#define PA0_CCLIN0_IN          MCHP_PINMUX(a, 0, 0xb4, 1, periph)
/* pa0_cclin1_in */
#define PA0_CCLIN1_IN          MCHP_PINMUX(a, 0, 0xb8, 24, periph)
/* pa0_cclin2_in */
#define PA0_CCLIN2_IN          MCHP_PINMUX(a, 0, 0xbc, 19, periph)
/* pa0_cclin3_in */
#define PA0_CCLIN3_IN          MCHP_PINMUX(a, 0, 0xc0, 1, periph)
/* pa0_cclin4_in */
#define PA0_CCLIN4_IN          MCHP_PINMUX(a, 0, 0xc4, 24, periph)
/* pa0_cclin5_in */
#define PA0_CCLIN5_IN          MCHP_PINMUX(a, 0, 0xc8, 19, periph)
/* pa0_cclo0_out */
#define PA0_CCLO0_OUT          MCHP_PINMUX(a, 0, 0x208, 1, periph)
/* pa0_cclo1_out */
#define PA0_CCLO1_OUT          MCHP_PINMUX(a, 0, 0x204, 1, periph)
/* pa0_coexwlanact_in */
#define PA0_COEXWLANACT_IN     MCHP_PINMUX(a, 0, 0x194, 8, periph)
/* pa0_coex_bt_state_out */
#define PA0_COEX_BT_STATE_OUT  MCHP_PINMUX(a, 0, 0x200, 37, periph)
/* pa0_coex_rf_act_out */
#define PA0_COEX_RF_ACT_OUT    MCHP_PINMUX(a, 0, 0x204, 41, periph)
/* pa0_extint0_in */
#define PA0_EXTINT0_IN         MCHP_PINMUX(a, 0, 0x0, 1, periph)
/* pa0_extint1_in */
#define PA0_EXTINT1_IN         MCHP_PINMUX(a, 0, 0x4, 24, periph)
/* pa0_extint2_in */
#define PA0_EXTINT2_IN         MCHP_PINMUX(a, 0, 0x8, 19, periph)
/* pa0_extint3_in */
#define PA0_EXTINT3_IN         MCHP_PINMUX(a, 0, 0xc, 8, periph)
/* pa0_fectrl0_out */
#define PA0_FECTRL0_OUT        MCHP_PINMUX(a, 0, 0x204, 40, periph)
/* pa0_fectrl1_out */
#define PA0_FECTRL1_OUT        MCHP_PINMUX(a, 0, 0x200, 35, periph)
/* pa0_fectrl2_out */
#define PA0_FECTRL2_OUT        MCHP_PINMUX(a, 0, 0x200, 36, periph)
/* pa0_fectrl3_out */
#define PA0_FECTRL3_OUT        MCHP_PINMUX(a, 0, 0x20c, 39, periph)
/* pa0_fectrl4_out */
#define PA0_FECTRL4_OUT        MCHP_PINMUX(a, 0, 0x208, 42, periph)
/* pa0_fectrl5_out */
#define PA0_FECTRL5_OUT        MCHP_PINMUX(a, 0, 0x20c, 40, periph)
/* pa0_nmi_in */
#define PA0_NMI_IN             MCHP_PINMUX(a, 0, 0x3c, 8, periph)
/* pa0_qd0_in */
#define PA0_QD0_IN             MCHP_PINMUX(a, 0, 0xa0, 8, periph)
/* pa0_qd0_out */
#define PA0_QD0_OUT            MCHP_PINMUX(a, 0, 0x204, 35, periph)
/* pa0_qd1_in */
#define PA0_QD1_IN             MCHP_PINMUX(a, 0, 0xa4, 1, periph)
/* pa0_qd1_out */
#define PA0_QD1_OUT            MCHP_PINMUX(a, 0, 0x200, 30, periph)
/* pa0_qd2_in */
#define PA0_QD2_IN             MCHP_PINMUX(a, 0, 0xa8, 24, periph)
/* pa0_qd2_out */
#define PA0_QD2_OUT            MCHP_PINMUX(a, 0, 0x200, 29, periph)
/* pa0_qd3_in */
#define PA0_QD3_IN             MCHP_PINMUX(a, 0, 0xac, 19, periph)
/* pa0_qd3_out */
#define PA0_QD3_OUT            MCHP_PINMUX(a, 0, 0x200, 28, periph)
/* pa0_qeiccmp0_out */
#define PA0_QEICCMP0_OUT       MCHP_PINMUX(a, 0, 0x200, 31, periph)
/* pa0_qeihome0g1_in */
#define PA0_QEIHOME0G1_IN      MCHP_PINMUX(a, 0, 0x16c, 1, periph)
/* pa0_qeihome0g2_in */
#define PA0_QEIHOME0G2_IN      MCHP_PINMUX(a, 0, 0x170, 24, periph)
/* pa0_qeiindx0g2_in */
#define PA0_QEIINDX0G2_IN      MCHP_PINMUX(a, 0, 0x174, 24, periph)
/* pa0_qeiindx0g3_in */
#define PA0_QEIINDX0G3_IN      MCHP_PINMUX(a, 0, 0x178, 19, periph)
/* pa0_qeiqea0g3_in */
#define PA0_QEIQEA0G3_IN       MCHP_PINMUX(a, 0, 0x17c, 19, periph)
/* pa0_qeiqea0g4_in */
#define PA0_QEIQEA0G4_IN       MCHP_PINMUX(a, 0, 0x180, 8, periph)
/* pa0_qeiqeb0g4_in */
#define PA0_QEIQEB0G4_IN       MCHP_PINMUX(a, 0, 0x184, 8, periph)
/* pa0_qspics_out */
#define PA0_QSPICS_OUT         MCHP_PINMUX(a, 0, 0x200, 27, periph)
/* pa0_scom0p0_in */
#define PA0_SCOM0P0_IN         MCHP_PINMUX(a, 0, 0x40, 24, periph)
/* pa0_scom0p0_out */
#define PA0_SCOM0P0_OUT        MCHP_PINMUX(a, 0, 0x204, 2, periph)
/* pa0_scom0p2_in */
#define PA0_SCOM0P2_IN         MCHP_PINMUX(a, 0, 0x48, 8, periph)
/* pa0_scom0p2_out */
#define PA0_SCOM0P2_OUT        MCHP_PINMUX(a, 0, 0x200, 2, periph)
/* pa0_scom0p3_in */
#define PA0_SCOM0P3_IN         MCHP_PINMUX(a, 0, 0x4c, 1, periph)
/* pa0_scom0p3_out */
#define PA0_SCOM0P3_OUT        MCHP_PINMUX(a, 0, 0x200, 1, periph)
/* pa0_scom1p0_in */
#define PA0_SCOM1P0_IN         MCHP_PINMUX(a, 0, 0x50, 19, periph)
/* pa0_scom1p0_out */
#define PA0_SCOM1P0_OUT        MCHP_PINMUX(a, 0, 0x200, 3, periph)
/* pa0_scom1p2_in */
#define PA0_SCOM1P2_IN         MCHP_PINMUX(a, 0, 0x58, 1, periph)
/* pa0_scom1p2_out */
#define PA0_SCOM1P2_OUT        MCHP_PINMUX(a, 0, 0x200, 4, periph)
/* pa0_scom1p3_in */
#define PA0_SCOM1P3_IN         MCHP_PINMUX(a, 0, 0x5c, 24, periph)
/* pa0_scom1p3_out */
#define PA0_SCOM1P3_OUT        MCHP_PINMUX(a, 0, 0x204, 5, periph)
/* pa0_scom2p0_in */
#define PA0_SCOM2P0_IN         MCHP_PINMUX(a, 0, 0x60, 24, periph)
/* pa0_scom2p0_out */
#define PA0_SCOM2P0_OUT        MCHP_PINMUX(a, 0, 0x204, 7, periph)
/* pa0_scom2p2_in */
#define PA0_SCOM2P2_IN         MCHP_PINMUX(a, 0, 0x68, 8, periph)
/* pa0_scom2p2_out */
#define PA0_SCOM2P2_OUT        MCHP_PINMUX(a, 0, 0x200, 6, periph)
/* pa0_scom2p3_in */
#define PA0_SCOM2P3_IN         MCHP_PINMUX(a, 0, 0x6c, 1, periph)
/* pa0_scom2p3_out */
#define PA0_SCOM2P3_OUT        MCHP_PINMUX(a, 0, 0x200, 5, periph)
/* pa0_scom3p0_in */
#define PA0_SCOM3P0_IN         MCHP_PINMUX(a, 0, 0x70, 19, periph)
/* pa0_scom3p0_out */
#define PA0_SCOM3P0_OUT        MCHP_PINMUX(a, 0, 0x200, 7, periph)
/* pa0_scom3p2_in */
#define PA0_SCOM3P2_IN         MCHP_PINMUX(a, 0, 0x78, 1, periph)
/* pa0_scom3p2_out */
#define PA0_SCOM3P2_OUT        MCHP_PINMUX(a, 0, 0x200, 8, periph)
/* pa0_scom3p3_in */
#define PA0_SCOM3P3_IN         MCHP_PINMUX(a, 0, 0x7c, 24, periph)
/* pa0_scom3p3_out */
#define PA0_SCOM3P3_OUT        MCHP_PINMUX(a, 0, 0x204, 10, periph)
/* pa0_tc0wo0g1_in */
#define PA0_TC0WO0G1_IN        MCHP_PINMUX(a, 0, 0xcc, 1, periph)
/* pa0_tc0wo0g2_in */
#define PA0_TC0WO0G2_IN        MCHP_PINMUX(a, 0, 0xd0, 24, periph)
/* pa0_tc0wo0_out */
#define PA0_TC0WO0_OUT         MCHP_PINMUX(a, 0, 0x208, 24, periph)
/* pa0_tc0wo1g3_in */
#define PA0_TC0WO1G3_IN        MCHP_PINMUX(a, 0, 0xd4, 19, periph)
/* pa0_tc0wo1g4_in */
#define PA0_TC0WO1G4_IN        MCHP_PINMUX(a, 0, 0xd8, 8, periph)
/* pa0_tc0wo1_out */
#define PA0_TC0WO1_OUT         MCHP_PINMUX(a, 0, 0x200, 18, periph)
/* pa0_tc1wo0g1_in */
#define PA0_TC1WO0G1_IN        MCHP_PINMUX(a, 0, 0xdc, 1, periph)
/* pa0_tc1wo0_out */
#define PA0_TC1WO0_OUT         MCHP_PINMUX(a, 0, 0x200, 19, periph)
/* pa0_tc1wo1g2_in */
#define PA0_TC1WO1G2_IN        MCHP_PINMUX(a, 0, 0xe4, 24, periph)
/* pa0_tc1wo1_out */
#define PA0_TC1WO1_OUT         MCHP_PINMUX(a, 0, 0x204, 25, periph)
/* pa0_tc2wo0g1_in */
#define PA0_TC2WO0G1_IN        MCHP_PINMUX(a, 0, 0xec, 1, periph)
/* pa0_tc2wo0g3_in */
#define PA0_TC2WO0G3_IN        MCHP_PINMUX(a, 0, 0xf0, 19, periph)
/* pa0_tc2wo0_out */
#define PA0_TC2WO0_OUT         MCHP_PINMUX(a, 0, 0x200, 20, periph)
/* pa0_tc2wo1g2_in */
#define PA0_TC2WO1G2_IN        MCHP_PINMUX(a, 0, 0xf4, 24, periph)
/* pa0_tc2wo1g4_in */
#define PA0_TC2WO1G4_IN        MCHP_PINMUX(a, 0, 0xf8, 8, periph)
/* pa0_tc2wo1_out */
#define PA0_TC2WO1_OUT         MCHP_PINMUX(a, 0, 0x204, 26, periph)
/* pa0_tc3wo0g1_in */
#define PA0_TC3WO0G1_IN        MCHP_PINMUX(a, 0, 0xfc, 1, periph)
/* pa0_tc3wo0g3_in */
#define PA0_TC3WO0G3_IN        MCHP_PINMUX(a, 0, 0x100, 19, periph)
/* pa0_tc3wo0_out */
#define PA0_TC3WO0_OUT         MCHP_PINMUX(a, 0, 0x200, 21, periph)
/* pa0_tc3wo1g2_in */
#define PA0_TC3WO1G2_IN        MCHP_PINMUX(a, 0, 0x104, 24, periph)
/* pa0_tc3wo1g4_in */
#define PA0_TC3WO1G4_IN        MCHP_PINMUX(a, 0, 0x108, 8, periph)
/* pa0_tc3wo1_out */
#define PA0_TC3WO1_OUT         MCHP_PINMUX(a, 0, 0x204, 27, periph)
/* pa0_tc4wo0g1_in */
#define PA0_TC4WO0G1_IN        MCHP_PINMUX(a, 0, 0x10c, 1, periph)
/* pa0_tc4wo0g3_in */
#define PA0_TC4WO0G3_IN        MCHP_PINMUX(a, 0, 0x110, 19, periph)
/* pa0_tc4wo0_out */
#define PA0_TC4WO0_OUT         MCHP_PINMUX(a, 0, 0x200, 22, periph)
/* pa0_tc4wo1g2_in */
#define PA0_TC4WO1G2_IN        MCHP_PINMUX(a, 0, 0x114, 24, periph)
/* pa0_tc4wo1g4_in */
#define PA0_TC4WO1G4_IN        MCHP_PINMUX(a, 0, 0x118, 8, periph)
/* pa0_tc4wo1_out */
#define PA0_TC4WO1_OUT         MCHP_PINMUX(a, 0, 0x204, 28, periph)
/* pa0_tc5wo0g1_in */
#define PA0_TC5WO0G1_IN        MCHP_PINMUX(a, 0, 0x11c, 1, periph)
/* pa0_tc5wo0g3_in */
#define PA0_TC5WO0G3_IN        MCHP_PINMUX(a, 0, 0x120, 19, periph)
/* pa0_tc5wo0_out */
#define PA0_TC5WO0_OUT         MCHP_PINMUX(a, 0, 0x200, 23, periph)
/* pa0_tc5wo1g2_in */
#define PA0_TC5WO1G2_IN        MCHP_PINMUX(a, 0, 0x124, 24, periph)
/* pa0_tc5wo1g4_in */
#define PA0_TC5WO1G4_IN        MCHP_PINMUX(a, 0, 0x128, 8, periph)
/* pa0_tc5wo1_out */
#define PA0_TC5WO1_OUT         MCHP_PINMUX(a, 0, 0x204, 29, periph)
/* pa0_tc6wo0g1_in */
#define PA0_TC6WO0G1_IN        MCHP_PINMUX(a, 0, 0x12c, 1, periph)
/* pa0_tc6wo0g3_in */
#define PA0_TC6WO0G3_IN        MCHP_PINMUX(a, 0, 0x130, 19, periph)
/* pa0_tc6wo0_out */
#define PA0_TC6WO0_OUT         MCHP_PINMUX(a, 0, 0x200, 24, periph)
/* pa0_tc6wo1g2_in */
#define PA0_TC6WO1G2_IN        MCHP_PINMUX(a, 0, 0x134, 24, periph)
/* pa0_tc6wo1g4_in */
#define PA0_TC6WO1G4_IN        MCHP_PINMUX(a, 0, 0x138, 8, periph)
/* pa0_tc6wo1_out */
#define PA0_TC6WO1_OUT         MCHP_PINMUX(a, 0, 0x204, 30, periph)
/* pa0_tc7wo0g1_in */
#define PA0_TC7WO0G1_IN        MCHP_PINMUX(a, 0, 0x13c, 1, periph)
/* pa0_tc7wo0g3_in */
#define PA0_TC7WO0G3_IN        MCHP_PINMUX(a, 0, 0x140, 19, periph)
/* pa0_tc7wo0_out */
#define PA0_TC7WO0_OUT         MCHP_PINMUX(a, 0, 0x200, 25, periph)
/* pa0_tc7wo1g2_in */
#define PA0_TC7WO1G2_IN        MCHP_PINMUX(a, 0, 0x144, 24, periph)
/* pa0_tc7wo1g4_in */
#define PA0_TC7WO1G4_IN        MCHP_PINMUX(a, 0, 0x148, 8, periph)
/* pa0_tc7wo1_out */
#define PA0_TC7WO1_OUT         MCHP_PINMUX(a, 0, 0x204, 31, periph)
/* pa0_tc8wo0g1_in */
#define PA0_TC8WO0G1_IN        MCHP_PINMUX(a, 0, 0x14c, 1, periph)
/* pa0_tc8wo0g3_in */
#define PA0_TC8WO0G3_IN        MCHP_PINMUX(a, 0, 0x150, 19, periph)
/* pa0_tc8wo0_out */
#define PA0_TC8WO0_OUT         MCHP_PINMUX(a, 0, 0x200, 26, periph)
/* pa0_tc8wo1g2_in */
#define PA0_TC8WO1G2_IN        MCHP_PINMUX(a, 0, 0x154, 24, periph)
/* pa0_tc8wo1_out */
#define PA0_TC8WO1_OUT         MCHP_PINMUX(a, 0, 0x204, 32, periph)
/* pa0_tc9wo0g2_in */
#define PA0_TC9WO0G2_IN        MCHP_PINMUX(a, 0, 0x15c, 24, periph)
/* pa0_tc9wo0g4_in */
#define PA0_TC9WO0G4_IN        MCHP_PINMUX(a, 0, 0x160, 8, periph)
/* pa0_tc9wo0_out */
#define PA0_TC9WO0_OUT         MCHP_PINMUX(a, 0, 0x204, 33, periph)
/* pa0_tc9wo1g3_in */
#define PA0_TC9WO1G3_IN        MCHP_PINMUX(a, 0, 0x164, 19, periph)
/* pa0_tc9wo1_out */
#define PA0_TC9WO1_OUT         MCHP_PINMUX(a, 0, 0x208, 33, periph)
/* pa0_tcc0wo0_out */
#define PA0_TCC0WO0_OUT        MCHP_PINMUX(a, 0, 0x200, 13, periph)
/* pa0_tcc0wo1_out */
#define PA0_TCC0WO1_OUT        MCHP_PINMUX(a, 0, 0x204, 17, periph)
/* pa0_tcc0wo2_out */
#define PA0_TCC0WO2_OUT        MCHP_PINMUX(a, 0, 0x208, 17, periph)
/* pa0_tcc0wo3_out */
#define PA0_TCC0WO3_OUT        MCHP_PINMUX(a, 0, 0x204, 19, periph)
/* pa0_tcc0wo4_out */
#define PA0_TCC0WO4_OUT        MCHP_PINMUX(a, 0, 0x200, 14, periph)
/* pa0_tcc0wo5_out */
#define PA0_TCC0WO5_OUT        MCHP_PINMUX(a, 0, 0x204, 18, periph)
/* pa0_tcc1wo0_out */
#define PA0_TCC1WO0_OUT        MCHP_PINMUX(a, 0, 0x200, 15, periph)
/* pa0_tcc1wo1_out */
#define PA0_TCC1WO1_OUT        MCHP_PINMUX(a, 0, 0x204, 20, periph)
/* pa0_tcc1wo2_out */
#define PA0_TCC1WO2_OUT        MCHP_PINMUX(a, 0, 0x208, 20, periph)
/* pa0_tcc1wo3_out */
#define PA0_TCC1WO3_OUT        MCHP_PINMUX(a, 0, 0x204, 22, periph)
/* pa0_tcc1wo4_out */
#define PA0_TCC1WO4_OUT        MCHP_PINMUX(a, 0, 0x200, 16, periph)
/* pa0_tcc1wo5_out */
#define PA0_TCC1WO5_OUT        MCHP_PINMUX(a, 0, 0x204, 21, periph)
/* pa0_tcc2wo0_out */
#define PA0_TCC2WO0_OUT        MCHP_PINMUX(a, 0, 0x200, 17, periph)
/* pa0_tcc2wo1_out */
#define PA0_TCC2WO1_OUT        MCHP_PINMUX(a, 0, 0x204, 23, periph)
/* pa0_tstbus0_out */
#define PA0_TSTBUS0_OUT        MCHP_PINMUX(a, 0, 0x200, 32, periph)
/* pa0_tstbus1_out */
#define PA0_TSTBUS1_OUT        MCHP_PINMUX(a, 0, 0x208, 38, periph)
/* pa0_tstbus2_out */
#define PA0_TSTBUS2_OUT        MCHP_PINMUX(a, 0, 0x20c, 34, periph)
/* pa0_tstbus4_out */
#define PA0_TSTBUS4_OUT        MCHP_PINMUX(a, 0, 0x200, 33, periph)
/* pa0_tstbus5_out */
#define PA0_TSTBUS5_OUT        MCHP_PINMUX(a, 0, 0x204, 38, periph)
/* pa0_tstbus6_out */
#define PA0_TSTBUS6_OUT        MCHP_PINMUX(a, 0, 0x20c, 35, periph)
/* pa0_tstbus8_out */
#define PA0_TSTBUS8_OUT        MCHP_PINMUX(a, 0, 0x200, 34, periph)
/* pa0_tstbus9_out */
#define PA0_TSTBUS9_OUT        MCHP_PINMUX(a, 0, 0x204, 39, periph)
/* pa0_tstbus10_out */
#define PA0_TSTBUS10_OUT       MCHP_PINMUX(a, 0, 0x208, 39, periph)
/* pa1_ac_cmp0_out */
#define PA1_AC_CMP0_OUT        MCHP_PINMUX(a, 1, 0x214, 40, periph)
/* pa1_ac_cmp1_out */
#define PA1_AC_CMP1_OUT        MCHP_PINMUX(a, 1, 0x218, 36, periph)
/* pa1_ac_cmptout_out */
#define PA1_AC_CMPTOUT_OUT     MCHP_PINMUX(a, 1, 0x218, 37, periph)
/* pa1_ac_cmptrdy_out */
#define PA1_AC_CMPTRDY_OUT     MCHP_PINMUX(a, 1, 0x214, 41, periph)
/* pa1_can1rx_in */
#define PA1_CAN1RX_IN          MCHP_PINMUX(a, 1, 0x190, 23, periph)
/* pa1_can1_tx_out */
#define PA1_CAN1_TX_OUT        MCHP_PINMUX(a, 1, 0x218, 38, periph)
/* pa1_cclin1_in */
#define PA1_CCLIN1_IN          MCHP_PINMUX(a, 1, 0xb8, 1, periph)
/* pa1_cclin2_in */
#define PA1_CCLIN2_IN          MCHP_PINMUX(a, 1, 0xbc, 23, periph)
/* pa1_cclin4_in */
#define PA1_CCLIN4_IN          MCHP_PINMUX(a, 1, 0xc4, 1, periph)
/* pa1_cclin5_in */
#define PA1_CCLIN5_IN          MCHP_PINMUX(a, 1, 0xc8, 23, periph)
/* pa1_cclo0_out */
#define PA1_CCLO0_OUT          MCHP_PINMUX(a, 1, 0x214, 1, periph)
/* pa1_cclo1_out */
#define PA1_CCLO1_OUT          MCHP_PINMUX(a, 1, 0x210, 1, periph)
/* pa1_coexwlanact_in */
#define PA1_COEXWLANACT_IN     MCHP_PINMUX(a, 1, 0x194, 17, periph)
/* pa1_coex_rf_act_out */
#define PA1_COEX_RF_ACT_OUT    MCHP_PINMUX(a, 1, 0x210, 41, periph)
/* pa1_extint1_in */
#define PA1_EXTINT1_IN         MCHP_PINMUX(a, 1, 0x4, 1, periph)
/* pa1_extint2_in */
#define PA1_EXTINT2_IN         MCHP_PINMUX(a, 1, 0x8, 23, periph)
/* pa1_extint3_in */
#define PA1_EXTINT3_IN         MCHP_PINMUX(a, 1, 0xc, 17, periph)
/* pa1_fectrl0_out */
#define PA1_FECTRL0_OUT        MCHP_PINMUX(a, 1, 0x210, 40, periph)
/* pa1_fectrl3_out */
#define PA1_FECTRL3_OUT        MCHP_PINMUX(a, 1, 0x218, 39, periph)
/* pa1_fectrl4_out */
#define PA1_FECTRL4_OUT        MCHP_PINMUX(a, 1, 0x214, 42, periph)
/* pa1_fectrl5_out */
#define PA1_FECTRL5_OUT        MCHP_PINMUX(a, 1, 0x218, 40, periph)
/* pa1_nmi_in */
#define PA1_NMI_IN             MCHP_PINMUX(a, 1, 0x3c, 17, periph)
/* pa1_qd0_in */
#define PA1_QD0_IN             MCHP_PINMUX(a, 1, 0xa0, 17, periph)
/* pa1_qd0_out */
#define PA1_QD0_OUT            MCHP_PINMUX(a, 1, 0x210, 35, periph)
/* pa1_qd1_out */
#define PA1_QD1_OUT            MCHP_PINMUX(a, 1, 0x214, 35, periph)
/* pa1_qd2_in */
#define PA1_QD2_IN             MCHP_PINMUX(a, 1, 0xa8, 1, periph)
/* pa1_qd2_out */
#define PA1_QD2_OUT            MCHP_PINMUX(a, 1, 0x210, 37, periph)
/* pa1_qd3_in */
#define PA1_QD3_IN             MCHP_PINMUX(a, 1, 0xac, 23, periph)
/* pa1_qd3_out */
#define PA1_QD3_OUT            MCHP_PINMUX(a, 1, 0x210, 36, periph)
/* pa1_qeiccmp0_out */
#define PA1_QEICCMP0_OUT       MCHP_PINMUX(a, 1, 0x21c, 13, periph)
/* pa1_qeihome0g2_in */
#define PA1_QEIHOME0G2_IN      MCHP_PINMUX(a, 1, 0x170, 1, periph)
/* pa1_qeiindx0g2_in */
#define PA1_QEIINDX0G2_IN      MCHP_PINMUX(a, 1, 0x174, 1, periph)
/* pa1_qeiindx0g3_in */
#define PA1_QEIINDX0G3_IN      MCHP_PINMUX(a, 1, 0x178, 23, periph)
/* pa1_qeiqea0g3_in */
#define PA1_QEIQEA0G3_IN       MCHP_PINMUX(a, 1, 0x17c, 23, periph)
/* pa1_qeiqea0g4_in */
#define PA1_QEIQEA0G4_IN       MCHP_PINMUX(a, 1, 0x180, 17, periph)
/* pa1_qeiqeb0g4_in */
#define PA1_QEIQEB0G4_IN       MCHP_PINMUX(a, 1, 0x184, 17, periph)
/* pa1_qeiqeb0g5_in */
#define PA1_QEIQEB0G5_IN       MCHP_PINMUX(a, 1, 0x188, 7, periph)
/* pa1_qspics_out */
#define PA1_QSPICS_OUT         MCHP_PINMUX(a, 1, 0x210, 34, periph)
/* pa1_scom0p0_in */
#define PA1_SCOM0P0_IN         MCHP_PINMUX(a, 1, 0x40, 1, periph)
/* pa1_scom0p0_out */
#define PA1_SCOM0P0_OUT        MCHP_PINMUX(a, 1, 0x210, 2, periph)
/* pa1_scom0p2_in */
#define PA1_SCOM0P2_IN         MCHP_PINMUX(a, 1, 0x48, 17, periph)
/* pa1_scom0p2_out */
#define PA1_SCOM0P2_OUT        MCHP_PINMUX(a, 1, 0x210, 4, periph)
/* pa1_scom0p3_out */
#define PA1_SCOM0P3_OUT        MCHP_PINMUX(a, 1, 0x210, 3, periph)
/* pa1_scom1p0_in */
#define PA1_SCOM1P0_IN         MCHP_PINMUX(a, 1, 0x50, 23, periph)
/* pa1_scom1p0_out */
#define PA1_SCOM1P0_OUT        MCHP_PINMUX(a, 1, 0x214, 5, periph)
/* pa1_scom1p2_out */
#define PA1_SCOM1P2_OUT        MCHP_PINMUX(a, 1, 0x210, 6, periph)
/* pa1_scom1p3_in */
#define PA1_SCOM1P3_IN         MCHP_PINMUX(a, 1, 0x5c, 1, periph)
/* pa1_scom1p3_out */
#define PA1_SCOM1P3_OUT        MCHP_PINMUX(a, 1, 0x210, 5, periph)
/* pa1_scom2p0_in */
#define PA1_SCOM2P0_IN         MCHP_PINMUX(a, 1, 0x60, 1, periph)
/* pa1_scom2p0_out */
#define PA1_SCOM2P0_OUT        MCHP_PINMUX(a, 1, 0x210, 7, periph)
/* pa1_scom2p2_in */
#define PA1_SCOM2P2_IN         MCHP_PINMUX(a, 1, 0x68, 17, periph)
/* pa1_scom2p2_out */
#define PA1_SCOM2P2_OUT        MCHP_PINMUX(a, 1, 0x210, 9, periph)
/* pa1_scom2p3_out */
#define PA1_SCOM2P3_OUT        MCHP_PINMUX(a, 1, 0x210, 8, periph)
/* pa1_scom3p0_in */
#define PA1_SCOM3P0_IN         MCHP_PINMUX(a, 1, 0x70, 23, periph)
/* pa1_scom3p0_out */
#define PA1_SCOM3P0_OUT        MCHP_PINMUX(a, 1, 0x214, 10, periph)
/* pa1_scom3p2_out */
#define PA1_SCOM3P2_OUT        MCHP_PINMUX(a, 1, 0x210, 11, periph)
/* pa1_scom3p3_in */
#define PA1_SCOM3P3_IN         MCHP_PINMUX(a, 1, 0x7c, 1, periph)
/* pa1_scom3p3_out */
#define PA1_SCOM3P3_OUT        MCHP_PINMUX(a, 1, 0x210, 10, periph)
/* pa1_tc0wo0g2_in */
#define PA1_TC0WO0G2_IN        MCHP_PINMUX(a, 1, 0xd0, 1, periph)
/* pa1_tc0wo0_out */
#define PA1_TC0WO0_OUT         MCHP_PINMUX(a, 1, 0x214, 24, periph)
/* pa1_tc0wo1g3_in */
#define PA1_TC0WO1G3_IN        MCHP_PINMUX(a, 1, 0xd4, 23, periph)
/* pa1_tc0wo1g4_in */
#define PA1_TC0WO1G4_IN        MCHP_PINMUX(a, 1, 0xd8, 17, periph)
/* pa1_tc0wo1_out */
#define PA1_TC0WO1_OUT         MCHP_PINMUX(a, 1, 0x210, 24, periph)
/* pa1_tc1wo0_out */
#define PA1_TC1WO0_OUT         MCHP_PINMUX(a, 1, 0x214, 25, periph)
/* pa1_tc1wo1g2_in */
#define PA1_TC1WO1G2_IN        MCHP_PINMUX(a, 1, 0xe4, 1, periph)
/* pa1_tc1wo1_out */
#define PA1_TC1WO1_OUT         MCHP_PINMUX(a, 1, 0x210, 25, periph)
/* pa1_tc2wo0g3_in */
#define PA1_TC2WO0G3_IN        MCHP_PINMUX(a, 1, 0xf0, 23, periph)
/* pa1_tc2wo0_out */
#define PA1_TC2WO0_OUT         MCHP_PINMUX(a, 1, 0x214, 26, periph)
/* pa1_tc2wo1g2_in */
#define PA1_TC2WO1G2_IN        MCHP_PINMUX(a, 1, 0xf4, 1, periph)
/* pa1_tc2wo1g4_in */
#define PA1_TC2WO1G4_IN        MCHP_PINMUX(a, 1, 0xf8, 17, periph)
/* pa1_tc2wo1_out */
#define PA1_TC2WO1_OUT         MCHP_PINMUX(a, 1, 0x210, 26, periph)
/* pa1_tc3wo0g3_in */
#define PA1_TC3WO0G3_IN        MCHP_PINMUX(a, 1, 0x100, 23, periph)
/* pa1_tc3wo0_out */
#define PA1_TC3WO0_OUT         MCHP_PINMUX(a, 1, 0x214, 27, periph)
/* pa1_tc3wo1g2_in */
#define PA1_TC3WO1G2_IN        MCHP_PINMUX(a, 1, 0x104, 1, periph)
/* pa1_tc3wo1g4_in */
#define PA1_TC3WO1G4_IN        MCHP_PINMUX(a, 1, 0x108, 17, periph)
/* pa1_tc3wo1_out */
#define PA1_TC3WO1_OUT         MCHP_PINMUX(a, 1, 0x210, 27, periph)
/* pa1_tc4wo0g3_in */
#define PA1_TC4WO0G3_IN        MCHP_PINMUX(a, 1, 0x110, 23, periph)
/* pa1_tc4wo0_out */
#define PA1_TC4WO0_OUT         MCHP_PINMUX(a, 1, 0x214, 28, periph)
/* pa1_tc4wo1g2_in */
#define PA1_TC4WO1G2_IN        MCHP_PINMUX(a, 1, 0x114, 1, periph)
/* pa1_tc4wo1g4_in */
#define PA1_TC4WO1G4_IN        MCHP_PINMUX(a, 1, 0x118, 17, periph)
/* pa1_tc4wo1_out */
#define PA1_TC4WO1_OUT         MCHP_PINMUX(a, 1, 0x210, 28, periph)
/* pa1_tc5wo0g3_in */
#define PA1_TC5WO0G3_IN        MCHP_PINMUX(a, 1, 0x120, 23, periph)
/* pa1_tc5wo0_out */
#define PA1_TC5WO0_OUT         MCHP_PINMUX(a, 1, 0x214, 29, periph)
/* pa1_tc5wo1g2_in */
#define PA1_TC5WO1G2_IN        MCHP_PINMUX(a, 1, 0x124, 1, periph)
/* pa1_tc5wo1g4_in */
#define PA1_TC5WO1G4_IN        MCHP_PINMUX(a, 1, 0x128, 17, periph)
/* pa1_tc5wo1_out */
#define PA1_TC5WO1_OUT         MCHP_PINMUX(a, 1, 0x210, 29, periph)
/* pa1_tc6wo0g3_in */
#define PA1_TC6WO0G3_IN        MCHP_PINMUX(a, 1, 0x130, 23, periph)
/* pa1_tc6wo0_out */
#define PA1_TC6WO0_OUT         MCHP_PINMUX(a, 1, 0x214, 30, periph)
/* pa1_tc6wo1g2_in */
#define PA1_TC6WO1G2_IN        MCHP_PINMUX(a, 1, 0x134, 1, periph)
/* pa1_tc6wo1g4_in */
#define PA1_TC6WO1G4_IN        MCHP_PINMUX(a, 1, 0x138, 17, periph)
/* pa1_tc6wo1_out */
#define PA1_TC6WO1_OUT         MCHP_PINMUX(a, 1, 0x210, 30, periph)
/* pa1_tc7wo0g3_in */
#define PA1_TC7WO0G3_IN        MCHP_PINMUX(a, 1, 0x140, 23, periph)
/* pa1_tc7wo0_out */
#define PA1_TC7WO0_OUT         MCHP_PINMUX(a, 1, 0x214, 31, periph)
/* pa1_tc7wo1g2_in */
#define PA1_TC7WO1G2_IN        MCHP_PINMUX(a, 1, 0x144, 1, periph)
/* pa1_tc7wo1g4_in */
#define PA1_TC7WO1G4_IN        MCHP_PINMUX(a, 1, 0x148, 17, periph)
/* pa1_tc7wo1_out */
#define PA1_TC7WO1_OUT         MCHP_PINMUX(a, 1, 0x210, 31, periph)
/* pa1_tc8wo0g3_in */
#define PA1_TC8WO0G3_IN        MCHP_PINMUX(a, 1, 0x150, 23, periph)
/* pa1_tc8wo0_out */
#define PA1_TC8WO0_OUT         MCHP_PINMUX(a, 1, 0x214, 32, periph)
/* pa1_tc8wo1g2_in */
#define PA1_TC8WO1G2_IN        MCHP_PINMUX(a, 1, 0x154, 1, periph)
/* pa1_tc8wo1g5_in */
#define PA1_TC8WO1G5_IN        MCHP_PINMUX(a, 1, 0x158, 7, periph)
/* pa1_tc8wo1_out */
#define PA1_TC8WO1_OUT         MCHP_PINMUX(a, 1, 0x210, 32, periph)
/* pa1_tc9wo0g2_in */
#define PA1_TC9WO0G2_IN        MCHP_PINMUX(a, 1, 0x15c, 1, periph)
/* pa1_tc9wo0g4_in */
#define PA1_TC9WO0G4_IN        MCHP_PINMUX(a, 1, 0x160, 17, periph)
/* pa1_tc9wo0_out */
#define PA1_TC9WO0_OUT         MCHP_PINMUX(a, 1, 0x210, 33, periph)
/* pa1_tc9wo1g3_in */
#define PA1_TC9WO1G3_IN        MCHP_PINMUX(a, 1, 0x164, 23, periph)
/* pa1_tc9wo1g5_in */
#define PA1_TC9WO1G5_IN        MCHP_PINMUX(a, 1, 0x168, 7, periph)
/* pa1_tc9wo1_out */
#define PA1_TC9WO1_OUT         MCHP_PINMUX(a, 1, 0x214, 33, periph)
/* pa1_tcc0wo0_out */
#define PA1_TCC0WO0_OUT        MCHP_PINMUX(a, 1, 0x214, 18, periph)
/* pa1_tcc0wo1_out */
#define PA1_TCC0WO1_OUT        MCHP_PINMUX(a, 1, 0x210, 17, periph)
/* pa1_tcc0wo2_out */
#define PA1_TCC0WO2_OUT        MCHP_PINMUX(a, 1, 0x214, 17, periph)
/* pa1_tcc0wo3_out */
#define PA1_TCC0WO3_OUT        MCHP_PINMUX(a, 1, 0x210, 19, periph)
/* pa1_tcc0wo4_out */
#define PA1_TCC0WO4_OUT        MCHP_PINMUX(a, 1, 0x214, 19, periph)
/* pa1_tcc0wo5_out */
#define PA1_TCC0WO5_OUT        MCHP_PINMUX(a, 1, 0x210, 18, periph)
/* pa1_tcc1wo0_out */
#define PA1_TCC1WO0_OUT        MCHP_PINMUX(a, 1, 0x214, 21, periph)
/* pa1_tcc1wo1_out */
#define PA1_TCC1WO1_OUT        MCHP_PINMUX(a, 1, 0x210, 20, periph)
/* pa1_tcc1wo2_out */
