zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz66/pic32cx2051bz66048-pinctrl.h
#define PA1_TCC1WO2_OUT        MCHP_PINMUX(a, 1, 0x214, 20, periph)
/* pa1_tcc1wo3_out */
#define PA1_TCC1WO3_OUT        MCHP_PINMUX(a, 1, 0x210, 22, periph)
/* pa1_tcc1wo4_out */
#define PA1_TCC1WO4_OUT        MCHP_PINMUX(a, 1, 0x214, 22, periph)
/* pa1_tcc1wo5_out */
#define PA1_TCC1WO5_OUT        MCHP_PINMUX(a, 1, 0x210, 21, periph)
/* pa1_tcc2wo0_out */
#define PA1_TCC2WO0_OUT        MCHP_PINMUX(a, 1, 0x214, 23, periph)
/* pa1_tcc2wo1_out */
#define PA1_TCC2WO1_OUT        MCHP_PINMUX(a, 1, 0x210, 23, periph)
/* pa1_tstbus1_out */
#define PA1_TSTBUS1_OUT        MCHP_PINMUX(a, 1, 0x214, 38, periph)
/* pa1_tstbus2_out */
#define PA1_TSTBUS2_OUT        MCHP_PINMUX(a, 1, 0x218, 34, periph)
/* pa1_tstbus3_out */
#define PA1_TSTBUS3_OUT        MCHP_PINMUX(a, 1, 0x21c, 15, periph)
/* pa1_tstbus5_out */
#define PA1_TSTBUS5_OUT        MCHP_PINMUX(a, 1, 0x210, 38, periph)
/* pa1_tstbus6_out */
#define PA1_TSTBUS6_OUT        MCHP_PINMUX(a, 1, 0x218, 35, periph)
/* pa1_tstbus7_out */
#define PA1_TSTBUS7_OUT        MCHP_PINMUX(a, 1, 0x21c, 16, periph)
/* pa1_tstbus9_out */
#define PA1_TSTBUS9_OUT        MCHP_PINMUX(a, 1, 0x210, 39, periph)
/* pa1_tstbus10_out */
#define PA1_TSTBUS10_OUT       MCHP_PINMUX(a, 1, 0x214, 39, periph)
/* pa1_tstbus11_out */
#define PA1_TSTBUS11_OUT       MCHP_PINMUX(a, 1, 0x21c, 17, periph)
/* pa2_accmpten_in */
#define PA2_ACCMPTEN_IN        MCHP_PINMUX(a, 2, 0x18c, 20, periph)
/* pa2_ac_cmp0_out */
#define PA2_AC_CMP0_OUT        MCHP_PINMUX(a, 2, 0x224, 40, periph)
/* pa2_ac_cmp1_out */
#define PA2_AC_CMP1_OUT        MCHP_PINMUX(a, 2, 0x228, 36, periph)
/* pa2_ac_cmptout_out */
#define PA2_AC_CMPTOUT_OUT     MCHP_PINMUX(a, 2, 0x228, 37, periph)
/* pa2_ac_cmptrdy_out */
#define PA2_AC_CMPTRDY_OUT     MCHP_PINMUX(a, 2, 0x224, 41, periph)
/* pa2_can1rx_in */
#define PA2_CAN1RX_IN          MCHP_PINMUX(a, 2, 0x190, 1, periph)
/* pa2_can1_tx_out */
#define PA2_CAN1_TX_OUT        MCHP_PINMUX(a, 2, 0x228, 38, periph)
/* pa2_cclin0_in */
#define PA2_CCLIN0_IN          MCHP_PINMUX(a, 2, 0xb4, 20, periph)
/* pa2_cclin2_in */
#define PA2_CCLIN2_IN          MCHP_PINMUX(a, 2, 0xbc, 1, periph)
/* pa2_cclin3_in */
#define PA2_CCLIN3_IN          MCHP_PINMUX(a, 2, 0xc0, 20, periph)
/* pa2_cclin5_in */
#define PA2_CCLIN5_IN          MCHP_PINMUX(a, 2, 0xc8, 1, periph)
/* pa2_cclo0_out */
#define PA2_CCLO0_OUT          MCHP_PINMUX(a, 2, 0x224, 1, periph)
/* pa2_cclo1_out */
#define PA2_CCLO1_OUT          MCHP_PINMUX(a, 2, 0x228, 1, periph)
/* pa2_coexwlanact_in */
#define PA2_COEXWLANACT_IN     MCHP_PINMUX(a, 2, 0x194, 24, periph)
/* pa2_coex_bt_state_out */
#define PA2_COEX_BT_STATE_OUT  MCHP_PINMUX(a, 2, 0x220, 37, periph)
/* pa2_extint0_in */
#define PA2_EXTINT0_IN         MCHP_PINMUX(a, 2, 0x0, 20, periph)
/* pa2_extint2_in */
#define PA2_EXTINT2_IN         MCHP_PINMUX(a, 2, 0x8, 1, periph)
/* pa2_extint3_in */
#define PA2_EXTINT3_IN         MCHP_PINMUX(a, 2, 0xc, 24, periph)
/* pa2_fectrl1_out */
#define PA2_FECTRL1_OUT        MCHP_PINMUX(a, 2, 0x220, 35, periph)
/* pa2_fectrl2_out */
#define PA2_FECTRL2_OUT        MCHP_PINMUX(a, 2, 0x220, 36, periph)
/* pa2_fectrl3_out */
#define PA2_FECTRL3_OUT        MCHP_PINMUX(a, 2, 0x228, 39, periph)
/* pa2_fectrl4_out */
#define PA2_FECTRL4_OUT        MCHP_PINMUX(a, 2, 0x224, 42, periph)
/* pa2_fectrl5_out */
#define PA2_FECTRL5_OUT        MCHP_PINMUX(a, 2, 0x228, 40, periph)
/* pa2_nmi_in */
#define PA2_NMI_IN             MCHP_PINMUX(a, 2, 0x3c, 24, periph)
/* pa2_qd0_in */
#define PA2_QD0_IN             MCHP_PINMUX(a, 2, 0xa0, 24, periph)
/* pa2_qd0_out */
#define PA2_QD0_OUT            MCHP_PINMUX(a, 2, 0x224, 36, periph)
/* pa2_qd1_in */
#define PA2_QD1_IN             MCHP_PINMUX(a, 2, 0xa4, 20, periph)
/* pa2_qd1_out */
#define PA2_QD1_OUT            MCHP_PINMUX(a, 2, 0x220, 30, periph)
/* pa2_qd2_out */
#define PA2_QD2_OUT            MCHP_PINMUX(a, 2, 0x220, 29, periph)
/* pa2_qd3_in */
#define PA2_QD3_IN             MCHP_PINMUX(a, 2, 0xac, 1, periph)
/* pa2_qd3_out */
#define PA2_QD3_OUT            MCHP_PINMUX(a, 2, 0x220, 28, periph)
/* pa2_qeiccmp0_out */
#define PA2_QEICCMP0_OUT       MCHP_PINMUX(a, 2, 0x220, 31, periph)
/* pa2_qeihome0g1_in */
#define PA2_QEIHOME0G1_IN      MCHP_PINMUX(a, 2, 0x16c, 20, periph)
/* pa2_qeiindx0g3_in */
#define PA2_QEIINDX0G3_IN      MCHP_PINMUX(a, 2, 0x178, 1, periph)
/* pa2_qeiqea0g3_in */
#define PA2_QEIQEA0G3_IN       MCHP_PINMUX(a, 2, 0x17c, 1, periph)
/* pa2_qeiqea0g4_in */
#define PA2_QEIQEA0G4_IN       MCHP_PINMUX(a, 2, 0x180, 24, periph)
/* pa2_qeiqeb0g4_in */
#define PA2_QEIQEB0G4_IN       MCHP_PINMUX(a, 2, 0x184, 24, periph)
/* pa2_qspics_out */
#define PA2_QSPICS_OUT         MCHP_PINMUX(a, 2, 0x220, 27, periph)
/* pa2_scom0p0_out */
#define PA2_SCOM0P0_OUT        MCHP_PINMUX(a, 2, 0x224, 2, periph)
/* pa2_scom0p2_in */
#define PA2_SCOM0P2_IN         MCHP_PINMUX(a, 2, 0x48, 24, periph)
/* pa2_scom0p2_out */
#define PA2_SCOM0P2_OUT        MCHP_PINMUX(a, 2, 0x220, 2, periph)
/* pa2_scom0p3_in */
#define PA2_SCOM0P3_IN         MCHP_PINMUX(a, 2, 0x4c, 20, periph)
/* pa2_scom0p3_out */
#define PA2_SCOM0P3_OUT        MCHP_PINMUX(a, 2, 0x220, 1, periph)
/* pa2_scom1p0_in */
#define PA2_SCOM1P0_IN         MCHP_PINMUX(a, 2, 0x50, 1, periph)
/* pa2_scom1p0_out */
#define PA2_SCOM1P0_OUT        MCHP_PINMUX(a, 2, 0x220, 3, periph)
/* pa2_scom1p2_in */
#define PA2_SCOM1P2_IN         MCHP_PINMUX(a, 2, 0x58, 20, periph)
/* pa2_scom1p2_out */
#define PA2_SCOM1P2_OUT        MCHP_PINMUX(a, 2, 0x220, 4, periph)
/* pa2_scom1p3_out */
#define PA2_SCOM1P3_OUT        MCHP_PINMUX(a, 2, 0x224, 6, periph)
/* pa2_scom2p0_out */
#define PA2_SCOM2P0_OUT        MCHP_PINMUX(a, 2, 0x224, 7, periph)
/* pa2_scom2p2_in */
#define PA2_SCOM2P2_IN         MCHP_PINMUX(a, 2, 0x68, 24, periph)
/* pa2_scom2p2_out */
#define PA2_SCOM2P2_OUT        MCHP_PINMUX(a, 2, 0x220, 6, periph)
/* pa2_scom2p3_in */
#define PA2_SCOM2P3_IN         MCHP_PINMUX(a, 2, 0x6c, 20, periph)
/* pa2_scom2p3_out */
#define PA2_SCOM2P3_OUT        MCHP_PINMUX(a, 2, 0x220, 5, periph)
/* pa2_scom3p0_in */
#define PA2_SCOM3P0_IN         MCHP_PINMUX(a, 2, 0x70, 1, periph)
/* pa2_scom3p0_out */
#define PA2_SCOM3P0_OUT        MCHP_PINMUX(a, 2, 0x220, 7, periph)
/* pa2_scom3p2_in */
#define PA2_SCOM3P2_IN         MCHP_PINMUX(a, 2, 0x78, 20, periph)
/* pa2_scom3p2_out */
#define PA2_SCOM3P2_OUT        MCHP_PINMUX(a, 2, 0x220, 8, periph)
/* pa2_scom3p3_out */
#define PA2_SCOM3P3_OUT        MCHP_PINMUX(a, 2, 0x224, 11, periph)
/* pa2_tc0wo0g1_in */
#define PA2_TC0WO0G1_IN        MCHP_PINMUX(a, 2, 0xcc, 20, periph)
/* pa2_tc0wo0_out */
#define PA2_TC0WO0_OUT         MCHP_PINMUX(a, 2, 0x224, 24, periph)
/* pa2_tc0wo1g3_in */
#define PA2_TC0WO1G3_IN        MCHP_PINMUX(a, 2, 0xd4, 1, periph)
/* pa2_tc0wo1g4_in */
#define PA2_TC0WO1G4_IN        MCHP_PINMUX(a, 2, 0xd8, 24, periph)
/* pa2_tc0wo1_out */
#define PA2_TC0WO1_OUT         MCHP_PINMUX(a, 2, 0x220, 18, periph)
/* pa2_tc1wo0g1_in */
#define PA2_TC1WO0G1_IN        MCHP_PINMUX(a, 2, 0xdc, 20, periph)
/* pa2_tc1wo0_out */
#define PA2_TC1WO0_OUT         MCHP_PINMUX(a, 2, 0x220, 19, periph)
/* pa2_tc1wo1_out */
#define PA2_TC1WO1_OUT         MCHP_PINMUX(a, 2, 0x228, 22, periph)
/* pa2_tc2wo0g1_in */
#define PA2_TC2WO0G1_IN        MCHP_PINMUX(a, 2, 0xec, 20, periph)
/* pa2_tc2wo0g3_in */
#define PA2_TC2WO0G3_IN        MCHP_PINMUX(a, 2, 0xf0, 1, periph)
/* pa2_tc2wo0_out */
#define PA2_TC2WO0_OUT         MCHP_PINMUX(a, 2, 0x220, 20, periph)
/* pa2_tc2wo1g4_in */
#define PA2_TC2WO1G4_IN        MCHP_PINMUX(a, 2, 0xf8, 24, periph)
/* pa2_tc2wo1_out */
#define PA2_TC2WO1_OUT         MCHP_PINMUX(a, 2, 0x228, 23, periph)
/* pa2_tc3wo0g1_in */
#define PA2_TC3WO0G1_IN        MCHP_PINMUX(a, 2, 0xfc, 20, periph)
/* pa2_tc3wo0g3_in */
#define PA2_TC3WO0G3_IN        MCHP_PINMUX(a, 2, 0x100, 1, periph)
/* pa2_tc3wo0_out */
#define PA2_TC3WO0_OUT         MCHP_PINMUX(a, 2, 0x220, 21, periph)
/* pa2_tc3wo1g4_in */
#define PA2_TC3WO1G4_IN        MCHP_PINMUX(a, 2, 0x108, 24, periph)
/* pa2_tc3wo1_out */
#define PA2_TC3WO1_OUT         MCHP_PINMUX(a, 2, 0x228, 24, periph)
/* pa2_tc4wo0g1_in */
#define PA2_TC4WO0G1_IN        MCHP_PINMUX(a, 2, 0x10c, 20, periph)
/* pa2_tc4wo0g3_in */
#define PA2_TC4WO0G3_IN        MCHP_PINMUX(a, 2, 0x110, 1, periph)
/* pa2_tc4wo0_out */
#define PA2_TC4WO0_OUT         MCHP_PINMUX(a, 2, 0x220, 22, periph)
/* pa2_tc4wo1g4_in */
#define PA2_TC4WO1G4_IN        MCHP_PINMUX(a, 2, 0x118, 24, periph)
/* pa2_tc4wo1_out */
#define PA2_TC4WO1_OUT         MCHP_PINMUX(a, 2, 0x228, 25, periph)
/* pa2_tc5wo0g1_in */
#define PA2_TC5WO0G1_IN        MCHP_PINMUX(a, 2, 0x11c, 20, periph)
/* pa2_tc5wo0g3_in */
#define PA2_TC5WO0G3_IN        MCHP_PINMUX(a, 2, 0x120, 1, periph)
/* pa2_tc5wo0_out */
#define PA2_TC5WO0_OUT         MCHP_PINMUX(a, 2, 0x220, 23, periph)
/* pa2_tc5wo1g4_in */
#define PA2_TC5WO1G4_IN        MCHP_PINMUX(a, 2, 0x128, 24, periph)
/* pa2_tc5wo1_out */
#define PA2_TC5WO1_OUT         MCHP_PINMUX(a, 2, 0x228, 26, periph)
/* pa2_tc6wo0g1_in */
#define PA2_TC6WO0G1_IN        MCHP_PINMUX(a, 2, 0x12c, 20, periph)
/* pa2_tc6wo0g3_in */
#define PA2_TC6WO0G3_IN        MCHP_PINMUX(a, 2, 0x130, 1, periph)
/* pa2_tc6wo0_out */
#define PA2_TC6WO0_OUT         MCHP_PINMUX(a, 2, 0x220, 24, periph)
/* pa2_tc6wo1g4_in */
#define PA2_TC6WO1G4_IN        MCHP_PINMUX(a, 2, 0x138, 24, periph)
/* pa2_tc6wo1_out */
#define PA2_TC6WO1_OUT         MCHP_PINMUX(a, 2, 0x228, 27, periph)
/* pa2_tc7wo0g1_in */
#define PA2_TC7WO0G1_IN        MCHP_PINMUX(a, 2, 0x13c, 20, periph)
/* pa2_tc7wo0g3_in */
#define PA2_TC7WO0G3_IN        MCHP_PINMUX(a, 2, 0x140, 1, periph)
/* pa2_tc7wo0_out */
#define PA2_TC7WO0_OUT         MCHP_PINMUX(a, 2, 0x220, 25, periph)
/* pa2_tc7wo1g4_in */
#define PA2_TC7WO1G4_IN        MCHP_PINMUX(a, 2, 0x148, 24, periph)
/* pa2_tc7wo1_out */
#define PA2_TC7WO1_OUT         MCHP_PINMUX(a, 2, 0x228, 28, periph)
/* pa2_tc8wo0g1_in */
#define PA2_TC8WO0G1_IN        MCHP_PINMUX(a, 2, 0x14c, 20, periph)
/* pa2_tc8wo0g3_in */
#define PA2_TC8WO0G3_IN        MCHP_PINMUX(a, 2, 0x150, 1, periph)
/* pa2_tc8wo0_out */
#define PA2_TC8WO0_OUT         MCHP_PINMUX(a, 2, 0x220, 26, periph)
/* pa2_tc9wo0g4_in */
#define PA2_TC9WO0G4_IN        MCHP_PINMUX(a, 2, 0x160, 24, periph)
/* pa2_tc9wo0_out */
#define PA2_TC9WO0_OUT         MCHP_PINMUX(a, 2, 0x228, 29, periph)
/* pa2_tc9wo1g3_in */
#define PA2_TC9WO1G3_IN        MCHP_PINMUX(a, 2, 0x164, 1, periph)
/* pa2_tc9wo1_out */
#define PA2_TC9WO1_OUT         MCHP_PINMUX(a, 2, 0x224, 33, periph)
/* pa2_tcc0wo0_out */
#define PA2_TCC0WO0_OUT        MCHP_PINMUX(a, 2, 0x220, 13, periph)
/* pa2_tcc0wo1_out */
#define PA2_TCC0WO1_OUT        MCHP_PINMUX(a, 2, 0x228, 15, periph)
/* pa2_tcc0wo2_out */
#define PA2_TCC0WO2_OUT        MCHP_PINMUX(a, 2, 0x224, 17, periph)
/* pa2_tcc0wo3_out */
#define PA2_TCC0WO3_OUT        MCHP_PINMUX(a, 2, 0x228, 14, periph)
/* pa2_tcc0wo4_out */
#define PA2_TCC0WO4_OUT        MCHP_PINMUX(a, 2, 0x220, 14, periph)
/* pa2_tcc0wo5_out */
#define PA2_TCC0WO5_OUT        MCHP_PINMUX(a, 2, 0x228, 16, periph)
/* pa2_tcc1wo0_out */
#define PA2_TCC1WO0_OUT        MCHP_PINMUX(a, 2, 0x220, 15, periph)
/* pa2_tcc1wo1_out */
#define PA2_TCC1WO1_OUT        MCHP_PINMUX(a, 2, 0x228, 18, periph)
/* pa2_tcc1wo2_out */
#define PA2_TCC1WO2_OUT        MCHP_PINMUX(a, 2, 0x224, 20, periph)
/* pa2_tcc1wo3_out */
#define PA2_TCC1WO3_OUT        MCHP_PINMUX(a, 2, 0x228, 17, periph)
/* pa2_tcc1wo4_out */
#define PA2_TCC1WO4_OUT        MCHP_PINMUX(a, 2, 0x220, 16, periph)
/* pa2_tcc1wo5_out */
#define PA2_TCC1WO5_OUT        MCHP_PINMUX(a, 2, 0x228, 19, periph)
/* pa2_tcc2wo0_out */
#define PA2_TCC2WO0_OUT        MCHP_PINMUX(a, 2, 0x220, 17, periph)
/* pa2_tcc2wo1_out */
#define PA2_TCC2WO1_OUT        MCHP_PINMUX(a, 2, 0x228, 20, periph)
/* pa2_tstbus0_out */
#define PA2_TSTBUS0_OUT        MCHP_PINMUX(a, 2, 0x220, 32, periph)
/* pa2_tstbus1_out */
#define PA2_TSTBUS1_OUT        MCHP_PINMUX(a, 2, 0x224, 38, periph)
/* pa2_tstbus2_out */
#define PA2_TSTBUS2_OUT        MCHP_PINMUX(a, 2, 0x228, 34, periph)
/* pa2_tstbus4_out */
#define PA2_TSTBUS4_OUT        MCHP_PINMUX(a, 2, 0x220, 33, periph)
/* pa2_tstbus6_out */
#define PA2_TSTBUS6_OUT        MCHP_PINMUX(a, 2, 0x228, 35, periph)
/* pa2_tstbus8_out */
#define PA2_TSTBUS8_OUT        MCHP_PINMUX(a, 2, 0x220, 34, periph)
/* pa2_tstbus10_out */
#define PA2_TSTBUS10_OUT       MCHP_PINMUX(a, 2, 0x224, 39, periph)
/* pa3_accmpten_in */
#define PA3_ACCMPTEN_IN        MCHP_PINMUX(a, 3, 0x18c, 15, periph)
/* pa3_ac_cmp1_out */
#define PA3_AC_CMP1_OUT        MCHP_PINMUX(a, 3, 0x234, 36, periph)
/* pa3_ac_cmptout_out */
#define PA3_AC_CMPTOUT_OUT     MCHP_PINMUX(a, 3, 0x234, 37, periph)
/* pa3_can1_tx_out */
#define PA3_CAN1_TX_OUT        MCHP_PINMUX(a, 3, 0x234, 38, periph)
/* pa3_cclin0_in */
#define PA3_CCLIN0_IN          MCHP_PINMUX(a, 3, 0xb4, 15, periph)
/* pa3_cclin1_in */
#define PA3_CCLIN1_IN          MCHP_PINMUX(a, 3, 0xb8, 10, periph)
/* pa3_cclin3_in */
#define PA3_CCLIN3_IN          MCHP_PINMUX(a, 3, 0xc0, 15, periph)
/* pa3_cclin4_in */
#define PA3_CCLIN4_IN          MCHP_PINMUX(a, 3, 0xc4, 10, periph)
/* pa3_cclo1_out */
#define PA3_CCLO1_OUT          MCHP_PINMUX(a, 3, 0x230, 1, periph)
/* pa3_coexwlanact_in */
#define PA3_COEXWLANACT_IN     MCHP_PINMUX(a, 3, 0x194, 1, periph)
/* pa3_coex_bt_state_out */
#define PA3_COEX_BT_STATE_OUT  MCHP_PINMUX(a, 3, 0x22c, 37, periph)
/* pa3_coex_rf_act_out */
#define PA3_COEX_RF_ACT_OUT    MCHP_PINMUX(a, 3, 0x230, 41, periph)
/* pa3_extint0_in */
#define PA3_EXTINT0_IN         MCHP_PINMUX(a, 3, 0x0, 15, periph)
/* pa3_extint1_in */
#define PA3_EXTINT1_IN         MCHP_PINMUX(a, 3, 0x4, 10, periph)
/* pa3_extint3_in */
#define PA3_EXTINT3_IN         MCHP_PINMUX(a, 3, 0xc, 1, periph)
/* pa3_fectrl0_out */
#define PA3_FECTRL0_OUT        MCHP_PINMUX(a, 3, 0x230, 40, periph)
/* pa3_fectrl1_out */
#define PA3_FECTRL1_OUT        MCHP_PINMUX(a, 3, 0x22c, 35, periph)
/* pa3_fectrl2_out */
#define PA3_FECTRL2_OUT        MCHP_PINMUX(a, 3, 0x22c, 36, periph)
/* pa3_fectrl3_out */
#define PA3_FECTRL3_OUT        MCHP_PINMUX(a, 3, 0x234, 39, periph)
/* pa3_fectrl5_out */
#define PA3_FECTRL5_OUT        MCHP_PINMUX(a, 3, 0x234, 40, periph)
/* pa3_nmi_in */
#define PA3_NMI_IN             MCHP_PINMUX(a, 3, 0x3c, 1, periph)
/* pa3_qd0_in */
#define PA3_QD0_IN             MCHP_PINMUX(a, 3, 0xa0, 1, periph)
/* pa3_qd0_out */
#define PA3_QD0_OUT            MCHP_PINMUX(a, 3, 0x230, 35, periph)
/* pa3_qd1_in */
#define PA3_QD1_IN             MCHP_PINMUX(a, 3, 0xa4, 15, periph)
/* pa3_qd1_out */
#define PA3_QD1_OUT            MCHP_PINMUX(a, 3, 0x22c, 30, periph)
/* pa3_qd2_in */
#define PA3_QD2_IN             MCHP_PINMUX(a, 3, 0xa8, 10, periph)
/* pa3_qd2_out */
#define PA3_QD2_OUT            MCHP_PINMUX(a, 3, 0x22c, 29, periph)
/* pa3_qd3_out */
#define PA3_QD3_OUT            MCHP_PINMUX(a, 3, 0x22c, 28, periph)
/* pa3_qeiccmp0_out */
#define PA3_QEICCMP0_OUT       MCHP_PINMUX(a, 3, 0x22c, 31, periph)
/* pa3_qeihome0g1_in */
#define PA3_QEIHOME0G1_IN      MCHP_PINMUX(a, 3, 0x16c, 15, periph)
/* pa3_qeihome0g2_in */
#define PA3_QEIHOME0G2_IN      MCHP_PINMUX(a, 3, 0x170, 10, periph)
/* pa3_qeiindx0g2_in */
#define PA3_QEIINDX0G2_IN      MCHP_PINMUX(a, 3, 0x174, 10, periph)
/* pa3_qeiqea0g4_in */
#define PA3_QEIQEA0G4_IN       MCHP_PINMUX(a, 3, 0x180, 1, periph)
/* pa3_qeiqeb0g4_in */
#define PA3_QEIQEB0G4_IN       MCHP_PINMUX(a, 3, 0x184, 1, periph)
/* pa3_qspics_out */
#define PA3_QSPICS_OUT         MCHP_PINMUX(a, 3, 0x22c, 27, periph)
/* pa3_qspi_sck_out */
#define PA3_QSPI_SCK_OUT       MCHP_PINMUX(a, 3, 0x238, 7, periph)
/* pa3_refi_in */
#define PA3_REFI_IN            MCHP_PINMUX(a, 3, 0xb0, 6, periph)
/* pa3_refo1_out */
#define PA3_REFO1_OUT          MCHP_PINMUX(a, 3, 0x238, 8, periph)
/* pa3_refo2_out */
#define PA3_REFO2_OUT          MCHP_PINMUX(a, 3, 0x238, 9, periph)
/* pa3_refo3_out */
#define PA3_REFO3_OUT          MCHP_PINMUX(a, 3, 0x238, 10, periph)
/* pa3_refo4_out */
#define PA3_REFO4_OUT          MCHP_PINMUX(a, 3, 0x238, 11, periph)
/* pa3_scom0p0_in */
#define PA3_SCOM0P0_IN         MCHP_PINMUX(a, 3, 0x40, 10, periph)
/* pa3_scom0p0_out */
#define PA3_SCOM0P0_OUT        MCHP_PINMUX(a, 3, 0x230, 2, periph)
/* pa3_scom0p1_in */
#define PA3_SCOM0P1_IN         MCHP_PINMUX(a, 3, 0x44, 6, periph)
/* pa3_scom0p1_out */
#define PA3_SCOM0P1_OUT        MCHP_PINMUX(a, 3, 0x238, 1, periph)
/* pa3_scom0p2_in */
#define PA3_SCOM0P2_IN         MCHP_PINMUX(a, 3, 0x48, 1, periph)
/* pa3_scom0p2_out */
#define PA3_SCOM0P2_OUT        MCHP_PINMUX(a, 3, 0x22c, 2, periph)
/* pa3_scom0p3_in */
#define PA3_SCOM0P3_IN         MCHP_PINMUX(a, 3, 0x4c, 15, periph)
/* pa3_scom0p3_out */
#define PA3_SCOM0P3_OUT        MCHP_PINMUX(a, 3, 0x22c, 1, periph)
/* pa3_scom1p0_out */
#define PA3_SCOM1P0_OUT        MCHP_PINMUX(a, 3, 0x22c, 3, periph)
/* pa3_scom1p1_in */
#define PA3_SCOM1P1_IN         MCHP_PINMUX(a, 3, 0x54, 6, periph)
/* pa3_scom1p1_out */
#define PA3_SCOM1P1_OUT        MCHP_PINMUX(a, 3, 0x238, 2, periph)
/* pa3_scom1p2_in */
#define PA3_SCOM1P2_IN         MCHP_PINMUX(a, 3, 0x58, 15, periph)
/* pa3_scom1p2_out */
#define PA3_SCOM1P2_OUT        MCHP_PINMUX(a, 3, 0x22c, 4, periph)
/* pa3_scom1p3_in */
#define PA3_SCOM1P3_IN         MCHP_PINMUX(a, 3, 0x5c, 10, periph)
/* pa3_scom1p3_out */
#define PA3_SCOM1P3_OUT        MCHP_PINMUX(a, 3, 0x230, 5, periph)
/* pa3_scom2p0_in */
#define PA3_SCOM2P0_IN         MCHP_PINMUX(a, 3, 0x60, 10, periph)
/* pa3_scom2p0_out */
#define PA3_SCOM2P0_OUT        MCHP_PINMUX(a, 3, 0x230, 7, periph)
/* pa3_scom2p1_in */
#define PA3_SCOM2P1_IN         MCHP_PINMUX(a, 3, 0x64, 6, periph)
/* pa3_scom2p1_out */
#define PA3_SCOM2P1_OUT        MCHP_PINMUX(a, 3, 0x238, 3, periph)
/* pa3_scom2p2_in */
#define PA3_SCOM2P2_IN         MCHP_PINMUX(a, 3, 0x68, 1, periph)
/* pa3_scom2p2_out */
#define PA3_SCOM2P2_OUT        MCHP_PINMUX(a, 3, 0x22c, 6, periph)
/* pa3_scom2p3_in */
#define PA3_SCOM2P3_IN         MCHP_PINMUX(a, 3, 0x6c, 15, periph)
/* pa3_scom2p3_out */
#define PA3_SCOM2P3_OUT        MCHP_PINMUX(a, 3, 0x22c, 5, periph)
/* pa3_scom3p0_out */
#define PA3_SCOM3P0_OUT        MCHP_PINMUX(a, 3, 0x22c, 7, periph)
/* pa3_scom3p1_in */
#define PA3_SCOM3P1_IN         MCHP_PINMUX(a, 3, 0x74, 6, periph)
/* pa3_scom3p1_out */
#define PA3_SCOM3P1_OUT        MCHP_PINMUX(a, 3, 0x238, 4, periph)
/* pa3_scom3p2_in */
#define PA3_SCOM3P2_IN         MCHP_PINMUX(a, 3, 0x78, 15, periph)
/* pa3_scom3p2_out */
#define PA3_SCOM3P2_OUT        MCHP_PINMUX(a, 3, 0x22c, 8, periph)
/* pa3_scom3p3_in */
#define PA3_SCOM3P3_IN         MCHP_PINMUX(a, 3, 0x7c, 10, periph)
/* pa3_scom3p3_out */
#define PA3_SCOM3P3_OUT        MCHP_PINMUX(a, 3, 0x230, 10, periph)
/* pa3_tc0wo0g1_in */
#define PA3_TC0WO0G1_IN        MCHP_PINMUX(a, 3, 0xcc, 15, periph)
/* pa3_tc0wo0g2_in */
#define PA3_TC0WO0G2_IN        MCHP_PINMUX(a, 3, 0xd0, 10, periph)
/* pa3_tc0wo0_out */
#define PA3_TC0WO0_OUT         MCHP_PINMUX(a, 3, 0x234, 21, periph)
/* pa3_tc0wo1g4_in */
#define PA3_TC0WO1G4_IN        MCHP_PINMUX(a, 3, 0xd8, 1, periph)
/* pa3_tc0wo1_out */
#define PA3_TC0WO1_OUT         MCHP_PINMUX(a, 3, 0x22c, 18, periph)
/* pa3_tc1wo0g1_in */
#define PA3_TC1WO0G1_IN        MCHP_PINMUX(a, 3, 0xdc, 15, periph)
/* pa3_tc1wo0_out */
#define PA3_TC1WO0_OUT         MCHP_PINMUX(a, 3, 0x22c, 19, periph)
/* pa3_tc1wo1g2_in */
#define PA3_TC1WO1G2_IN        MCHP_PINMUX(a, 3, 0xe4, 10, periph)
/* pa3_tc1wo1_out */
#define PA3_TC1WO1_OUT         MCHP_PINMUX(a, 3, 0x230, 25, periph)
/* pa3_tc2wo0g1_in */
#define PA3_TC2WO0G1_IN        MCHP_PINMUX(a, 3, 0xec, 15, periph)
/* pa3_tc2wo0_out */
#define PA3_TC2WO0_OUT         MCHP_PINMUX(a, 3, 0x22c, 20, periph)
/* pa3_tc2wo1g2_in */
#define PA3_TC2WO1G2_IN        MCHP_PINMUX(a, 3, 0xf4, 10, periph)
/* pa3_tc2wo1g4_in */
#define PA3_TC2WO1G4_IN        MCHP_PINMUX(a, 3, 0xf8, 1, periph)
/* pa3_tc2wo1_out */
#define PA3_TC2WO1_OUT         MCHP_PINMUX(a, 3, 0x230, 26, periph)
/* pa3_tc3wo0g1_in */
#define PA3_TC3WO0G1_IN        MCHP_PINMUX(a, 3, 0xfc, 15, periph)
/* pa3_tc3wo0_out */
#define PA3_TC3WO0_OUT         MCHP_PINMUX(a, 3, 0x22c, 21, periph)
/* pa3_tc3wo1g2_in */
#define PA3_TC3WO1G2_IN        MCHP_PINMUX(a, 3, 0x104, 10, periph)
/* pa3_tc3wo1g4_in */
#define PA3_TC3WO1G4_IN        MCHP_PINMUX(a, 3, 0x108, 1, periph)
/* pa3_tc3wo1_out */
#define PA3_TC3WO1_OUT         MCHP_PINMUX(a, 3, 0x230, 27, periph)
/* pa3_tc4wo0g1_in */
#define PA3_TC4WO0G1_IN        MCHP_PINMUX(a, 3, 0x10c, 15, periph)
/* pa3_tc4wo0_out */
#define PA3_TC4WO0_OUT         MCHP_PINMUX(a, 3, 0x22c, 22, periph)
/* pa3_tc4wo1g2_in */
#define PA3_TC4WO1G2_IN        MCHP_PINMUX(a, 3, 0x114, 10, periph)
/* pa3_tc4wo1g4_in */
#define PA3_TC4WO1G4_IN        MCHP_PINMUX(a, 3, 0x118, 1, periph)
/* pa3_tc4wo1_out */
#define PA3_TC4WO1_OUT         MCHP_PINMUX(a, 3, 0x230, 28, periph)
/* pa3_tc5wo0g1_in */
#define PA3_TC5WO0G1_IN        MCHP_PINMUX(a, 3, 0x11c, 15, periph)
/* pa3_tc5wo0_out */
#define PA3_TC5WO0_OUT         MCHP_PINMUX(a, 3, 0x22c, 23, periph)
/* pa3_tc5wo1g2_in */
#define PA3_TC5WO1G2_IN        MCHP_PINMUX(a, 3, 0x124, 10, periph)
/* pa3_tc5wo1g4_in */
#define PA3_TC5WO1G4_IN        MCHP_PINMUX(a, 3, 0x128, 1, periph)
/* pa3_tc5wo1_out */
#define PA3_TC5WO1_OUT         MCHP_PINMUX(a, 3, 0x230, 29, periph)
/* pa3_tc6wo0g1_in */
#define PA3_TC6WO0G1_IN        MCHP_PINMUX(a, 3, 0x12c, 15, periph)
/* pa3_tc6wo0_out */
#define PA3_TC6WO0_OUT         MCHP_PINMUX(a, 3, 0x22c, 24, periph)
/* pa3_tc6wo1g2_in */
#define PA3_TC6WO1G2_IN        MCHP_PINMUX(a, 3, 0x134, 10, periph)
/* pa3_tc6wo1g4_in */
#define PA3_TC6WO1G4_IN        MCHP_PINMUX(a, 3, 0x138, 1, periph)
/* pa3_tc6wo1_out */
#define PA3_TC6WO1_OUT         MCHP_PINMUX(a, 3, 0x230, 30, periph)
/* pa3_tc7wo0g1_in */
#define PA3_TC7WO0G1_IN        MCHP_PINMUX(a, 3, 0x13c, 15, periph)
/* pa3_tc7wo0_out */
#define PA3_TC7WO0_OUT         MCHP_PINMUX(a, 3, 0x22c, 25, periph)
/* pa3_tc7wo1g2_in */
#define PA3_TC7WO1G2_IN        MCHP_PINMUX(a, 3, 0x144, 10, periph)
/* pa3_tc7wo1g4_in */
#define PA3_TC7WO1G4_IN        MCHP_PINMUX(a, 3, 0x148, 1, periph)
/* pa3_tc7wo1_out */
#define PA3_TC7WO1_OUT         MCHP_PINMUX(a, 3, 0x230, 31, periph)
/* pa3_tc8wo0g1_in */
#define PA3_TC8WO0G1_IN        MCHP_PINMUX(a, 3, 0x14c, 15, periph)
/* pa3_tc8wo0_out */
#define PA3_TC8WO0_OUT         MCHP_PINMUX(a, 3, 0x22c, 26, periph)
/* pa3_tc8wo1g2_in */
#define PA3_TC8WO1G2_IN        MCHP_PINMUX(a, 3, 0x154, 10, periph)
/* pa3_tc8wo1_out */
#define PA3_TC8WO1_OUT         MCHP_PINMUX(a, 3, 0x230, 32, periph)
/* pa3_tc9wo0g2_in */
#define PA3_TC9WO0G2_IN        MCHP_PINMUX(a, 3, 0x15c, 10, periph)
/* pa3_tc9wo0g4_in */
#define PA3_TC9WO0G4_IN        MCHP_PINMUX(a, 3, 0x160, 1, periph)
/* pa3_tc9wo0_out */
#define PA3_TC9WO0_OUT         MCHP_PINMUX(a, 3, 0x230, 33, periph)
/* pa3_tcc0wo0_out */
#define PA3_TCC0WO0_OUT        MCHP_PINMUX(a, 3, 0x22c, 13, periph)
/* pa3_tcc0wo1_out */
#define PA3_TCC0WO1_OUT        MCHP_PINMUX(a, 3, 0x230, 17, periph)
/* pa3_tcc0wo3_out */
#define PA3_TCC0WO3_OUT        MCHP_PINMUX(a, 3, 0x230, 19, periph)
/* pa3_tcc0wo4_out */
#define PA3_TCC0WO4_OUT        MCHP_PINMUX(a, 3, 0x22c, 14, periph)
/* pa3_tcc0wo5_out */
#define PA3_TCC0WO5_OUT        MCHP_PINMUX(a, 3, 0x230, 18, periph)
/* pa3_tcc1wo0_out */
#define PA3_TCC1WO0_OUT        MCHP_PINMUX(a, 3, 0x22c, 15, periph)
/* pa3_tcc1wo1_out */
#define PA3_TCC1WO1_OUT        MCHP_PINMUX(a, 3, 0x230, 20, periph)
/* pa3_tcc1wo3_out */
#define PA3_TCC1WO3_OUT        MCHP_PINMUX(a, 3, 0x230, 22, periph)
/* pa3_tcc1wo4_out */
#define PA3_TCC1WO4_OUT        MCHP_PINMUX(a, 3, 0x22c, 16, periph)
/* pa3_tcc1wo5_out */
#define PA3_TCC1WO5_OUT        MCHP_PINMUX(a, 3, 0x230, 21, periph)
/* pa3_tcc2wo0_out */
#define PA3_TCC2WO0_OUT        MCHP_PINMUX(a, 3, 0x22c, 17, periph)
/* pa3_tcc2wo1_out */
#define PA3_TCC2WO1_OUT        MCHP_PINMUX(a, 3, 0x230, 23, periph)
/* pa3_tstbus0_out */
#define PA3_TSTBUS0_OUT        MCHP_PINMUX(a, 3, 0x22c, 32, periph)
/* pa3_tstbus2_out */
