zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz66/pic32cx2051bz66048-pinctrl.h
#define PA3_TSTBUS2_OUT        MCHP_PINMUX(a, 3, 0x234, 34, periph)
/* pa3_tstbus4_out */
#define PA3_TSTBUS4_OUT        MCHP_PINMUX(a, 3, 0x22c, 33, periph)
/* pa3_tstbus5_out */
#define PA3_TSTBUS5_OUT        MCHP_PINMUX(a, 3, 0x230, 38, periph)
/* pa3_tstbus6_out */
#define PA3_TSTBUS6_OUT        MCHP_PINMUX(a, 3, 0x234, 35, periph)
/* pa3_tstbus8_out */
#define PA3_TSTBUS8_OUT        MCHP_PINMUX(a, 3, 0x22c, 34, periph)
/* pa3_tstbus9_out */
#define PA3_TSTBUS9_OUT        MCHP_PINMUX(a, 3, 0x230, 39, periph)
/* pa4_ac_cmp0_out */
#define PA4_AC_CMP0_OUT        MCHP_PINMUX(a, 4, 0x240, 40, periph)
/* pa4_ac_cmptrdy_out */
#define PA4_AC_CMPTRDY_OUT     MCHP_PINMUX(a, 4, 0x240, 41, periph)
/* pa4_can1rx_in */
#define PA4_CAN1RX_IN          MCHP_PINMUX(a, 4, 0x190, 10, periph)
/* pa4_cclin1_in */
#define PA4_CCLIN1_IN          MCHP_PINMUX(a, 4, 0xb8, 15, periph)
/* pa4_cclin2_in */
#define PA4_CCLIN2_IN          MCHP_PINMUX(a, 4, 0xbc, 10, periph)
/* pa4_cclin4_in */
#define PA4_CCLIN4_IN          MCHP_PINMUX(a, 4, 0xc4, 15, periph)
/* pa4_cclin5_in */
#define PA4_CCLIN5_IN          MCHP_PINMUX(a, 4, 0xc8, 10, periph)
/* pa4_cclo0_out */
#define PA4_CCLO0_OUT          MCHP_PINMUX(a, 4, 0x240, 1, periph)
/* pa4_cclo1_out */
#define PA4_CCLO1_OUT          MCHP_PINMUX(a, 4, 0x23c, 1, periph)
/* pa4_coex_rf_act_out */
#define PA4_COEX_RF_ACT_OUT    MCHP_PINMUX(a, 4, 0x23c, 41, periph)
/* pa4_extint1_in */
#define PA4_EXTINT1_IN         MCHP_PINMUX(a, 4, 0x4, 15, periph)
/* pa4_extint2_in */
#define PA4_EXTINT2_IN         MCHP_PINMUX(a, 4, 0x8, 10, periph)
/* pa4_fectrl0_out */
#define PA4_FECTRL0_OUT        MCHP_PINMUX(a, 4, 0x23c, 40, periph)
/* pa4_fectrl4_out */
#define PA4_FECTRL4_OUT        MCHP_PINMUX(a, 4, 0x240, 42, periph)
/* pa4_qd0_out */
#define PA4_QD0_OUT            MCHP_PINMUX(a, 4, 0x23c, 35, periph)
/* pa4_qd1_out */
#define PA4_QD1_OUT            MCHP_PINMUX(a, 4, 0x240, 35, periph)
/* pa4_qd2_in */
#define PA4_QD2_IN             MCHP_PINMUX(a, 4, 0xa8, 15, periph)
/* pa4_qd2_out */
#define PA4_QD2_OUT            MCHP_PINMUX(a, 4, 0x23c, 37, periph)
/* pa4_qd3_in */
#define PA4_QD3_IN             MCHP_PINMUX(a, 4, 0xac, 10, periph)
/* pa4_qd3_out */
#define PA4_QD3_OUT            MCHP_PINMUX(a, 4, 0x23c, 36, periph)
/* pa4_qeiccmp0_out */
#define PA4_QEICCMP0_OUT       MCHP_PINMUX(a, 4, 0x244, 13, periph)
/* pa4_qeihome0g2_in */
#define PA4_QEIHOME0G2_IN      MCHP_PINMUX(a, 4, 0x170, 15, periph)
/* pa4_qeiindx0g2_in */
#define PA4_QEIINDX0G2_IN      MCHP_PINMUX(a, 4, 0x174, 15, periph)
/* pa4_qeiindx0g3_in */
#define PA4_QEIINDX0G3_IN      MCHP_PINMUX(a, 4, 0x178, 10, periph)
/* pa4_qeiqea0g3_in */
#define PA4_QEIQEA0G3_IN       MCHP_PINMUX(a, 4, 0x17c, 10, periph)
/* pa4_qeiqeb0g5_in */
#define PA4_QEIQEB0G5_IN       MCHP_PINMUX(a, 4, 0x188, 1, periph)
/* pa4_qspics_out */
#define PA4_QSPICS_OUT         MCHP_PINMUX(a, 4, 0x23c, 34, periph)
/* pa4_scom0p0_in */
#define PA4_SCOM0P0_IN         MCHP_PINMUX(a, 4, 0x40, 15, periph)
/* pa4_scom0p0_out */
#define PA4_SCOM0P0_OUT        MCHP_PINMUX(a, 4, 0x23c, 2, periph)
/* pa4_scom0p2_out */
#define PA4_SCOM0P2_OUT        MCHP_PINMUX(a, 4, 0x23c, 4, periph)
/* pa4_scom0p3_out */
#define PA4_SCOM0P3_OUT        MCHP_PINMUX(a, 4, 0x23c, 3, periph)
/* pa4_scom1p0_in */
#define PA4_SCOM1P0_IN         MCHP_PINMUX(a, 4, 0x50, 10, periph)
/* pa4_scom1p0_out */
#define PA4_SCOM1P0_OUT        MCHP_PINMUX(a, 4, 0x240, 5, periph)
/* pa4_scom1p2_out */
#define PA4_SCOM1P2_OUT        MCHP_PINMUX(a, 4, 0x23c, 6, periph)
/* pa4_scom1p3_in */
#define PA4_SCOM1P3_IN         MCHP_PINMUX(a, 4, 0x5c, 15, periph)
/* pa4_scom1p3_out */
#define PA4_SCOM1P3_OUT        MCHP_PINMUX(a, 4, 0x23c, 5, periph)
/* pa4_scom2p0_in */
#define PA4_SCOM2P0_IN         MCHP_PINMUX(a, 4, 0x60, 15, periph)
/* pa4_scom2p0_out */
#define PA4_SCOM2P0_OUT        MCHP_PINMUX(a, 4, 0x23c, 7, periph)
/* pa4_scom2p2_out */
#define PA4_SCOM2P2_OUT        MCHP_PINMUX(a, 4, 0x23c, 9, periph)
/* pa4_scom2p3_out */
#define PA4_SCOM2P3_OUT        MCHP_PINMUX(a, 4, 0x23c, 8, periph)
/* pa4_scom3p0_in */
#define PA4_SCOM3P0_IN         MCHP_PINMUX(a, 4, 0x70, 10, periph)
/* pa4_scom3p0_out */
#define PA4_SCOM3P0_OUT        MCHP_PINMUX(a, 4, 0x240, 10, periph)
/* pa4_scom3p2_out */
#define PA4_SCOM3P2_OUT        MCHP_PINMUX(a, 4, 0x23c, 11, periph)
/* pa4_scom3p3_in */
#define PA4_SCOM3P3_IN         MCHP_PINMUX(a, 4, 0x7c, 15, periph)
/* pa4_scom3p3_out */
#define PA4_SCOM3P3_OUT        MCHP_PINMUX(a, 4, 0x23c, 10, periph)
/* pa4_tc0wo0g2_in */
#define PA4_TC0WO0G2_IN        MCHP_PINMUX(a, 4, 0xd0, 15, periph)
/* pa4_tc0wo0_out */
#define PA4_TC0WO0_OUT         MCHP_PINMUX(a, 4, 0x240, 24, periph)
/* pa4_tc0wo1g3_in */
#define PA4_TC0WO1G3_IN        MCHP_PINMUX(a, 4, 0xd4, 10, periph)
/* pa4_tc0wo1_out */
#define PA4_TC0WO1_OUT         MCHP_PINMUX(a, 4, 0x23c, 24, periph)
/* pa4_tc1wo0_out */
#define PA4_TC1WO0_OUT         MCHP_PINMUX(a, 4, 0x240, 25, periph)
/* pa4_tc1wo1g2_in */
#define PA4_TC1WO1G2_IN        MCHP_PINMUX(a, 4, 0xe4, 15, periph)
/* pa4_tc1wo1_out */
#define PA4_TC1WO1_OUT         MCHP_PINMUX(a, 4, 0x23c, 25, periph)
/* pa4_tc2wo0g3_in */
#define PA4_TC2WO0G3_IN        MCHP_PINMUX(a, 4, 0xf0, 10, periph)
/* pa4_tc2wo0_out */
#define PA4_TC2WO0_OUT         MCHP_PINMUX(a, 4, 0x240, 26, periph)
/* pa4_tc2wo1g2_in */
#define PA4_TC2WO1G2_IN        MCHP_PINMUX(a, 4, 0xf4, 15, periph)
/* pa4_tc2wo1_out */
#define PA4_TC2WO1_OUT         MCHP_PINMUX(a, 4, 0x23c, 26, periph)
/* pa4_tc3wo0g3_in */
#define PA4_TC3WO0G3_IN        MCHP_PINMUX(a, 4, 0x100, 10, periph)
/* pa4_tc3wo0_out */
#define PA4_TC3WO0_OUT         MCHP_PINMUX(a, 4, 0x240, 27, periph)
/* pa4_tc3wo1g2_in */
#define PA4_TC3WO1G2_IN        MCHP_PINMUX(a, 4, 0x104, 15, periph)
/* pa4_tc3wo1_out */
#define PA4_TC3WO1_OUT         MCHP_PINMUX(a, 4, 0x23c, 27, periph)
/* pa4_tc4wo0g3_in */
#define PA4_TC4WO0G3_IN        MCHP_PINMUX(a, 4, 0x110, 10, periph)
/* pa4_tc4wo0_out */
#define PA4_TC4WO0_OUT         MCHP_PINMUX(a, 4, 0x240, 28, periph)
/* pa4_tc4wo1g2_in */
#define PA4_TC4WO1G2_IN        MCHP_PINMUX(a, 4, 0x114, 15, periph)
/* pa4_tc4wo1_out */
#define PA4_TC4WO1_OUT         MCHP_PINMUX(a, 4, 0x23c, 28, periph)
/* pa4_tc5wo0g3_in */
#define PA4_TC5WO0G3_IN        MCHP_PINMUX(a, 4, 0x120, 10, periph)
/* pa4_tc5wo0_out */
#define PA4_TC5WO0_OUT         MCHP_PINMUX(a, 4, 0x240, 29, periph)
/* pa4_tc5wo1g2_in */
#define PA4_TC5WO1G2_IN        MCHP_PINMUX(a, 4, 0x124, 15, periph)
/* pa4_tc5wo1_out */
#define PA4_TC5WO1_OUT         MCHP_PINMUX(a, 4, 0x23c, 29, periph)
/* pa4_tc6wo0g3_in */
#define PA4_TC6WO0G3_IN        MCHP_PINMUX(a, 4, 0x130, 10, periph)
/* pa4_tc6wo0_out */
#define PA4_TC6WO0_OUT         MCHP_PINMUX(a, 4, 0x240, 30, periph)
/* pa4_tc6wo1g2_in */
#define PA4_TC6WO1G2_IN        MCHP_PINMUX(a, 4, 0x134, 15, periph)
/* pa4_tc6wo1_out */
#define PA4_TC6WO1_OUT         MCHP_PINMUX(a, 4, 0x23c, 30, periph)
/* pa4_tc7wo0g3_in */
#define PA4_TC7WO0G3_IN        MCHP_PINMUX(a, 4, 0x140, 10, periph)
/* pa4_tc7wo0_out */
#define PA4_TC7WO0_OUT         MCHP_PINMUX(a, 4, 0x240, 31, periph)
/* pa4_tc7wo1g2_in */
#define PA4_TC7WO1G2_IN        MCHP_PINMUX(a, 4, 0x144, 15, periph)
/* pa4_tc7wo1_out */
#define PA4_TC7WO1_OUT         MCHP_PINMUX(a, 4, 0x23c, 31, periph)
/* pa4_tc8wo0g3_in */
#define PA4_TC8WO0G3_IN        MCHP_PINMUX(a, 4, 0x150, 10, periph)
/* pa4_tc8wo0_out */
#define PA4_TC8WO0_OUT         MCHP_PINMUX(a, 4, 0x240, 32, periph)
/* pa4_tc8wo1g2_in */
#define PA4_TC8WO1G2_IN        MCHP_PINMUX(a, 4, 0x154, 15, periph)
/* pa4_tc8wo1g5_in */
#define PA4_TC8WO1G5_IN        MCHP_PINMUX(a, 4, 0x158, 1, periph)
/* pa4_tc8wo1_out */
#define PA4_TC8WO1_OUT         MCHP_PINMUX(a, 4, 0x23c, 32, periph)
/* pa4_tc9wo0g2_in */
#define PA4_TC9WO0G2_IN        MCHP_PINMUX(a, 4, 0x15c, 15, periph)
/* pa4_tc9wo0_out */
#define PA4_TC9WO0_OUT         MCHP_PINMUX(a, 4, 0x23c, 33, periph)
/* pa4_tc9wo1g3_in */
#define PA4_TC9WO1G3_IN        MCHP_PINMUX(a, 4, 0x164, 10, periph)
/* pa4_tc9wo1g5_in */
#define PA4_TC9WO1G5_IN        MCHP_PINMUX(a, 4, 0x168, 1, periph)
/* pa4_tc9wo1_out */
#define PA4_TC9WO1_OUT         MCHP_PINMUX(a, 4, 0x240, 33, periph)
/* pa4_tcc0wo0_out */
#define PA4_TCC0WO0_OUT        MCHP_PINMUX(a, 4, 0x240, 18, periph)
/* pa4_tcc0wo1_out */
#define PA4_TCC0WO1_OUT        MCHP_PINMUX(a, 4, 0x23c, 17, periph)
/* pa4_tcc0wo2_out */
#define PA4_TCC0WO2_OUT        MCHP_PINMUX(a, 4, 0x240, 17, periph)
/* pa4_tcc0wo3_out */
#define PA4_TCC0WO3_OUT        MCHP_PINMUX(a, 4, 0x23c, 19, periph)
/* pa4_tcc0wo4_out */
#define PA4_TCC0WO4_OUT        MCHP_PINMUX(a, 4, 0x240, 19, periph)
/* pa4_tcc0wo5_out */
#define PA4_TCC0WO5_OUT        MCHP_PINMUX(a, 4, 0x23c, 18, periph)
/* pa4_tcc1wo0_out */
#define PA4_TCC1WO0_OUT        MCHP_PINMUX(a, 4, 0x240, 21, periph)
/* pa4_tcc1wo1_out */
#define PA4_TCC1WO1_OUT        MCHP_PINMUX(a, 4, 0x23c, 20, periph)
/* pa4_tcc1wo2_out */
#define PA4_TCC1WO2_OUT        MCHP_PINMUX(a, 4, 0x240, 20, periph)
/* pa4_tcc1wo3_out */
#define PA4_TCC1WO3_OUT        MCHP_PINMUX(a, 4, 0x23c, 22, periph)
/* pa4_tcc1wo4_out */
#define PA4_TCC1WO4_OUT        MCHP_PINMUX(a, 4, 0x240, 22, periph)
/* pa4_tcc1wo5_out */
#define PA4_TCC1WO5_OUT        MCHP_PINMUX(a, 4, 0x23c, 21, periph)
/* pa4_tcc2wo0_out */
#define PA4_TCC2WO0_OUT        MCHP_PINMUX(a, 4, 0x240, 23, periph)
/* pa4_tcc2wo1_out */
#define PA4_TCC2WO1_OUT        MCHP_PINMUX(a, 4, 0x23c, 23, periph)
/* pa4_tstbus1_out */
#define PA4_TSTBUS1_OUT        MCHP_PINMUX(a, 4, 0x240, 38, periph)
/* pa4_tstbus3_out */
#define PA4_TSTBUS3_OUT        MCHP_PINMUX(a, 4, 0x244, 15, periph)
/* pa4_tstbus5_out */
#define PA4_TSTBUS5_OUT        MCHP_PINMUX(a, 4, 0x23c, 38, periph)
/* pa4_tstbus7_out */
#define PA4_TSTBUS7_OUT        MCHP_PINMUX(a, 4, 0x244, 16, periph)
/* pa4_tstbus9_out */
#define PA4_TSTBUS9_OUT        MCHP_PINMUX(a, 4, 0x23c, 39, periph)
/* pa4_tstbus10_out */
#define PA4_TSTBUS10_OUT       MCHP_PINMUX(a, 4, 0x240, 39, periph)
/* pa4_tstbus11_out */
#define PA4_TSTBUS11_OUT       MCHP_PINMUX(a, 4, 0x244, 17, periph)
/* pa5_ac_cmp0_out */
#define PA5_AC_CMP0_OUT        MCHP_PINMUX(a, 5, 0x248, 40, periph)
/* pa5_ac_cmp1_out */
#define PA5_AC_CMP1_OUT        MCHP_PINMUX(a, 5, 0x24c, 36, periph)
/* pa5_ac_cmptout_out */
#define PA5_AC_CMPTOUT_OUT     MCHP_PINMUX(a, 5, 0x24c, 37, periph)
/* pa5_ac_cmptrdy_out */
#define PA5_AC_CMPTRDY_OUT     MCHP_PINMUX(a, 5, 0x248, 41, periph)
/* pa5_can1rx_in */
#define PA5_CAN1RX_IN          MCHP_PINMUX(a, 5, 0x190, 15, periph)
/* pa5_can1_tx_out */
#define PA5_CAN1_TX_OUT        MCHP_PINMUX(a, 5, 0x24c, 38, periph)
/* pa5_cclin2_in */
#define PA5_CCLIN2_IN          MCHP_PINMUX(a, 5, 0xbc, 15, periph)
/* pa5_cclin5_in */
#define PA5_CCLIN5_IN          MCHP_PINMUX(a, 5, 0xc8, 15, periph)
/* pa5_cclo0_out */
#define PA5_CCLO0_OUT          MCHP_PINMUX(a, 5, 0x248, 1, periph)
/* pa5_cclo1_out */
#define PA5_CCLO1_OUT          MCHP_PINMUX(a, 5, 0x24c, 1, periph)
/* pa5_coexwlanact_in */
#define PA5_COEXWLANACT_IN     MCHP_PINMUX(a, 5, 0x194, 18, periph)
/* pa5_extint2_in */
#define PA5_EXTINT2_IN         MCHP_PINMUX(a, 5, 0x8, 15, periph)
/* pa5_extint3_in */
#define PA5_EXTINT3_IN         MCHP_PINMUX(a, 5, 0xc, 18, periph)
/* pa5_fectrl3_out */
#define PA5_FECTRL3_OUT        MCHP_PINMUX(a, 5, 0x24c, 39, periph)
/* pa5_fectrl4_out */
#define PA5_FECTRL4_OUT        MCHP_PINMUX(a, 5, 0x248, 42, periph)
/* pa5_fectrl5_out */
#define PA5_FECTRL5_OUT        MCHP_PINMUX(a, 5, 0x24c, 40, periph)
/* pa5_nmi_in */
#define PA5_NMI_IN             MCHP_PINMUX(a, 5, 0x3c, 18, periph)
/* pa5_qd0_in */
#define PA5_QD0_IN             MCHP_PINMUX(a, 5, 0xa0, 18, periph)
/* pa5_qd0_out */
#define PA5_QD0_OUT            MCHP_PINMUX(a, 5, 0x248, 36, periph)
/* pa5_qd1_out */
#define PA5_QD1_OUT            MCHP_PINMUX(a, 5, 0x248, 35, periph)
/* pa5_qd2_out */
#define PA5_QD2_OUT            MCHP_PINMUX(a, 5, 0x24c, 31, periph)
/* pa5_qd3_in */
#define PA5_QD3_IN             MCHP_PINMUX(a, 5, 0xac, 15, periph)
/* pa5_qd3_out */
#define PA5_QD3_OUT            MCHP_PINMUX(a, 5, 0x248, 37, periph)
/* pa5_qeiindx0g3_in */
#define PA5_QEIINDX0G3_IN      MCHP_PINMUX(a, 5, 0x178, 15, periph)
/* pa5_qeiqea0g3_in */
#define PA5_QEIQEA0G3_IN       MCHP_PINMUX(a, 5, 0x17c, 15, periph)
/* pa5_qeiqea0g4_in */
#define PA5_QEIQEA0G4_IN       MCHP_PINMUX(a, 5, 0x180, 18, periph)
/* pa5_qeiqeb0g4_in */
#define PA5_QEIQEB0G4_IN       MCHP_PINMUX(a, 5, 0x184, 18, periph)
/* pa5_qspics_out */
#define PA5_QSPICS_OUT         MCHP_PINMUX(a, 5, 0x248, 34, periph)
/* pa5_qspi_sck_out */
#define PA5_QSPI_SCK_OUT       MCHP_PINMUX(a, 5, 0x250, 7, periph)
/* pa5_refi_in */
#define PA5_REFI_IN            MCHP_PINMUX(a, 5, 0xb0, 1, periph)
/* pa5_refo1_out */
#define PA5_REFO1_OUT          MCHP_PINMUX(a, 5, 0x250, 8, periph)
/* pa5_refo2_out */
#define PA5_REFO2_OUT          MCHP_PINMUX(a, 5, 0x250, 9, periph)
/* pa5_refo3_out */
#define PA5_REFO3_OUT          MCHP_PINMUX(a, 5, 0x250, 10, periph)
/* pa5_refo4_out */
#define PA5_REFO4_OUT          MCHP_PINMUX(a, 5, 0x250, 11, periph)
/* pa5_scom0p0_out */
#define PA5_SCOM0P0_OUT        MCHP_PINMUX(a, 5, 0x248, 2, periph)
/* pa5_scom0p1_in */
#define PA5_SCOM0P1_IN         MCHP_PINMUX(a, 5, 0x44, 1, periph)
/* pa5_scom0p1_out */
#define PA5_SCOM0P1_OUT        MCHP_PINMUX(a, 5, 0x250, 1, periph)
/* pa5_scom0p2_in */
#define PA5_SCOM0P2_IN         MCHP_PINMUX(a, 5, 0x48, 18, periph)
/* pa5_scom0p2_out */
#define PA5_SCOM0P2_OUT        MCHP_PINMUX(a, 5, 0x24c, 2, periph)
/* pa5_scom0p3_out */
#define PA5_SCOM0P3_OUT        MCHP_PINMUX(a, 5, 0x248, 3, periph)
/* pa5_scom1p0_in */
#define PA5_SCOM1P0_IN         MCHP_PINMUX(a, 5, 0x50, 15, periph)
/* pa5_scom1p0_out */
#define PA5_SCOM1P0_OUT        MCHP_PINMUX(a, 5, 0x248, 5, periph)
/* pa5_scom1p1_in */
#define PA5_SCOM1P1_IN         MCHP_PINMUX(a, 5, 0x54, 1, periph)
/* pa5_scom1p1_out */
#define PA5_SCOM1P1_OUT        MCHP_PINMUX(a, 5, 0x250, 2, periph)
/* pa5_scom1p2_out */
#define PA5_SCOM1P2_OUT        MCHP_PINMUX(a, 5, 0x248, 4, periph)
/* pa5_scom1p3_out */
#define PA5_SCOM1P3_OUT        MCHP_PINMUX(a, 5, 0x248, 6, periph)
/* pa5_scom2p0_out */
#define PA5_SCOM2P0_OUT        MCHP_PINMUX(a, 5, 0x248, 7, periph)
/* pa5_scom2p1_in */
#define PA5_SCOM2P1_IN         MCHP_PINMUX(a, 5, 0x64, 1, periph)
/* pa5_scom2p1_out */
#define PA5_SCOM2P1_OUT        MCHP_PINMUX(a, 5, 0x250, 3, periph)
/* pa5_scom2p2_in */
#define PA5_SCOM2P2_IN         MCHP_PINMUX(a, 5, 0x68, 18, periph)
/* pa5_scom2p2_out */
#define PA5_SCOM2P2_OUT        MCHP_PINMUX(a, 5, 0x24c, 6, periph)
/* pa5_scom2p3_out */
#define PA5_SCOM2P3_OUT        MCHP_PINMUX(a, 5, 0x248, 8, periph)
/* pa5_scom3p0_in */
#define PA5_SCOM3P0_IN         MCHP_PINMUX(a, 5, 0x70, 15, periph)
/* pa5_scom3p0_out */
#define PA5_SCOM3P0_OUT        MCHP_PINMUX(a, 5, 0x248, 10, periph)
/* pa5_scom3p1_in */
#define PA5_SCOM3P1_IN         MCHP_PINMUX(a, 5, 0x74, 1, periph)
/* pa5_scom3p1_out */
#define PA5_SCOM3P1_OUT        MCHP_PINMUX(a, 5, 0x250, 4, periph)
/* pa5_scom3p2_out */
#define PA5_SCOM3P2_OUT        MCHP_PINMUX(a, 5, 0x248, 9, periph)
/* pa5_scom3p3_out */
#define PA5_SCOM3P3_OUT        MCHP_PINMUX(a, 5, 0x248, 11, periph)
/* pa5_tc0wo0_out */
#define PA5_TC0WO0_OUT         MCHP_PINMUX(a, 5, 0x248, 24, periph)
/* pa5_tc0wo1g3_in */
#define PA5_TC0WO1G3_IN        MCHP_PINMUX(a, 5, 0xd4, 15, periph)
/* pa5_tc0wo1g4_in */
#define PA5_TC0WO1G4_IN        MCHP_PINMUX(a, 5, 0xd8, 18, periph)
/* pa5_tc1wo0_out */
#define PA5_TC1WO0_OUT         MCHP_PINMUX(a, 5, 0x248, 25, periph)
/* pa5_tc1wo1_out */
#define PA5_TC1WO1_OUT         MCHP_PINMUX(a, 5, 0x24c, 22, periph)
/* pa5_tc2wo0g3_in */
#define PA5_TC2WO0G3_IN        MCHP_PINMUX(a, 5, 0xf0, 15, periph)
/* pa5_tc2wo0_out */
#define PA5_TC2WO0_OUT         MCHP_PINMUX(a, 5, 0x248, 26, periph)
/* pa5_tc2wo1g4_in */
#define PA5_TC2WO1G4_IN        MCHP_PINMUX(a, 5, 0xf8, 18, periph)
/* pa5_tc2wo1_out */
#define PA5_TC2WO1_OUT         MCHP_PINMUX(a, 5, 0x24c, 23, periph)
/* pa5_tc3wo0g3_in */
#define PA5_TC3WO0G3_IN        MCHP_PINMUX(a, 5, 0x100, 15, periph)
/* pa5_tc3wo0_out */
#define PA5_TC3WO0_OUT         MCHP_PINMUX(a, 5, 0x248, 27, periph)
/* pa5_tc3wo1g4_in */
#define PA5_TC3WO1G4_IN        MCHP_PINMUX(a, 5, 0x108, 18, periph)
/* pa5_tc3wo1_out */
#define PA5_TC3WO1_OUT         MCHP_PINMUX(a, 5, 0x24c, 24, periph)
/* pa5_tc4wo0g3_in */
#define PA5_TC4WO0G3_IN        MCHP_PINMUX(a, 5, 0x110, 15, periph)
/* pa5_tc4wo0_out */
#define PA5_TC4WO0_OUT         MCHP_PINMUX(a, 5, 0x248, 28, periph)
/* pa5_tc4wo1g4_in */
#define PA5_TC4WO1G4_IN        MCHP_PINMUX(a, 5, 0x118, 18, periph)
/* pa5_tc4wo1_out */
#define PA5_TC4WO1_OUT         MCHP_PINMUX(a, 5, 0x24c, 25, periph)
/* pa5_tc5wo0g3_in */
#define PA5_TC5WO0G3_IN        MCHP_PINMUX(a, 5, 0x120, 15, periph)
/* pa5_tc5wo0_out */
#define PA5_TC5WO0_OUT         MCHP_PINMUX(a, 5, 0x248, 29, periph)
/* pa5_tc5wo1g4_in */
#define PA5_TC5WO1G4_IN        MCHP_PINMUX(a, 5, 0x128, 18, periph)
/* pa5_tc5wo1_out */
#define PA5_TC5WO1_OUT         MCHP_PINMUX(a, 5, 0x24c, 26, periph)
/* pa5_tc6wo0g3_in */
#define PA5_TC6WO0G3_IN        MCHP_PINMUX(a, 5, 0x130, 15, periph)
/* pa5_tc6wo0_out */
#define PA5_TC6WO0_OUT         MCHP_PINMUX(a, 5, 0x248, 30, periph)
/* pa5_tc6wo1g4_in */
#define PA5_TC6WO1G4_IN        MCHP_PINMUX(a, 5, 0x138, 18, periph)
/* pa5_tc6wo1_out */
#define PA5_TC6WO1_OUT         MCHP_PINMUX(a, 5, 0x24c, 27, periph)
/* pa5_tc7wo0g3_in */
#define PA5_TC7WO0G3_IN        MCHP_PINMUX(a, 5, 0x140, 15, periph)
/* pa5_tc7wo0_out */
#define PA5_TC7WO0_OUT         MCHP_PINMUX(a, 5, 0x248, 31, periph)
/* pa5_tc7wo1g4_in */
#define PA5_TC7WO1G4_IN        MCHP_PINMUX(a, 5, 0x148, 18, periph)
/* pa5_tc7wo1_out */
#define PA5_TC7WO1_OUT         MCHP_PINMUX(a, 5, 0x24c, 28, periph)
/* pa5_tc8wo0g3_in */
#define PA5_TC8WO0G3_IN        MCHP_PINMUX(a, 5, 0x150, 15, periph)
/* pa5_tc8wo0_out */
#define PA5_TC8WO0_OUT         MCHP_PINMUX(a, 5, 0x248, 32, periph)
/* pa5_tc9wo0g4_in */
#define PA5_TC9WO0G4_IN        MCHP_PINMUX(a, 5, 0x160, 18, periph)
/* pa5_tc9wo0_out */
#define PA5_TC9WO0_OUT         MCHP_PINMUX(a, 5, 0x24c, 29, periph)
/* pa5_tc9wo1g3_in */
#define PA5_TC9WO1G3_IN        MCHP_PINMUX(a, 5, 0x164, 15, periph)
/* pa5_tc9wo1_out */
#define PA5_TC9WO1_OUT         MCHP_PINMUX(a, 5, 0x248, 33, periph)
/* pa5_tcc0wo0_out */
#define PA5_TCC0WO0_OUT        MCHP_PINMUX(a, 5, 0x248, 18, periph)
/* pa5_tcc0wo1_out */
#define PA5_TCC0WO1_OUT        MCHP_PINMUX(a, 5, 0x24c, 15, periph)
/* pa5_tcc0wo2_out */
#define PA5_TCC0WO2_OUT        MCHP_PINMUX(a, 5, 0x248, 17, periph)
/* pa5_tcc0wo3_out */
#define PA5_TCC0WO3_OUT        MCHP_PINMUX(a, 5, 0x24c, 14, periph)
/* pa5_tcc0wo4_out */
#define PA5_TCC0WO4_OUT        MCHP_PINMUX(a, 5, 0x248, 19, periph)
/* pa5_tcc0wo5_out */
#define PA5_TCC0WO5_OUT        MCHP_PINMUX(a, 5, 0x24c, 16, periph)
/* pa5_tcc1wo0_out */
#define PA5_TCC1WO0_OUT        MCHP_PINMUX(a, 5, 0x248, 21, periph)
/* pa5_tcc1wo1_out */
#define PA5_TCC1WO1_OUT        MCHP_PINMUX(a, 5, 0x24c, 18, periph)
/* pa5_tcc1wo2_out */
#define PA5_TCC1WO2_OUT        MCHP_PINMUX(a, 5, 0x248, 20, periph)
/* pa5_tcc1wo3_out */
#define PA5_TCC1WO3_OUT        MCHP_PINMUX(a, 5, 0x24c, 17, periph)
/* pa5_tcc1wo4_out */
#define PA5_TCC1WO4_OUT        MCHP_PINMUX(a, 5, 0x248, 22, periph)
/* pa5_tcc1wo5_out */
#define PA5_TCC1WO5_OUT        MCHP_PINMUX(a, 5, 0x24c, 19, periph)
/* pa5_tcc2wo0_out */
#define PA5_TCC2WO0_OUT        MCHP_PINMUX(a, 5, 0x248, 23, periph)
/* pa5_tcc2wo1_out */
#define PA5_TCC2WO1_OUT        MCHP_PINMUX(a, 5, 0x24c, 20, periph)
/* pa5_tstbus1_out */
#define PA5_TSTBUS1_OUT        MCHP_PINMUX(a, 5, 0x248, 38, periph)
/* pa5_tstbus2_out */
#define PA5_TSTBUS2_OUT        MCHP_PINMUX(a, 5, 0x24c, 34, periph)
/* pa5_tstbus6_out */
#define PA5_TSTBUS6_OUT        MCHP_PINMUX(a, 5, 0x24c, 35, periph)
/* pa5_tstbus10_out */
#define PA5_TSTBUS10_OUT       MCHP_PINMUX(a, 5, 0x248, 39, periph)
/* pa6_accmpten_in */
#define PA6_ACCMPTEN_IN        MCHP_PINMUX(a, 6, 0x18c, 2, periph)
/* pa6_ac_cmp1_out */
#define PA6_AC_CMP1_OUT        MCHP_PINMUX(a, 6, 0x258, 36, periph)
/* pa6_ac_cmptout_out */
#define PA6_AC_CMPTOUT_OUT     MCHP_PINMUX(a, 6, 0x258, 37, periph)
/* pa6_can1_tx_out */
#define PA6_CAN1_TX_OUT        MCHP_PINMUX(a, 6, 0x258, 38, periph)
/* pa6_cclin0_in */
#define PA6_CCLIN0_IN          MCHP_PINMUX(a, 6, 0xb4, 2, periph)
/* pa6_cclin3_in */
#define PA6_CCLIN3_IN          MCHP_PINMUX(a, 6, 0xc0, 2, periph)
/* pa6_cclo1_out */
#define PA6_CCLO1_OUT          MCHP_PINMUX(a, 6, 0x258, 1, periph)
/* pa6_coexwlanact_in */
#define PA6_COEXWLANACT_IN     MCHP_PINMUX(a, 6, 0x194, 13, periph)
/* pa6_coex_bt_state_out */
#define PA6_COEX_BT_STATE_OUT  MCHP_PINMUX(a, 6, 0x254, 37, periph)
/* pa6_extint0_in */
#define PA6_EXTINT0_IN         MCHP_PINMUX(a, 6, 0x0, 2, periph)
/* pa6_extint3_in */
#define PA6_EXTINT3_IN         MCHP_PINMUX(a, 6, 0xc, 13, periph)
/* pa6_fectrl1_out */
#define PA6_FECTRL1_OUT        MCHP_PINMUX(a, 6, 0x254, 35, periph)
/* pa6_fectrl2_out */
#define PA6_FECTRL2_OUT        MCHP_PINMUX(a, 6, 0x254, 36, periph)
/* pa6_fectrl3_out */
#define PA6_FECTRL3_OUT        MCHP_PINMUX(a, 6, 0x258, 39, periph)
/* pa6_fectrl5_out */
#define PA6_FECTRL5_OUT        MCHP_PINMUX(a, 6, 0x258, 40, periph)
/* pa6_nmi_in */
#define PA6_NMI_IN             MCHP_PINMUX(a, 6, 0x3c, 13, periph)
/* pa6_qd0_in */
#define PA6_QD0_IN             MCHP_PINMUX(a, 6, 0xa0, 13, periph)
/* pa6_qd0_out */
#define PA6_QD0_OUT            MCHP_PINMUX(a, 6, 0x258, 33, periph)
/* pa6_qd1_in */
#define PA6_QD1_IN             MCHP_PINMUX(a, 6, 0xa4, 2, periph)
/* pa6_qd1_out */
#define PA6_QD1_OUT            MCHP_PINMUX(a, 6, 0x254, 30, periph)
/* pa6_qd2_out */
#define PA6_QD2_OUT            MCHP_PINMUX(a, 6, 0x254, 29, periph)
/* pa6_qd3_out */
#define PA6_QD3_OUT            MCHP_PINMUX(a, 6, 0x254, 28, periph)
/* pa6_qeiccmp0_out */
#define PA6_QEICCMP0_OUT       MCHP_PINMUX(a, 6, 0x254, 31, periph)
/* pa6_qeihome0g1_in */
#define PA6_QEIHOME0G1_IN      MCHP_PINMUX(a, 6, 0x16c, 2, periph)
/* pa6_qeiqea0g4_in */
#define PA6_QEIQEA0G4_IN       MCHP_PINMUX(a, 6, 0x180, 13, periph)
/* pa6_qeiqeb0g4_in */
#define PA6_QEIQEB0G4_IN       MCHP_PINMUX(a, 6, 0x184, 13, periph)
/* pa6_qspics_out */
#define PA6_QSPICS_OUT         MCHP_PINMUX(a, 6, 0x254, 27, periph)
/* pa6_qspi_sck_out */
#define PA6_QSPI_SCK_OUT       MCHP_PINMUX(a, 6, 0x25c, 7, periph)
/* pa6_refi_in */
#define PA6_REFI_IN            MCHP_PINMUX(a, 6, 0xb0, 7, periph)
/* pa6_refo1_out */
#define PA6_REFO1_OUT          MCHP_PINMUX(a, 6, 0x25c, 8, periph)
/* pa6_refo2_out */
#define PA6_REFO2_OUT          MCHP_PINMUX(a, 6, 0x25c, 9, periph)
/* pa6_refo3_out */
#define PA6_REFO3_OUT          MCHP_PINMUX(a, 6, 0x25c, 10, periph)
/* pa6_refo4_out */
#define PA6_REFO4_OUT          MCHP_PINMUX(a, 6, 0x25c, 11, periph)
/* pa6_scom0p0_out */
#define PA6_SCOM0P0_OUT        MCHP_PINMUX(a, 6, 0x258, 3, periph)
/* pa6_scom0p1_in */
#define PA6_SCOM0P1_IN         MCHP_PINMUX(a, 6, 0x44, 7, periph)
/* pa6_scom0p1_out */
#define PA6_SCOM0P1_OUT        MCHP_PINMUX(a, 6, 0x25c, 1, periph)
/* pa6_scom0p2_in */
#define PA6_SCOM0P2_IN         MCHP_PINMUX(a, 6, 0x48, 13, periph)
/* pa6_scom0p2_out */
#define PA6_SCOM0P2_OUT        MCHP_PINMUX(a, 6, 0x254, 2, periph)
/* pa6_scom0p3_in */
#define PA6_SCOM0P3_IN         MCHP_PINMUX(a, 6, 0x4c, 2, periph)
/* pa6_scom0p3_out */
#define PA6_SCOM0P3_OUT        MCHP_PINMUX(a, 6, 0x254, 1, periph)
/* pa6_scom1p0_out */
#define PA6_SCOM1P0_OUT        MCHP_PINMUX(a, 6, 0x254, 3, periph)
/* pa6_scom1p1_in */
#define PA6_SCOM1P1_IN         MCHP_PINMUX(a, 6, 0x54, 7, periph)
/* pa6_scom1p1_out */
#define PA6_SCOM1P1_OUT        MCHP_PINMUX(a, 6, 0x25c, 2, periph)
/* pa6_scom1p2_in */
#define PA6_SCOM1P2_IN         MCHP_PINMUX(a, 6, 0x58, 2, periph)
/* pa6_scom1p2_out */
#define PA6_SCOM1P2_OUT        MCHP_PINMUX(a, 6, 0x254, 4, periph)
/* pa6_scom1p3_out */
