zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz66/pic32cx2051bz66048-pinctrl.h
#define PA8_TC7WO1G2_IN        MCHP_PINMUX(a, 8, 0x144, 16, periph)
/* pa8_tc7wo1g4_in */
#define PA8_TC7WO1G4_IN        MCHP_PINMUX(a, 8, 0x148, 23, periph)
/* pa8_tc7wo1_out */
#define PA8_TC7WO1_OUT         MCHP_PINMUX(a, 8, 0x26c, 31, periph)
/* pa8_tc8wo0g3_in */
#define PA8_TC8WO0G3_IN        MCHP_PINMUX(a, 8, 0x150, 2, periph)
/* pa8_tc8wo0_out */
#define PA8_TC8WO0_OUT         MCHP_PINMUX(a, 8, 0x270, 32, periph)
/* pa8_tc8wo1g2_in */
#define PA8_TC8WO1G2_IN        MCHP_PINMUX(a, 8, 0x154, 16, periph)
/* pa8_tc8wo1_out */
#define PA8_TC8WO1_OUT         MCHP_PINMUX(a, 8, 0x26c, 32, periph)
/* pa8_tc9wo0g2_in */
#define PA8_TC9WO0G2_IN        MCHP_PINMUX(a, 8, 0x15c, 16, periph)
/* pa8_tc9wo0g4_in */
#define PA8_TC9WO0G4_IN        MCHP_PINMUX(a, 8, 0x160, 23, periph)
/* pa8_tc9wo0_out */
#define PA8_TC9WO0_OUT         MCHP_PINMUX(a, 8, 0x26c, 33, periph)
/* pa8_tc9wo1g3_in */
#define PA8_TC9WO1G3_IN        MCHP_PINMUX(a, 8, 0x164, 2, periph)
/* pa8_tc9wo1_out */
#define PA8_TC9WO1_OUT         MCHP_PINMUX(a, 8, 0x270, 33, periph)
/* pa8_tcc0wo0_out */
#define PA8_TCC0WO0_OUT        MCHP_PINMUX(a, 8, 0x270, 18, periph)
/* pa8_tcc0wo1_out */
#define PA8_TCC0WO1_OUT        MCHP_PINMUX(a, 8, 0x26c, 17, periph)
/* pa8_tcc0wo2_out */
#define PA8_TCC0WO2_OUT        MCHP_PINMUX(a, 8, 0x270, 17, periph)
/* pa8_tcc0wo3_out */
#define PA8_TCC0WO3_OUT        MCHP_PINMUX(a, 8, 0x26c, 19, periph)
/* pa8_tcc0wo4_out */
#define PA8_TCC0WO4_OUT        MCHP_PINMUX(a, 8, 0x270, 19, periph)
/* pa8_tcc0wo5_out */
#define PA8_TCC0WO5_OUT        MCHP_PINMUX(a, 8, 0x26c, 18, periph)
/* pa8_tcc1wo0_out */
#define PA8_TCC1WO0_OUT        MCHP_PINMUX(a, 8, 0x270, 21, periph)
/* pa8_tcc1wo1_out */
#define PA8_TCC1WO1_OUT        MCHP_PINMUX(a, 8, 0x26c, 20, periph)
/* pa8_tcc1wo2_out */
#define PA8_TCC1WO2_OUT        MCHP_PINMUX(a, 8, 0x270, 20, periph)
/* pa8_tcc1wo3_out */
#define PA8_TCC1WO3_OUT        MCHP_PINMUX(a, 8, 0x26c, 22, periph)
/* pa8_tcc1wo4_out */
#define PA8_TCC1WO4_OUT        MCHP_PINMUX(a, 8, 0x270, 22, periph)
/* pa8_tcc1wo5_out */
#define PA8_TCC1WO5_OUT        MCHP_PINMUX(a, 8, 0x26c, 21, periph)
/* pa8_tcc2wo0_out */
#define PA8_TCC2WO0_OUT        MCHP_PINMUX(a, 8, 0x270, 23, periph)
/* pa8_tcc2wo1_out */
#define PA8_TCC2WO1_OUT        MCHP_PINMUX(a, 8, 0x26c, 23, periph)
/* pa8_tstbus1_out */
#define PA8_TSTBUS1_OUT        MCHP_PINMUX(a, 8, 0x270, 38, periph)
/* pa8_tstbus2_out */
#define PA8_TSTBUS2_OUT        MCHP_PINMUX(a, 8, 0x274, 34, periph)
/* pa8_tstbus5_out */
#define PA8_TSTBUS5_OUT        MCHP_PINMUX(a, 8, 0x26c, 38, periph)
/* pa8_tstbus6_out */
#define PA8_TSTBUS6_OUT        MCHP_PINMUX(a, 8, 0x274, 35, periph)
/* pa8_tstbus9_out */
#define PA8_TSTBUS9_OUT        MCHP_PINMUX(a, 8, 0x26c, 39, periph)
/* pa8_tstbus10_out */
#define PA8_TSTBUS10_OUT       MCHP_PINMUX(a, 8, 0x270, 39, periph)
/* pa9_accmpten_in */
#define PA9_ACCMPTEN_IN        MCHP_PINMUX(a, 9, 0x18c, 25, periph)
/* pa9_ac_cmp0_out */
#define PA9_AC_CMP0_OUT        MCHP_PINMUX(a, 9, 0x27c, 40, periph)
/* pa9_ac_cmp1_out */
#define PA9_AC_CMP1_OUT        MCHP_PINMUX(a, 9, 0x280, 36, periph)
/* pa9_ac_cmptout_out */
#define PA9_AC_CMPTOUT_OUT     MCHP_PINMUX(a, 9, 0x280, 37, periph)
/* pa9_ac_cmptrdy_out */
#define PA9_AC_CMPTRDY_OUT     MCHP_PINMUX(a, 9, 0x27c, 41, periph)
/* pa9_can0rx_in */
#define PA9_CAN0RX_IN          MCHP_PINMUX(a, 9, NA, NA, gpio)
/* pa9_can1rx_in */
#define PA9_CAN1RX_IN          MCHP_PINMUX(a, 9, 0x190, 16, periph)
/* pa9_can1_tx_out */
#define PA9_CAN1_TX_OUT        MCHP_PINMUX(a, 9, 0x280, 38, periph)
/* pa9_cclin0_in */
#define PA9_CCLIN0_IN          MCHP_PINMUX(a, 9, 0xb4, 25, periph)
/* pa9_cclin2_in */
#define PA9_CCLIN2_IN          MCHP_PINMUX(a, 9, 0xbc, 16, periph)
/* pa9_cclin3_in */
#define PA9_CCLIN3_IN          MCHP_PINMUX(a, 9, 0xc0, 25, periph)
/* pa9_cclin5_in */
#define PA9_CCLIN5_IN          MCHP_PINMUX(a, 9, 0xc8, 16, periph)
/* pa9_cclo0_out */
#define PA9_CCLO0_OUT          MCHP_PINMUX(a, 9, 0x27c, 1, periph)
/* pa9_cclo1_out */
#define PA9_CCLO1_OUT          MCHP_PINMUX(a, 9, 0x280, 1, periph)
/* pa9_coexwlanact_in */
#define PA9_COEXWLANACT_IN     MCHP_PINMUX(a, 9, 0x194, 2, periph)
/* pa9_coex_bt_state_out */
#define PA9_COEX_BT_STATE_OUT  MCHP_PINMUX(a, 9, 0x278, 37, periph)
/* pa9_extint0_in */
#define PA9_EXTINT0_IN         MCHP_PINMUX(a, 9, 0x0, 25, periph)
/* pa9_extint2_in */
#define PA9_EXTINT2_IN         MCHP_PINMUX(a, 9, 0x8, 16, periph)
/* pa9_extint3_in */
#define PA9_EXTINT3_IN         MCHP_PINMUX(a, 9, 0xc, 2, periph)
/* pa9_fectrl1_out */
#define PA9_FECTRL1_OUT        MCHP_PINMUX(a, 9, 0x278, 35, periph)
/* pa9_fectrl2_out */
#define PA9_FECTRL2_OUT        MCHP_PINMUX(a, 9, 0x278, 36, periph)
/* pa9_fectrl3_out */
#define PA9_FECTRL3_OUT        MCHP_PINMUX(a, 9, 0x280, 39, periph)
/* pa9_fectrl4_out */
#define PA9_FECTRL4_OUT        MCHP_PINMUX(a, 9, 0x27c, 42, periph)
/* pa9_fectrl5_out */
#define PA9_FECTRL5_OUT        MCHP_PINMUX(a, 9, 0x280, 40, periph)
/* pa9_nmi_in */
#define PA9_NMI_IN             MCHP_PINMUX(a, 9, 0x3c, 2, periph)
/* pa9_qd0_in */
#define PA9_QD0_IN             MCHP_PINMUX(a, 9, 0xa0, 2, periph)
/* pa9_qd0_out */
#define PA9_QD0_OUT            MCHP_PINMUX(a, 9, 0x27c, 36, periph)
/* pa9_qd1_in */
#define PA9_QD1_IN             MCHP_PINMUX(a, 9, 0xa4, 25, periph)
/* pa9_qd1_out */
#define PA9_QD1_OUT            MCHP_PINMUX(a, 9, 0x278, 30, periph)
/* pa9_qd2_out */
#define PA9_QD2_OUT            MCHP_PINMUX(a, 9, 0x278, 29, periph)
/* pa9_qd3_in */
#define PA9_QD3_IN             MCHP_PINMUX(a, 9, 0xac, 16, periph)
/* pa9_qd3_out */
#define PA9_QD3_OUT            MCHP_PINMUX(a, 9, 0x278, 28, periph)
/* pa9_qeiccmp0_out */
#define PA9_QEICCMP0_OUT       MCHP_PINMUX(a, 9, 0x278, 31, periph)
/* pa9_qeihome0g1_in */
#define PA9_QEIHOME0G1_IN      MCHP_PINMUX(a, 9, 0x16c, 25, periph)
/* pa9_qeiindx0g3_in */
#define PA9_QEIINDX0G3_IN      MCHP_PINMUX(a, 9, 0x178, 16, periph)
/* pa9_qeiqea0g3_in */
#define PA9_QEIQEA0G3_IN       MCHP_PINMUX(a, 9, 0x17c, 16, periph)
/* pa9_qeiqea0g4_in */
#define PA9_QEIQEA0G4_IN       MCHP_PINMUX(a, 9, 0x180, 2, periph)
/* pa9_qeiqeb0g4_in */
#define PA9_QEIQEB0G4_IN       MCHP_PINMUX(a, 9, 0x184, 2, periph)
/* pa9_qspics_out */
#define PA9_QSPICS_OUT         MCHP_PINMUX(a, 9, 0x278, 27, periph)
/* pa9_scom0p0_out */
#define PA9_SCOM0P0_OUT        MCHP_PINMUX(a, 9, 0x27c, 2, periph)
/* pa9_scom0p2_in */
#define PA9_SCOM0P2_IN         MCHP_PINMUX(a, 9, 0x48, 2, periph)
/* pa9_scom0p2_out */
#define PA9_SCOM0P2_OUT        MCHP_PINMUX(a, 9, 0x278, 2, periph)
/* pa9_scom0p3_in */
#define PA9_SCOM0P3_IN         MCHP_PINMUX(a, 9, 0x4c, 25, periph)
/* pa9_scom0p3_out */
#define PA9_SCOM0P3_OUT        MCHP_PINMUX(a, 9, 0x278, 1, periph)
/* pa9_scom1p0_in */
#define PA9_SCOM1P0_IN         MCHP_PINMUX(a, 9, 0x50, 16, periph)
/* pa9_scom1p0_out */
#define PA9_SCOM1P0_OUT        MCHP_PINMUX(a, 9, 0x278, 3, periph)
/* pa9_scom1p2_in */
#define PA9_SCOM1P2_IN         MCHP_PINMUX(a, 9, 0x58, 25, periph)
/* pa9_scom1p2_out */
#define PA9_SCOM1P2_OUT        MCHP_PINMUX(a, 9, 0x278, 4, periph)
/* pa9_scom1p3_out */
#define PA9_SCOM1P3_OUT        MCHP_PINMUX(a, 9, 0x27c, 6, periph)
/* pa9_scom2p0_out */
#define PA9_SCOM2P0_OUT        MCHP_PINMUX(a, 9, 0x27c, 7, periph)
/* pa9_scom2p2_in */
#define PA9_SCOM2P2_IN         MCHP_PINMUX(a, 9, 0x68, 2, periph)
/* pa9_scom2p2_out */
#define PA9_SCOM2P2_OUT        MCHP_PINMUX(a, 9, 0x278, 6, periph)
/* pa9_scom2p3_in */
#define PA9_SCOM2P3_IN         MCHP_PINMUX(a, 9, 0x6c, 25, periph)
/* pa9_scom2p3_out */
#define PA9_SCOM2P3_OUT        MCHP_PINMUX(a, 9, 0x278, 5, periph)
/* pa9_scom3p0_in */
#define PA9_SCOM3P0_IN         MCHP_PINMUX(a, 9, 0x70, 16, periph)
/* pa9_scom3p0_out */
#define PA9_SCOM3P0_OUT        MCHP_PINMUX(a, 9, 0x278, 7, periph)
/* pa9_scom3p2_in */
#define PA9_SCOM3P2_IN         MCHP_PINMUX(a, 9, 0x78, 25, periph)
/* pa9_scom3p2_out */
#define PA9_SCOM3P2_OUT        MCHP_PINMUX(a, 9, 0x278, 8, periph)
/* pa9_scom3p3_out */
#define PA9_SCOM3P3_OUT        MCHP_PINMUX(a, 9, 0x27c, 11, periph)
/* pa9_tc0wo0g1_in */
#define PA9_TC0WO0G1_IN        MCHP_PINMUX(a, 9, 0xcc, 25, periph)
/* pa9_tc0wo0_out */
#define PA9_TC0WO0_OUT         MCHP_PINMUX(a, 9, 0x27c, 24, periph)
/* pa9_tc0wo1g3_in */
#define PA9_TC0WO1G3_IN        MCHP_PINMUX(a, 9, 0xd4, 16, periph)
/* pa9_tc0wo1g4_in */
#define PA9_TC0WO1G4_IN        MCHP_PINMUX(a, 9, 0xd8, 2, periph)
/* pa9_tc0wo1_out */
#define PA9_TC0WO1_OUT         MCHP_PINMUX(a, 9, 0x278, 18, periph)
/* pa9_tc1wo0g1_in */
#define PA9_TC1WO0G1_IN        MCHP_PINMUX(a, 9, 0xdc, 25, periph)
/* pa9_tc1wo0_out */
#define PA9_TC1WO0_OUT         MCHP_PINMUX(a, 9, 0x278, 19, periph)
/* pa9_tc1wo1_out */
#define PA9_TC1WO1_OUT         MCHP_PINMUX(a, 9, 0x280, 22, periph)
/* pa9_tc2wo0g1_in */
#define PA9_TC2WO0G1_IN        MCHP_PINMUX(a, 9, 0xec, 25, periph)
/* pa9_tc2wo0g3_in */
#define PA9_TC2WO0G3_IN        MCHP_PINMUX(a, 9, 0xf0, 16, periph)
/* pa9_tc2wo0_out */
#define PA9_TC2WO0_OUT         MCHP_PINMUX(a, 9, 0x278, 20, periph)
/* pa9_tc2wo1g4_in */
#define PA9_TC2WO1G4_IN        MCHP_PINMUX(a, 9, 0xf8, 2, periph)
/* pa9_tc2wo1_out */
#define PA9_TC2WO1_OUT         MCHP_PINMUX(a, 9, 0x280, 23, periph)
/* pa9_tc3wo0g1_in */
#define PA9_TC3WO0G1_IN        MCHP_PINMUX(a, 9, 0xfc, 25, periph)
/* pa9_tc3wo0g3_in */
#define PA9_TC3WO0G3_IN        MCHP_PINMUX(a, 9, 0x100, 16, periph)
/* pa9_tc3wo0_out */
#define PA9_TC3WO0_OUT         MCHP_PINMUX(a, 9, 0x278, 21, periph)
/* pa9_tc3wo1g4_in */
#define PA9_TC3WO1G4_IN        MCHP_PINMUX(a, 9, 0x108, 2, periph)
/* pa9_tc3wo1_out */
#define PA9_TC3WO1_OUT         MCHP_PINMUX(a, 9, 0x280, 24, periph)
/* pa9_tc4wo0g1_in */
#define PA9_TC4WO0G1_IN        MCHP_PINMUX(a, 9, 0x10c, 25, periph)
/* pa9_tc4wo0g3_in */
#define PA9_TC4WO0G3_IN        MCHP_PINMUX(a, 9, 0x110, 16, periph)
/* pa9_tc4wo0_out */
#define PA9_TC4WO0_OUT         MCHP_PINMUX(a, 9, 0x278, 22, periph)
/* pa9_tc4wo1g4_in */
#define PA9_TC4WO1G4_IN        MCHP_PINMUX(a, 9, 0x118, 2, periph)
/* pa9_tc4wo1_out */
#define PA9_TC4WO1_OUT         MCHP_PINMUX(a, 9, 0x280, 25, periph)
/* pa9_tc5wo0g1_in */
#define PA9_TC5WO0G1_IN        MCHP_PINMUX(a, 9, 0x11c, 25, periph)
/* pa9_tc5wo0g3_in */
#define PA9_TC5WO0G3_IN        MCHP_PINMUX(a, 9, 0x120, 16, periph)
/* pa9_tc5wo0_out */
#define PA9_TC5WO0_OUT         MCHP_PINMUX(a, 9, 0x278, 23, periph)
/* pa9_tc5wo1g4_in */
#define PA9_TC5WO1G4_IN        MCHP_PINMUX(a, 9, 0x128, 2, periph)
/* pa9_tc5wo1_out */
#define PA9_TC5WO1_OUT         MCHP_PINMUX(a, 9, 0x280, 26, periph)
/* pa9_tc6wo0g1_in */
#define PA9_TC6WO0G1_IN        MCHP_PINMUX(a, 9, 0x12c, 25, periph)
/* pa9_tc6wo0g3_in */
#define PA9_TC6WO0G3_IN        MCHP_PINMUX(a, 9, 0x130, 16, periph)
/* pa9_tc6wo0_out */
#define PA9_TC6WO0_OUT         MCHP_PINMUX(a, 9, 0x278, 24, periph)
/* pa9_tc6wo1g4_in */
#define PA9_TC6WO1G4_IN        MCHP_PINMUX(a, 9, 0x138, 2, periph)
/* pa9_tc6wo1_out */
#define PA9_TC6WO1_OUT         MCHP_PINMUX(a, 9, 0x280, 27, periph)
/* pa9_tc7wo0g1_in */
#define PA9_TC7WO0G1_IN        MCHP_PINMUX(a, 9, 0x13c, 25, periph)
/* pa9_tc7wo0g3_in */
#define PA9_TC7WO0G3_IN        MCHP_PINMUX(a, 9, 0x140, 16, periph)
/* pa9_tc7wo0_out */
#define PA9_TC7WO0_OUT         MCHP_PINMUX(a, 9, 0x278, 25, periph)
/* pa9_tc7wo1g4_in */
#define PA9_TC7WO1G4_IN        MCHP_PINMUX(a, 9, 0x148, 2, periph)
/* pa9_tc7wo1_out */
#define PA9_TC7WO1_OUT         MCHP_PINMUX(a, 9, 0x280, 28, periph)
/* pa9_tc8wo0g1_in */
#define PA9_TC8WO0G1_IN        MCHP_PINMUX(a, 9, 0x14c, 25, periph)
/* pa9_tc8wo0g3_in */
#define PA9_TC8WO0G3_IN        MCHP_PINMUX(a, 9, 0x150, 16, periph)
/* pa9_tc8wo0_out */
#define PA9_TC8WO0_OUT         MCHP_PINMUX(a, 9, 0x278, 26, periph)
/* pa9_tc9wo0g4_in */
#define PA9_TC9WO0G4_IN        MCHP_PINMUX(a, 9, 0x160, 2, periph)
/* pa9_tc9wo0_out */
#define PA9_TC9WO0_OUT         MCHP_PINMUX(a, 9, 0x280, 29, periph)
/* pa9_tc9wo1g3_in */
#define PA9_TC9WO1G3_IN        MCHP_PINMUX(a, 9, 0x164, 16, periph)
/* pa9_tc9wo1_out */
#define PA9_TC9WO1_OUT         MCHP_PINMUX(a, 9, 0x27c, 33, periph)
/* pa9_tcc0wo0_out */
#define PA9_TCC0WO0_OUT        MCHP_PINMUX(a, 9, 0x278, 13, periph)
/* pa9_tcc0wo1_out */
#define PA9_TCC0WO1_OUT        MCHP_PINMUX(a, 9, 0x280, 15, periph)
/* pa9_tcc0wo2_out */
#define PA9_TCC0WO2_OUT        MCHP_PINMUX(a, 9, 0x27c, 17, periph)
/* pa9_tcc0wo3_out */
#define PA9_TCC0WO3_OUT        MCHP_PINMUX(a, 9, 0x280, 14, periph)
/* pa9_tcc0wo4_out */
#define PA9_TCC0WO4_OUT        MCHP_PINMUX(a, 9, 0x278, 14, periph)
/* pa9_tcc0wo5_out */
#define PA9_TCC0WO5_OUT        MCHP_PINMUX(a, 9, 0x280, 16, periph)
/* pa9_tcc1wo0_out */
#define PA9_TCC1WO0_OUT        MCHP_PINMUX(a, 9, 0x278, 15, periph)
/* pa9_tcc1wo1_out */
#define PA9_TCC1WO1_OUT        MCHP_PINMUX(a, 9, 0x280, 18, periph)
/* pa9_tcc1wo2_out */
#define PA9_TCC1WO2_OUT        MCHP_PINMUX(a, 9, 0x27c, 20, periph)
/* pa9_tcc1wo3_out */
#define PA9_TCC1WO3_OUT        MCHP_PINMUX(a, 9, 0x280, 17, periph)
/* pa9_tcc1wo4_out */
#define PA9_TCC1WO4_OUT        MCHP_PINMUX(a, 9, 0x278, 16, periph)
/* pa9_tcc1wo5_out */
#define PA9_TCC1WO5_OUT        MCHP_PINMUX(a, 9, 0x280, 19, periph)
/* pa9_tcc2wo0_out */
#define PA9_TCC2WO0_OUT        MCHP_PINMUX(a, 9, 0x278, 17, periph)
/* pa9_tcc2wo1_out */
#define PA9_TCC2WO1_OUT        MCHP_PINMUX(a, 9, 0x280, 20, periph)
/* pa9_tstbus0_out */
#define PA9_TSTBUS0_OUT        MCHP_PINMUX(a, 9, 0x278, 32, periph)
/* pa9_tstbus1_out */
#define PA9_TSTBUS1_OUT        MCHP_PINMUX(a, 9, 0x27c, 38, periph)
/* pa9_tstbus2_out */
#define PA9_TSTBUS2_OUT        MCHP_PINMUX(a, 9, 0x280, 34, periph)
/* pa9_tstbus4_out */
#define PA9_TSTBUS4_OUT        MCHP_PINMUX(a, 9, 0x278, 33, periph)
/* pa9_tstbus6_out */
#define PA9_TSTBUS6_OUT        MCHP_PINMUX(a, 9, 0x280, 35, periph)
/* pa9_tstbus8_out */
#define PA9_TSTBUS8_OUT        MCHP_PINMUX(a, 9, 0x278, 34, periph)
/* pa9_tstbus10_out */
#define PA9_TSTBUS10_OUT       MCHP_PINMUX(a, 9, 0x27c, 39, periph)
/* pa10_accmpten_in */
#define PA10_ACCMPTEN_IN       MCHP_PINMUX(a, 10, 0x18c, 21, periph)
/* pa10_ac_cmp1_out */
#define PA10_AC_CMP1_OUT       MCHP_PINMUX(a, 10, 0x288, 36, periph)
/* pa10_ac_cmptout_out */
#define PA10_AC_CMPTOUT_OUT    MCHP_PINMUX(a, 10, 0x288, 37, periph)
/* pa10_can1_tx_out */
#define PA10_CAN1_TX_OUT       MCHP_PINMUX(a, 10, 0x288, 38, periph)
/* pa10_cclin0_in */
#define PA10_CCLIN0_IN         MCHP_PINMUX(a, 10, 0xb4, 21, periph)
/* pa10_cclin3_in */
#define PA10_CCLIN3_IN         MCHP_PINMUX(a, 10, 0xc0, 21, periph)
/* pa10_cclo0_out */
#define PA10_CCLO0_OUT         MCHP_PINMUX(a, 10, 0x28c, 1, periph)
/* pa10_cclo1_out */
#define PA10_CCLO1_OUT         MCHP_PINMUX(a, 10, 0x288, 1, periph)
/* pa10_coexwlanact_in */
#define PA10_COEXWLANACT_IN    MCHP_PINMUX(a, 10, 0x194, 14, periph)
/* pa10_coex_bt_state_out */
#define PA10_COEX_BT_STATE_OUT MCHP_PINMUX(a, 10, 0x284, 37, periph)
/* pa10_extint0_in */
#define PA10_EXTINT0_IN        MCHP_PINMUX(a, 10, 0x0, 21, periph)
/* pa10_extint3_in */
#define PA10_EXTINT3_IN        MCHP_PINMUX(a, 10, 0xc, 14, periph)
/* pa10_fectrl1_out */
#define PA10_FECTRL1_OUT       MCHP_PINMUX(a, 10, 0x284, 35, periph)
/* pa10_fectrl2_out */
#define PA10_FECTRL2_OUT       MCHP_PINMUX(a, 10, 0x284, 36, periph)
/* pa10_fectrl3_out */
#define PA10_FECTRL3_OUT       MCHP_PINMUX(a, 10, 0x288, 39, periph)
/* pa10_fectrl5_out */
#define PA10_FECTRL5_OUT       MCHP_PINMUX(a, 10, 0x288, 40, periph)
/* pa10_nmi_in */
#define PA10_NMI_IN            MCHP_PINMUX(a, 10, 0x3c, 14, periph)
/* pa10_qd0_in */
#define PA10_QD0_IN            MCHP_PINMUX(a, 10, 0xa0, 14, periph)
/* pa10_qd0_out */
#define PA10_QD0_OUT           MCHP_PINMUX(a, 10, 0x288, 33, periph)
/* pa10_qd1_in */
#define PA10_QD1_IN            MCHP_PINMUX(a, 10, 0xa4, 21, periph)
/* pa10_qd1_out */
#define PA10_QD1_OUT           MCHP_PINMUX(a, 10, 0x284, 30, periph)
/* pa10_qd2_out */
#define PA10_QD2_OUT           MCHP_PINMUX(a, 10, 0x284, 29, periph)
/* pa10_qd3_out */
#define PA10_QD3_OUT           MCHP_PINMUX(a, 10, 0x284, 28, periph)
/* pa10_qeiccmp0_out */
#define PA10_QEICCMP0_OUT      MCHP_PINMUX(a, 10, 0x284, 31, periph)
/* pa10_qeihome0g1_in */
#define PA10_QEIHOME0G1_IN     MCHP_PINMUX(a, 10, 0x16c, 21, periph)
/* pa10_qeiqea0g4_in */
#define PA10_QEIQEA0G4_IN      MCHP_PINMUX(a, 10, 0x180, 14, periph)
/* pa10_qeiqeb0g4_in */
#define PA10_QEIQEB0G4_IN      MCHP_PINMUX(a, 10, 0x184, 14, periph)
/* pa10_qeiqeb0g5_in */
#define PA10_QEIQEB0G5_IN      MCHP_PINMUX(a, 10, 0x188, 2, periph)
/* pa10_qspics_out */
#define PA10_QSPICS_OUT        MCHP_PINMUX(a, 10, 0x284, 27, periph)
/* pa10_scom0p0_out */
#define PA10_SCOM0P0_OUT       MCHP_PINMUX(a, 10, 0x288, 3, periph)
/* pa10_scom0p2_in */
#define PA10_SCOM0P2_IN        MCHP_PINMUX(a, 10, 0x48, 14, periph)
/* pa10_scom0p2_out */
#define PA10_SCOM0P2_OUT       MCHP_PINMUX(a, 10, 0x284, 2, periph)
/* pa10_scom0p3_in */
#define PA10_SCOM0P3_IN        MCHP_PINMUX(a, 10, 0x4c, 21, periph)
/* pa10_scom0p3_out */
#define PA10_SCOM0P3_OUT       MCHP_PINMUX(a, 10, 0x284, 1, periph)
/* pa10_scom1p0_out */
#define PA10_SCOM1P0_OUT       MCHP_PINMUX(a, 10, 0x284, 3, periph)
/* pa10_scom1p2_in */
#define PA10_SCOM1P2_IN        MCHP_PINMUX(a, 10, 0x58, 21, periph)
/* pa10_scom1p2_out */
#define PA10_SCOM1P2_OUT       MCHP_PINMUX(a, 10, 0x284, 4, periph)
/* pa10_scom1p3_out */
#define PA10_SCOM1P3_OUT       MCHP_PINMUX(a, 10, 0x288, 4, periph)
/* pa10_scom2p0_out */
#define PA10_SCOM2P0_OUT       MCHP_PINMUX(a, 10, 0x288, 7, periph)
/* pa10_scom2p2_in */
#define PA10_SCOM2P2_IN        MCHP_PINMUX(a, 10, 0x68, 14, periph)
/* pa10_scom2p2_out */
#define PA10_SCOM2P2_OUT       MCHP_PINMUX(a, 10, 0x284, 6, periph)
/* pa10_scom2p3_in */
#define PA10_SCOM2P3_IN        MCHP_PINMUX(a, 10, 0x6c, 21, periph)
/* pa10_scom2p3_out */
#define PA10_SCOM2P3_OUT       MCHP_PINMUX(a, 10, 0x284, 5, periph)
/* pa10_scom3p0_out */
#define PA10_SCOM3P0_OUT       MCHP_PINMUX(a, 10, 0x284, 7, periph)
/* pa10_scom3p2_in */
#define PA10_SCOM3P2_IN        MCHP_PINMUX(a, 10, 0x78, 21, periph)
/* pa10_scom3p2_out */
#define PA10_SCOM3P2_OUT       MCHP_PINMUX(a, 10, 0x284, 8, periph)
/* pa10_scom3p3_out */
#define PA10_SCOM3P3_OUT       MCHP_PINMUX(a, 10, 0x288, 8, periph)
/* pa10_tc0wo0g1_in */
#define PA10_TC0WO0G1_IN       MCHP_PINMUX(a, 10, 0xcc, 21, periph)
/* pa10_tc0wo0_out */
#define PA10_TC0WO0_OUT        MCHP_PINMUX(a, 10, 0x288, 21, periph)
/* pa10_tc0wo1g4_in */
#define PA10_TC0WO1G4_IN       MCHP_PINMUX(a, 10, 0xd8, 14, periph)
/* pa10_tc0wo1_out */
#define PA10_TC0WO1_OUT        MCHP_PINMUX(a, 10, 0x284, 18, periph)
/* pa10_tc1wo0g1_in */
#define PA10_TC1WO0G1_IN       MCHP_PINMUX(a, 10, 0xdc, 21, periph)
/* pa10_tc1wo0_out */
#define PA10_TC1WO0_OUT        MCHP_PINMUX(a, 10, 0x284, 19, periph)
/* pa10_tc1wo1_out */
#define PA10_TC1WO1_OUT        MCHP_PINMUX(a, 10, 0x288, 22, periph)
/* pa10_tc2wo0g1_in */
#define PA10_TC2WO0G1_IN       MCHP_PINMUX(a, 10, 0xec, 21, periph)
/* pa10_tc2wo0_out */
#define PA10_TC2WO0_OUT        MCHP_PINMUX(a, 10, 0x284, 20, periph)
/* pa10_tc2wo1g4_in */
#define PA10_TC2WO1G4_IN       MCHP_PINMUX(a, 10, 0xf8, 14, periph)
/* pa10_tc2wo1_out */
#define PA10_TC2WO1_OUT        MCHP_PINMUX(a, 10, 0x288, 23, periph)
/* pa10_tc3wo0g1_in */
#define PA10_TC3WO0G1_IN       MCHP_PINMUX(a, 10, 0xfc, 21, periph)
/* pa10_tc3wo0_out */
#define PA10_TC3WO0_OUT        MCHP_PINMUX(a, 10, 0x284, 21, periph)
/* pa10_tc3wo1g4_in */
#define PA10_TC3WO1G4_IN       MCHP_PINMUX(a, 10, 0x108, 14, periph)
/* pa10_tc3wo1_out */
#define PA10_TC3WO1_OUT        MCHP_PINMUX(a, 10, 0x288, 24, periph)
/* pa10_tc4wo0g1_in */
#define PA10_TC4WO0G1_IN       MCHP_PINMUX(a, 10, 0x10c, 21, periph)
/* pa10_tc4wo0_out */
#define PA10_TC4WO0_OUT        MCHP_PINMUX(a, 10, 0x284, 22, periph)
/* pa10_tc4wo1g4_in */
#define PA10_TC4WO1G4_IN       MCHP_PINMUX(a, 10, 0x118, 14, periph)
/* pa10_tc4wo1_out */
#define PA10_TC4WO1_OUT        MCHP_PINMUX(a, 10, 0x288, 25, periph)
/* pa10_tc5wo0g1_in */
#define PA10_TC5WO0G1_IN       MCHP_PINMUX(a, 10, 0x11c, 21, periph)
/* pa10_tc5wo0_out */
#define PA10_TC5WO0_OUT        MCHP_PINMUX(a, 10, 0x284, 23, periph)
/* pa10_tc5wo1g4_in */
#define PA10_TC5WO1G4_IN       MCHP_PINMUX(a, 10, 0x128, 14, periph)
/* pa10_tc5wo1_out */
#define PA10_TC5WO1_OUT        MCHP_PINMUX(a, 10, 0x288, 26, periph)
/* pa10_tc6wo0g1_in */
#define PA10_TC6WO0G1_IN       MCHP_PINMUX(a, 10, 0x12c, 21, periph)
/* pa10_tc6wo0_out */
#define PA10_TC6WO0_OUT        MCHP_PINMUX(a, 10, 0x284, 24, periph)
/* pa10_tc6wo1g4_in */
#define PA10_TC6WO1G4_IN       MCHP_PINMUX(a, 10, 0x138, 14, periph)
/* pa10_tc6wo1_out */
#define PA10_TC6WO1_OUT        MCHP_PINMUX(a, 10, 0x288, 27, periph)
/* pa10_tc7wo0g1_in */
#define PA10_TC7WO0G1_IN       MCHP_PINMUX(a, 10, 0x13c, 21, periph)
/* pa10_tc7wo0_out */
#define PA10_TC7WO0_OUT        MCHP_PINMUX(a, 10, 0x284, 25, periph)
/* pa10_tc7wo1g4_in */
#define PA10_TC7WO1G4_IN       MCHP_PINMUX(a, 10, 0x148, 14, periph)
/* pa10_tc7wo1_out */
#define PA10_TC7WO1_OUT        MCHP_PINMUX(a, 10, 0x288, 28, periph)
/* pa10_tc8wo0g1_in */
#define PA10_TC8WO0G1_IN       MCHP_PINMUX(a, 10, 0x14c, 21, periph)
/* pa10_tc8wo0_out */
#define PA10_TC8WO0_OUT        MCHP_PINMUX(a, 10, 0x284, 26, periph)
/* pa10_tc8wo1g5_in */
#define PA10_TC8WO1G5_IN       MCHP_PINMUX(a, 10, 0x158, 2, periph)
/* pa10_tc8wo1_out */
#define PA10_TC8WO1_OUT        MCHP_PINMUX(a, 10, 0x28c, 10, periph)
/* pa10_tc9wo0g4_in */
#define PA10_TC9WO0G4_IN       MCHP_PINMUX(a, 10, 0x160, 14, periph)
/* pa10_tc9wo0_out */
#define PA10_TC9WO0_OUT        MCHP_PINMUX(a, 10, 0x288, 29, periph)
/* pa10_tc9wo1g5_in */
#define PA10_TC9WO1G5_IN       MCHP_PINMUX(a, 10, 0x168, 2, periph)
/* pa10_tc9wo1_out */
#define PA10_TC9WO1_OUT        MCHP_PINMUX(a, 10, 0x28c, 11, periph)
/* pa10_tcc0wo0_out */
#define PA10_TCC0WO0_OUT       MCHP_PINMUX(a, 10, 0x284, 13, periph)
/* pa10_tcc0wo1_out */
#define PA10_TCC0WO1_OUT       MCHP_PINMUX(a, 10, 0x288, 15, periph)
/* pa10_tcc0wo2_out */
#define PA10_TCC0WO2_OUT       MCHP_PINMUX(a, 10, 0x28c, 5, periph)
/* pa10_tcc0wo3_out */
#define PA10_TCC0WO3_OUT       MCHP_PINMUX(a, 10, 0x288, 14, periph)
/* pa10_tcc0wo4_out */
#define PA10_TCC0WO4_OUT       MCHP_PINMUX(a, 10, 0x284, 14, periph)
/* pa10_tcc0wo5_out */
#define PA10_TCC0WO5_OUT       MCHP_PINMUX(a, 10, 0x288, 16, periph)
/* pa10_tcc1wo0_out */
#define PA10_TCC1WO0_OUT       MCHP_PINMUX(a, 10, 0x284, 15, periph)
/* pa10_tcc1wo1_out */
#define PA10_TCC1WO1_OUT       MCHP_PINMUX(a, 10, 0x288, 18, periph)
/* pa10_tcc1wo2_out */
#define PA10_TCC1WO2_OUT       MCHP_PINMUX(a, 10, 0x28c, 8, periph)
/* pa10_tcc1wo3_out */
#define PA10_TCC1WO3_OUT       MCHP_PINMUX(a, 10, 0x288, 17, periph)
/* pa10_tcc1wo4_out */
#define PA10_TCC1WO4_OUT       MCHP_PINMUX(a, 10, 0x284, 16, periph)
/* pa10_tcc1wo5_out */
#define PA10_TCC1WO5_OUT       MCHP_PINMUX(a, 10, 0x288, 19, periph)
/* pa10_tcc2wo0_out */
#define PA10_TCC2WO0_OUT       MCHP_PINMUX(a, 10, 0x284, 17, periph)
/* pa10_tcc2wo1_out */
#define PA10_TCC2WO1_OUT       MCHP_PINMUX(a, 10, 0x288, 20, periph)
/* pa10_tstbus0_out */
#define PA10_TSTBUS0_OUT       MCHP_PINMUX(a, 10, 0x284, 32, periph)
/* pa10_tstbus2_out */
#define PA10_TSTBUS2_OUT       MCHP_PINMUX(a, 10, 0x288, 34, periph)
/* pa10_tstbus3_out */
#define PA10_TSTBUS3_OUT       MCHP_PINMUX(a, 10, 0x28c, 15, periph)
/* pa10_tstbus4_out */
#define PA10_TSTBUS4_OUT       MCHP_PINMUX(a, 10, 0x284, 33, periph)
/* pa10_tstbus6_out */
#define PA10_TSTBUS6_OUT       MCHP_PINMUX(a, 10, 0x288, 35, periph)
/* pa10_tstbus7_out */
#define PA10_TSTBUS7_OUT       MCHP_PINMUX(a, 10, 0x28c, 16, periph)
/* pa10_tstbus8_out */
#define PA10_TSTBUS8_OUT       MCHP_PINMUX(a, 10, 0x284, 34, periph)
/* pa10_tstbus11_out */
#define PA10_TSTBUS11_OUT      MCHP_PINMUX(a, 10, 0x28c, 17, periph)
/* pa11_accmpten_in */
#define PA11_ACCMPTEN_IN       MCHP_PINMUX(a, 11, 0x18c, 3, periph)
/* pa11_cclin0_in */
