zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz66/pic32cx2051bz66048-pinctrl.h
#define PA14_TCC2WO1_OUT       MCHP_PINMUX(a, 14, 0x2ac, 20, periph)
/* pa14_tstbus0_out */
#define PA14_TSTBUS0_OUT       MCHP_PINMUX(a, 14, 0x2a8, 32, periph)
/* pa14_tstbus2_out */
#define PA14_TSTBUS2_OUT       MCHP_PINMUX(a, 14, 0x2ac, 34, periph)
/* pa14_tstbus4_out */
#define PA14_TSTBUS4_OUT       MCHP_PINMUX(a, 14, 0x2a8, 33, periph)
/* pa14_tstbus6_out */
#define PA14_TSTBUS6_OUT       MCHP_PINMUX(a, 14, 0x2ac, 35, periph)
/* pa14_tstbus8_out */
#define PA14_TSTBUS8_OUT       MCHP_PINMUX(a, 14, 0x2a8, 34, periph)
/* pb0_accmpten_in */
#define PB0_ACCMPTEN_IN        MCHP_PINMUX(b, 0, 0x18c, 4, periph)
/* pb0_cclin0_in */
#define PB0_CCLIN0_IN          MCHP_PINMUX(b, 0, 0xb4, 4, periph)
/* pb0_cclin1_in */
#define PB0_CCLIN1_IN          MCHP_PINMUX(b, 0, 0xb8, 21, periph)
/* pb0_cclin3_in */
#define PB0_CCLIN3_IN          MCHP_PINMUX(b, 0, 0xc0, 4, periph)
/* pb0_cclin4_in */
#define PB0_CCLIN4_IN          MCHP_PINMUX(b, 0, 0xc4, 21, periph)
/* pb0_cclo0_out */
#define PB0_CCLO0_OUT          MCHP_PINMUX(b, 0, 0x2bc, 1, periph)
/* pb0_cclo1_out */
#define PB0_CCLO1_OUT          MCHP_PINMUX(b, 0, 0x2b8, 1, periph)
/* pb0_coex_bt_state_out */
#define PB0_COEX_BT_STATE_OUT  MCHP_PINMUX(b, 0, 0x2b4, 37, periph)
/* pb0_coex_rf_act_out */
#define PB0_COEX_RF_ACT_OUT    MCHP_PINMUX(b, 0, 0x2b8, 41, periph)
/* pb0_extint0_in */
#define PB0_EXTINT0_IN         MCHP_PINMUX(b, 0, 0x0, 4, periph)
/* pb0_extint1_in */
#define PB0_EXTINT1_IN         MCHP_PINMUX(b, 0, 0x4, 21, periph)
/* pb0_fectrl0_out */
#define PB0_FECTRL0_OUT        MCHP_PINMUX(b, 0, 0x2b8, 40, periph)
/* pb0_fectrl1_out */
#define PB0_FECTRL1_OUT        MCHP_PINMUX(b, 0, 0x2b4, 35, periph)
/* pb0_fectrl2_out */
#define PB0_FECTRL2_OUT        MCHP_PINMUX(b, 0, 0x2b4, 36, periph)
/* pb0_qd0_out */
#define PB0_QD0_OUT            MCHP_PINMUX(b, 0, 0x2b8, 35, periph)
/* pb0_qd1_in */
#define PB0_QD1_IN             MCHP_PINMUX(b, 0, 0xa4, 4, periph)
/* pb0_qd1_out */
#define PB0_QD1_OUT            MCHP_PINMUX(b, 0, 0x2b4, 30, periph)
/* pb0_qd2_in */
#define PB0_QD2_IN             MCHP_PINMUX(b, 0, 0xa8, 21, periph)
/* pb0_qd2_out */
#define PB0_QD2_OUT            MCHP_PINMUX(b, 0, 0x2b4, 29, periph)
/* pb0_qd3_out */
#define PB0_QD3_OUT            MCHP_PINMUX(b, 0, 0x2b4, 28, periph)
/* pb0_qeiccmp0_out */
#define PB0_QEICCMP0_OUT       MCHP_PINMUX(b, 0, 0x2b4, 31, periph)
/* pb0_qeihome0g1_in */
#define PB0_QEIHOME0G1_IN      MCHP_PINMUX(b, 0, 0x16c, 4, periph)
/* pb0_qeihome0g2_in */
#define PB0_QEIHOME0G2_IN      MCHP_PINMUX(b, 0, 0x170, 21, periph)
/* pb0_qeiindx0g2_in */
#define PB0_QEIINDX0G2_IN      MCHP_PINMUX(b, 0, 0x174, 21, periph)
/* pb0_qeiqeb0g5_in */
#define PB0_QEIQEB0G5_IN       MCHP_PINMUX(b, 0, 0x188, 8, periph)
/* pb0_qspics_out */
#define PB0_QSPICS_OUT         MCHP_PINMUX(b, 0, 0x2b4, 27, periph)
/* pb0_scom0p0_in */
#define PB0_SCOM0P0_IN         MCHP_PINMUX(b, 0, 0x40, 21, periph)
/* pb0_scom0p0_out */
#define PB0_SCOM0P0_OUT        MCHP_PINMUX(b, 0, 0x2b8, 2, periph)
/* pb0_scom0p2_out */
#define PB0_SCOM0P2_OUT        MCHP_PINMUX(b, 0, 0x2b4, 2, periph)
/* pb0_scom0p3_in */
#define PB0_SCOM0P3_IN         MCHP_PINMUX(b, 0, 0x4c, 4, periph)
/* pb0_scom0p3_out */
#define PB0_SCOM0P3_OUT        MCHP_PINMUX(b, 0, 0x2b4, 1, periph)
/* pb0_scom1p0_out */
#define PB0_SCOM1P0_OUT        MCHP_PINMUX(b, 0, 0x2b4, 3, periph)
/* pb0_scom1p2_in */
#define PB0_SCOM1P2_IN         MCHP_PINMUX(b, 0, 0x58, 4, periph)
/* pb0_scom1p2_out */
#define PB0_SCOM1P2_OUT        MCHP_PINMUX(b, 0, 0x2b4, 4, periph)
/* pb0_scom1p3_in */
#define PB0_SCOM1P3_IN         MCHP_PINMUX(b, 0, 0x5c, 21, periph)
/* pb0_scom1p3_out */
#define PB0_SCOM1P3_OUT        MCHP_PINMUX(b, 0, 0x2b8, 5, periph)
/* pb0_scom2p0_in */
#define PB0_SCOM2P0_IN         MCHP_PINMUX(b, 0, 0x60, 21, periph)
/* pb0_scom2p0_out */
#define PB0_SCOM2P0_OUT        MCHP_PINMUX(b, 0, 0x2b8, 7, periph)
/* pb0_scom2p2_out */
#define PB0_SCOM2P2_OUT        MCHP_PINMUX(b, 0, 0x2b4, 6, periph)
/* pb0_scom2p3_in */
#define PB0_SCOM2P3_IN         MCHP_PINMUX(b, 0, 0x6c, 4, periph)
/* pb0_scom2p3_out */
#define PB0_SCOM2P3_OUT        MCHP_PINMUX(b, 0, 0x2b4, 5, periph)
/* pb0_scom3p0_out */
#define PB0_SCOM3P0_OUT        MCHP_PINMUX(b, 0, 0x2b4, 7, periph)
/* pb0_scom3p2_in */
#define PB0_SCOM3P2_IN         MCHP_PINMUX(b, 0, 0x78, 4, periph)
/* pb0_scom3p2_out */
#define PB0_SCOM3P2_OUT        MCHP_PINMUX(b, 0, 0x2b4, 8, periph)
/* pb0_scom3p3_in */
#define PB0_SCOM3P3_IN         MCHP_PINMUX(b, 0, 0x7c, 21, periph)
/* pb0_scom3p3_out */
#define PB0_SCOM3P3_OUT        MCHP_PINMUX(b, 0, 0x2b8, 10, periph)
/* pb0_tc0wo0g1_in */
#define PB0_TC0WO0G1_IN        MCHP_PINMUX(b, 0, 0xcc, 4, periph)
/* pb0_tc0wo0g2_in */
#define PB0_TC0WO0G2_IN        MCHP_PINMUX(b, 0, 0xd0, 21, periph)
/* pb0_tc0wo1_out */
#define PB0_TC0WO1_OUT         MCHP_PINMUX(b, 0, 0x2b4, 18, periph)
/* pb0_tc1wo0g1_in */
#define PB0_TC1WO0G1_IN        MCHP_PINMUX(b, 0, 0xdc, 4, periph)
/* pb0_tc1wo0_out */
#define PB0_TC1WO0_OUT         MCHP_PINMUX(b, 0, 0x2b4, 19, periph)
/* pb0_tc1wo1g2_in */
#define PB0_TC1WO1G2_IN        MCHP_PINMUX(b, 0, 0xe4, 21, periph)
/* pb0_tc1wo1_out */
#define PB0_TC1WO1_OUT         MCHP_PINMUX(b, 0, 0x2b8, 25, periph)
/* pb0_tc2wo0g1_in */
#define PB0_TC2WO0G1_IN        MCHP_PINMUX(b, 0, 0xec, 4, periph)
/* pb0_tc2wo0_out */
#define PB0_TC2WO0_OUT         MCHP_PINMUX(b, 0, 0x2b4, 20, periph)
/* pb0_tc2wo1g2_in */
#define PB0_TC2WO1G2_IN        MCHP_PINMUX(b, 0, 0xf4, 21, periph)
/* pb0_tc2wo1_out */
#define PB0_TC2WO1_OUT         MCHP_PINMUX(b, 0, 0x2b8, 26, periph)
/* pb0_tc3wo0g1_in */
#define PB0_TC3WO0G1_IN        MCHP_PINMUX(b, 0, 0xfc, 4, periph)
/* pb0_tc3wo0_out */
#define PB0_TC3WO0_OUT         MCHP_PINMUX(b, 0, 0x2b4, 21, periph)
/* pb0_tc3wo1g2_in */
#define PB0_TC3WO1G2_IN        MCHP_PINMUX(b, 0, 0x104, 21, periph)
/* pb0_tc3wo1_out */
#define PB0_TC3WO1_OUT         MCHP_PINMUX(b, 0, 0x2b8, 27, periph)
/* pb0_tc4wo0g1_in */
#define PB0_TC4WO0G1_IN        MCHP_PINMUX(b, 0, 0x10c, 4, periph)
/* pb0_tc4wo0_out */
#define PB0_TC4WO0_OUT         MCHP_PINMUX(b, 0, 0x2b4, 22, periph)
/* pb0_tc4wo1g2_in */
#define PB0_TC4WO1G2_IN        MCHP_PINMUX(b, 0, 0x114, 21, periph)
/* pb0_tc4wo1_out */
#define PB0_TC4WO1_OUT         MCHP_PINMUX(b, 0, 0x2b8, 28, periph)
/* pb0_tc5wo0g1_in */
#define PB0_TC5WO0G1_IN        MCHP_PINMUX(b, 0, 0x11c, 4, periph)
/* pb0_tc5wo0_out */
#define PB0_TC5WO0_OUT         MCHP_PINMUX(b, 0, 0x2b4, 23, periph)
/* pb0_tc5wo1g2_in */
#define PB0_TC5WO1G2_IN        MCHP_PINMUX(b, 0, 0x124, 21, periph)
/* pb0_tc5wo1_out */
#define PB0_TC5WO1_OUT         MCHP_PINMUX(b, 0, 0x2b8, 29, periph)
/* pb0_tc6wo0g1_in */
#define PB0_TC6WO0G1_IN        MCHP_PINMUX(b, 0, 0x12c, 4, periph)
/* pb0_tc6wo0_out */
#define PB0_TC6WO0_OUT         MCHP_PINMUX(b, 0, 0x2b4, 24, periph)
/* pb0_tc6wo1g2_in */
#define PB0_TC6WO1G2_IN        MCHP_PINMUX(b, 0, 0x134, 21, periph)
/* pb0_tc6wo1_out */
#define PB0_TC6WO1_OUT         MCHP_PINMUX(b, 0, 0x2b8, 30, periph)
/* pb0_tc7wo0g1_in */
#define PB0_TC7WO0G1_IN        MCHP_PINMUX(b, 0, 0x13c, 4, periph)
/* pb0_tc7wo0_out */
#define PB0_TC7WO0_OUT         MCHP_PINMUX(b, 0, 0x2b4, 25, periph)
/* pb0_tc7wo1g2_in */
#define PB0_TC7WO1G2_IN        MCHP_PINMUX(b, 0, 0x144, 21, periph)
/* pb0_tc7wo1_out */
#define PB0_TC7WO1_OUT         MCHP_PINMUX(b, 0, 0x2b8, 31, periph)
/* pb0_tc8wo0g1_in */
#define PB0_TC8WO0G1_IN        MCHP_PINMUX(b, 0, 0x14c, 4, periph)
/* pb0_tc8wo0_out */
#define PB0_TC8WO0_OUT         MCHP_PINMUX(b, 0, 0x2b4, 26, periph)
/* pb0_tc8wo1g2_in */
#define PB0_TC8WO1G2_IN        MCHP_PINMUX(b, 0, 0x154, 21, periph)
/* pb0_tc8wo1g5_in */
#define PB0_TC8WO1G5_IN        MCHP_PINMUX(b, 0, 0x158, 8, periph)
/* pb0_tc8wo1_out */
#define PB0_TC8WO1_OUT         MCHP_PINMUX(b, 0, 0x2b8, 32, periph)
/* pb0_tc9wo0g2_in */
#define PB0_TC9WO0G2_IN        MCHP_PINMUX(b, 0, 0x15c, 21, periph)
/* pb0_tc9wo0_out */
#define PB0_TC9WO0_OUT         MCHP_PINMUX(b, 0, 0x2b8, 33, periph)
/* pb0_tc9wo1g5_in */
#define PB0_TC9WO1G5_IN        MCHP_PINMUX(b, 0, 0x168, 8, periph)
/* pb0_tc9wo1_out */
#define PB0_TC9WO1_OUT         MCHP_PINMUX(b, 0, 0x2bc, 11, periph)
/* pb0_tcc0wo0_out */
#define PB0_TCC0WO0_OUT        MCHP_PINMUX(b, 0, 0x2b4, 13, periph)
/* pb0_tcc0wo1_out */
#define PB0_TCC0WO1_OUT        MCHP_PINMUX(b, 0, 0x2b8, 17, periph)
/* pb0_tcc0wo2_out */
#define PB0_TCC0WO2_OUT        MCHP_PINMUX(b, 0, 0x2bc, 5, periph)
/* pb0_tcc0wo3_out */
#define PB0_TCC0WO3_OUT        MCHP_PINMUX(b, 0, 0x2b8, 19, periph)
/* pb0_tcc0wo4_out */
#define PB0_TCC0WO4_OUT        MCHP_PINMUX(b, 0, 0x2b4, 14, periph)
/* pb0_tcc0wo5_out */
#define PB0_TCC0WO5_OUT        MCHP_PINMUX(b, 0, 0x2b8, 18, periph)
/* pb0_tcc1wo0_out */
#define PB0_TCC1WO0_OUT        MCHP_PINMUX(b, 0, 0x2b4, 15, periph)
/* pb0_tcc1wo1_out */
#define PB0_TCC1WO1_OUT        MCHP_PINMUX(b, 0, 0x2b8, 20, periph)
/* pb0_tcc1wo2_out */
#define PB0_TCC1WO2_OUT        MCHP_PINMUX(b, 0, 0x2bc, 8, periph)
/* pb0_tcc1wo3_out */
#define PB0_TCC1WO3_OUT        MCHP_PINMUX(b, 0, 0x2b8, 22, periph)
/* pb0_tcc1wo4_out */
#define PB0_TCC1WO4_OUT        MCHP_PINMUX(b, 0, 0x2b4, 16, periph)
/* pb0_tcc1wo5_out */
#define PB0_TCC1WO5_OUT        MCHP_PINMUX(b, 0, 0x2b8, 21, periph)
/* pb0_tcc2wo0_out */
#define PB0_TCC2WO0_OUT        MCHP_PINMUX(b, 0, 0x2b4, 17, periph)
/* pb0_tcc2wo1_out */
#define PB0_TCC2WO1_OUT        MCHP_PINMUX(b, 0, 0x2b8, 23, periph)
/* pb0_tstbus0_out */
#define PB0_TSTBUS0_OUT        MCHP_PINMUX(b, 0, 0x2b4, 32, periph)
/* pb0_tstbus3_out */
#define PB0_TSTBUS3_OUT        MCHP_PINMUX(b, 0, 0x2bc, 15, periph)
/* pb0_tstbus4_out */
#define PB0_TSTBUS4_OUT        MCHP_PINMUX(b, 0, 0x2b4, 33, periph)
/* pb0_tstbus5_out */
#define PB0_TSTBUS5_OUT        MCHP_PINMUX(b, 0, 0x2b8, 38, periph)
/* pb0_tstbus7_out */
#define PB0_TSTBUS7_OUT        MCHP_PINMUX(b, 0, 0x2bc, 16, periph)
/* pb0_tstbus8_out */
#define PB0_TSTBUS8_OUT        MCHP_PINMUX(b, 0, 0x2b4, 34, periph)
/* pb0_tstbus9_out */
#define PB0_TSTBUS9_OUT        MCHP_PINMUX(b, 0, 0x2b8, 39, periph)
/* pb0_tstbus11_out */
#define PB0_TSTBUS11_OUT       MCHP_PINMUX(b, 0, 0x2bc, 17, periph)
/* pb1_accmpten_in */
#define PB1_ACCMPTEN_IN        MCHP_PINMUX(b, 1, 0x18c, 11, periph)
/* pb1_ac_cmp0_out */
#define PB1_AC_CMP0_OUT        MCHP_PINMUX(b, 1, 0x2c8, 40, periph)
/* pb1_ac_cmptrdy_out */
#define PB1_AC_CMPTRDY_OUT     MCHP_PINMUX(b, 1, 0x2c8, 41, periph)
/* pb1_can1rx_in */
#define PB1_CAN1RX_IN          MCHP_PINMUX(b, 1, 0x190, 20, periph)
/* pb1_cclin0_in */
#define PB1_CCLIN0_IN          MCHP_PINMUX(b, 1, 0xb4, 11, periph)
/* pb1_cclin1_in */
#define PB1_CCLIN1_IN          MCHP_PINMUX(b, 1, 0xb8, 4, periph)
/* pb1_cclin2_in */
#define PB1_CCLIN2_IN          MCHP_PINMUX(b, 1, 0xbc, 20, periph)
/* pb1_cclin3_in */
#define PB1_CCLIN3_IN          MCHP_PINMUX(b, 1, 0xc0, 11, periph)
/* pb1_cclin4_in */
#define PB1_CCLIN4_IN          MCHP_PINMUX(b, 1, 0xc4, 4, periph)
/* pb1_cclin5_in */
#define PB1_CCLIN5_IN          MCHP_PINMUX(b, 1, 0xc8, 20, periph)
/* pb1_cclo0_out */
#define PB1_CCLO0_OUT          MCHP_PINMUX(b, 1, 0x2c8, 1, periph)
/* pb1_cclo1_out */
#define PB1_CCLO1_OUT          MCHP_PINMUX(b, 1, 0x2c4, 1, periph)
/* pb1_coex_bt_state_out */
#define PB1_COEX_BT_STATE_OUT  MCHP_PINMUX(b, 1, 0x2c0, 37, periph)
/* pb1_coex_rf_act_out */
#define PB1_COEX_RF_ACT_OUT    MCHP_PINMUX(b, 1, 0x2c4, 41, periph)
/* pb1_extint0_in */
#define PB1_EXTINT0_IN         MCHP_PINMUX(b, 1, 0x0, 11, periph)
/* pb1_extint1_in */
#define PB1_EXTINT1_IN         MCHP_PINMUX(b, 1, 0x4, 4, periph)
/* pb1_extint2_in */
#define PB1_EXTINT2_IN         MCHP_PINMUX(b, 1, 0x8, 20, periph)
/* pb1_fectrl0_out */
#define PB1_FECTRL0_OUT        MCHP_PINMUX(b, 1, 0x2c4, 40, periph)
/* pb1_fectrl1_out */
#define PB1_FECTRL1_OUT        MCHP_PINMUX(b, 1, 0x2c0, 35, periph)
/* pb1_fectrl2_out */
#define PB1_FECTRL2_OUT        MCHP_PINMUX(b, 1, 0x2c0, 36, periph)
/* pb1_fectrl4_out */
#define PB1_FECTRL4_OUT        MCHP_PINMUX(b, 1, 0x2c8, 42, periph)
/* pb1_qd0_out */
#define PB1_QD0_OUT            MCHP_PINMUX(b, 1, 0x2c4, 35, periph)
/* pb1_qd1_in */
#define PB1_QD1_IN             MCHP_PINMUX(b, 1, 0xa4, 11, periph)
/* pb1_qd1_out */
#define PB1_QD1_OUT            MCHP_PINMUX(b, 1, 0x2c0, 30, periph)
/* pb1_qd2_in */
#define PB1_QD2_IN             MCHP_PINMUX(b, 1, 0xa8, 4, periph)
/* pb1_qd2_out */
#define PB1_QD2_OUT            MCHP_PINMUX(b, 1, 0x2c0, 29, periph)
/* pb1_qd3_in */
#define PB1_QD3_IN             MCHP_PINMUX(b, 1, 0xac, 20, periph)
/* pb1_qd3_out */
#define PB1_QD3_OUT            MCHP_PINMUX(b, 1, 0x2c0, 28, periph)
/* pb1_qeiccmp0_out */
#define PB1_QEICCMP0_OUT       MCHP_PINMUX(b, 1, 0x2c0, 31, periph)
/* pb1_qeihome0g1_in */
#define PB1_QEIHOME0G1_IN      MCHP_PINMUX(b, 1, 0x16c, 11, periph)
/* pb1_qeihome0g2_in */
#define PB1_QEIHOME0G2_IN      MCHP_PINMUX(b, 1, 0x170, 4, periph)
/* pb1_qeiindx0g2_in */
#define PB1_QEIINDX0G2_IN      MCHP_PINMUX(b, 1, 0x174, 4, periph)
/* pb1_qeiindx0g3_in */
#define PB1_QEIINDX0G3_IN      MCHP_PINMUX(b, 1, 0x178, 20, periph)
/* pb1_qeiqea0g3_in */
#define PB1_QEIQEA0G3_IN       MCHP_PINMUX(b, 1, 0x17c, 20, periph)
/* pb1_qspics_out */
#define PB1_QSPICS_OUT         MCHP_PINMUX(b, 1, 0x2c0, 27, periph)
/* pb1_scom0p0_in */
#define PB1_SCOM0P0_IN         MCHP_PINMUX(b, 1, 0x40, 4, periph)
/* pb1_scom0p0_out */
#define PB1_SCOM0P0_OUT        MCHP_PINMUX(b, 1, 0x2c4, 2, periph)
/* pb1_scom0p2_out */
#define PB1_SCOM0P2_OUT        MCHP_PINMUX(b, 1, 0x2c0, 2, periph)
/* pb1_scom0p3_in */
#define PB1_SCOM0P3_IN         MCHP_PINMUX(b, 1, 0x4c, 11, periph)
/* pb1_scom0p3_out */
#define PB1_SCOM0P3_OUT        MCHP_PINMUX(b, 1, 0x2c0, 1, periph)
/* pb1_scom1p0_in */
#define PB1_SCOM1P0_IN         MCHP_PINMUX(b, 1, 0x50, 20, periph)
/* pb1_scom1p0_out */
#define PB1_SCOM1P0_OUT        MCHP_PINMUX(b, 1, 0x2c0, 3, periph)
/* pb1_scom1p2_in */
#define PB1_SCOM1P2_IN         MCHP_PINMUX(b, 1, 0x58, 11, periph)
/* pb1_scom1p2_out */
#define PB1_SCOM1P2_OUT        MCHP_PINMUX(b, 1, 0x2c0, 4, periph)
/* pb1_scom1p3_in */
#define PB1_SCOM1P3_IN         MCHP_PINMUX(b, 1, 0x5c, 4, periph)
/* pb1_scom1p3_out */
#define PB1_SCOM1P3_OUT        MCHP_PINMUX(b, 1, 0x2c4, 5, periph)
/* pb1_scom2p0_in */
#define PB1_SCOM2P0_IN         MCHP_PINMUX(b, 1, 0x60, 4, periph)
/* pb1_scom2p0_out */
#define PB1_SCOM2P0_OUT        MCHP_PINMUX(b, 1, 0x2c4, 7, periph)
/* pb1_scom2p2_out */
#define PB1_SCOM2P2_OUT        MCHP_PINMUX(b, 1, 0x2c0, 6, periph)
/* pb1_scom2p3_in */
#define PB1_SCOM2P3_IN         MCHP_PINMUX(b, 1, 0x6c, 11, periph)
/* pb1_scom2p3_out */
#define PB1_SCOM2P3_OUT        MCHP_PINMUX(b, 1, 0x2c0, 5, periph)
/* pb1_scom3p0_in */
#define PB1_SCOM3P0_IN         MCHP_PINMUX(b, 1, 0x70, 20, periph)
/* pb1_scom3p0_out */
#define PB1_SCOM3P0_OUT        MCHP_PINMUX(b, 1, 0x2c0, 7, periph)
/* pb1_scom3p2_in */
#define PB1_SCOM3P2_IN         MCHP_PINMUX(b, 1, 0x78, 11, periph)
/* pb1_scom3p2_out */
#define PB1_SCOM3P2_OUT        MCHP_PINMUX(b, 1, 0x2c0, 8, periph)
/* pb1_scom3p3_in */
#define PB1_SCOM3P3_IN         MCHP_PINMUX(b, 1, 0x7c, 4, periph)
/* pb1_scom3p3_out */
#define PB1_SCOM3P3_OUT        MCHP_PINMUX(b, 1, 0x2c4, 10, periph)
/* pb1_tc0wo0g1_in */
#define PB1_TC0WO0G1_IN        MCHP_PINMUX(b, 1, 0xcc, 11, periph)
/* pb1_tc0wo0g2_in */
#define PB1_TC0WO0G2_IN        MCHP_PINMUX(b, 1, 0xd0, 4, periph)
/* pb1_tc0wo0_out */
#define PB1_TC0WO0_OUT         MCHP_PINMUX(b, 1, 0x2c8, 24, periph)
/* pb1_tc0wo1g3_in */
#define PB1_TC0WO1G3_IN        MCHP_PINMUX(b, 1, 0xd4, 20, periph)
/* pb1_tc0wo1_out */
#define PB1_TC0WO1_OUT         MCHP_PINMUX(b, 1, 0x2c0, 18, periph)
/* pb1_tc1wo0g1_in */
#define PB1_TC1WO0G1_IN        MCHP_PINMUX(b, 1, 0xdc, 11, periph)
/* pb1_tc1wo0_out */
#define PB1_TC1WO0_OUT         MCHP_PINMUX(b, 1, 0x2c0, 19, periph)
/* pb1_tc1wo1g2_in */
#define PB1_TC1WO1G2_IN        MCHP_PINMUX(b, 1, 0xe4, 4, periph)
/* pb1_tc1wo1_out */
#define PB1_TC1WO1_OUT         MCHP_PINMUX(b, 1, 0x2c4, 25, periph)
/* pb1_tc2wo0g1_in */
#define PB1_TC2WO0G1_IN        MCHP_PINMUX(b, 1, 0xec, 11, periph)
/* pb1_tc2wo0g3_in */
#define PB1_TC2WO0G3_IN        MCHP_PINMUX(b, 1, 0xf0, 20, periph)
/* pb1_tc2wo0_out */
#define PB1_TC2WO0_OUT         MCHP_PINMUX(b, 1, 0x2c0, 20, periph)
/* pb1_tc2wo1g2_in */
#define PB1_TC2WO1G2_IN        MCHP_PINMUX(b, 1, 0xf4, 4, periph)
/* pb1_tc2wo1_out */
#define PB1_TC2WO1_OUT         MCHP_PINMUX(b, 1, 0x2c4, 26, periph)
/* pb1_tc3wo0g1_in */
#define PB1_TC3WO0G1_IN        MCHP_PINMUX(b, 1, 0xfc, 11, periph)
/* pb1_tc3wo0g3_in */
#define PB1_TC3WO0G3_IN        MCHP_PINMUX(b, 1, 0x100, 20, periph)
/* pb1_tc3wo0_out */
#define PB1_TC3WO0_OUT         MCHP_PINMUX(b, 1, 0x2c0, 21, periph)
/* pb1_tc3wo1g2_in */
#define PB1_TC3WO1G2_IN        MCHP_PINMUX(b, 1, 0x104, 4, periph)
/* pb1_tc3wo1_out */
#define PB1_TC3WO1_OUT         MCHP_PINMUX(b, 1, 0x2c4, 27, periph)
/* pb1_tc4wo0g1_in */
#define PB1_TC4WO0G1_IN        MCHP_PINMUX(b, 1, 0x10c, 11, periph)
/* pb1_tc4wo0g3_in */
#define PB1_TC4WO0G3_IN        MCHP_PINMUX(b, 1, 0x110, 20, periph)
/* pb1_tc4wo0_out */
#define PB1_TC4WO0_OUT         MCHP_PINMUX(b, 1, 0x2c0, 22, periph)
/* pb1_tc4wo1g2_in */
#define PB1_TC4WO1G2_IN        MCHP_PINMUX(b, 1, 0x114, 4, periph)
/* pb1_tc4wo1_out */
#define PB1_TC4WO1_OUT         MCHP_PINMUX(b, 1, 0x2c4, 28, periph)
/* pb1_tc5wo0g1_in */
#define PB1_TC5WO0G1_IN        MCHP_PINMUX(b, 1, 0x11c, 11, periph)
/* pb1_tc5wo0g3_in */
#define PB1_TC5WO0G3_IN        MCHP_PINMUX(b, 1, 0x120, 20, periph)
/* pb1_tc5wo0_out */
#define PB1_TC5WO0_OUT         MCHP_PINMUX(b, 1, 0x2c0, 23, periph)
/* pb1_tc5wo1g2_in */
#define PB1_TC5WO1G2_IN        MCHP_PINMUX(b, 1, 0x124, 4, periph)
/* pb1_tc5wo1_out */
#define PB1_TC5WO1_OUT         MCHP_PINMUX(b, 1, 0x2c4, 29, periph)
/* pb1_tc6wo0g1_in */
#define PB1_TC6WO0G1_IN        MCHP_PINMUX(b, 1, 0x12c, 11, periph)
/* pb1_tc6wo0g3_in */
#define PB1_TC6WO0G3_IN        MCHP_PINMUX(b, 1, 0x130, 20, periph)
/* pb1_tc6wo0_out */
#define PB1_TC6WO0_OUT         MCHP_PINMUX(b, 1, 0x2c0, 24, periph)
/* pb1_tc6wo1g2_in */
#define PB1_TC6WO1G2_IN        MCHP_PINMUX(b, 1, 0x134, 4, periph)
/* pb1_tc6wo1_out */
#define PB1_TC6WO1_OUT         MCHP_PINMUX(b, 1, 0x2c4, 30, periph)
/* pb1_tc7wo0g1_in */
#define PB1_TC7WO0G1_IN        MCHP_PINMUX(b, 1, 0x13c, 11, periph)
/* pb1_tc7wo0g3_in */
#define PB1_TC7WO0G3_IN        MCHP_PINMUX(b, 1, 0x140, 20, periph)
/* pb1_tc7wo0_out */
#define PB1_TC7WO0_OUT         MCHP_PINMUX(b, 1, 0x2c0, 25, periph)
/* pb1_tc7wo1g2_in */
#define PB1_TC7WO1G2_IN        MCHP_PINMUX(b, 1, 0x144, 4, periph)
/* pb1_tc7wo1_out */
#define PB1_TC7WO1_OUT         MCHP_PINMUX(b, 1, 0x2c4, 31, periph)
/* pb1_tc8wo0g1_in */
#define PB1_TC8WO0G1_IN        MCHP_PINMUX(b, 1, 0x14c, 11, periph)
/* pb1_tc8wo0g3_in */
#define PB1_TC8WO0G3_IN        MCHP_PINMUX(b, 1, 0x150, 20, periph)
/* pb1_tc8wo0_out */
#define PB1_TC8WO0_OUT         MCHP_PINMUX(b, 1, 0x2c0, 26, periph)
/* pb1_tc8wo1g2_in */
#define PB1_TC8WO1G2_IN        MCHP_PINMUX(b, 1, 0x154, 4, periph)
/* pb1_tc8wo1_out */
#define PB1_TC8WO1_OUT         MCHP_PINMUX(b, 1, 0x2c4, 32, periph)
/* pb1_tc9wo0g2_in */
#define PB1_TC9WO0G2_IN        MCHP_PINMUX(b, 1, 0x15c, 4, periph)
/* pb1_tc9wo0_out */
#define PB1_TC9WO0_OUT         MCHP_PINMUX(b, 1, 0x2c4, 33, periph)
/* pb1_tc9wo1g3_in */
#define PB1_TC9WO1G3_IN        MCHP_PINMUX(b, 1, 0x164, 20, periph)
/* pb1_tc9wo1_out */
#define PB1_TC9WO1_OUT         MCHP_PINMUX(b, 1, 0x2c8, 33, periph)
/* pb1_tcc0wo0_out */
#define PB1_TCC0WO0_OUT        MCHP_PINMUX(b, 1, 0x2c0, 13, periph)
/* pb1_tcc0wo1_out */
#define PB1_TCC0WO1_OUT        MCHP_PINMUX(b, 1, 0x2c4, 17, periph)
/* pb1_tcc0wo2_out */
#define PB1_TCC0WO2_OUT        MCHP_PINMUX(b, 1, 0x2c8, 17, periph)
/* pb1_tcc0wo3_out */
#define PB1_TCC0WO3_OUT        MCHP_PINMUX(b, 1, 0x2c4, 19, periph)
/* pb1_tcc0wo4_out */
#define PB1_TCC0WO4_OUT        MCHP_PINMUX(b, 1, 0x2c0, 14, periph)
/* pb1_tcc0wo5_out */
#define PB1_TCC0WO5_OUT        MCHP_PINMUX(b, 1, 0x2c4, 18, periph)
/* pb1_tcc1wo0_out */
#define PB1_TCC1WO0_OUT        MCHP_PINMUX(b, 1, 0x2c0, 15, periph)
/* pb1_tcc1wo1_out */
#define PB1_TCC1WO1_OUT        MCHP_PINMUX(b, 1, 0x2c4, 20, periph)
/* pb1_tcc1wo2_out */
#define PB1_TCC1WO2_OUT        MCHP_PINMUX(b, 1, 0x2c8, 20, periph)
/* pb1_tcc1wo3_out */
#define PB1_TCC1WO3_OUT        MCHP_PINMUX(b, 1, 0x2c4, 22, periph)
/* pb1_tcc1wo4_out */
#define PB1_TCC1WO4_OUT        MCHP_PINMUX(b, 1, 0x2c0, 16, periph)
/* pb1_tcc1wo5_out */
#define PB1_TCC1WO5_OUT        MCHP_PINMUX(b, 1, 0x2c4, 21, periph)
/* pb1_tcc2wo0_out */
#define PB1_TCC2WO0_OUT        MCHP_PINMUX(b, 1, 0x2c0, 17, periph)
/* pb1_tcc2wo1_out */
#define PB1_TCC2WO1_OUT        MCHP_PINMUX(b, 1, 0x2c4, 23, periph)
/* pb1_tstbus0_out */
#define PB1_TSTBUS0_OUT        MCHP_PINMUX(b, 1, 0x2c0, 32, periph)
/* pb1_tstbus1_out */
#define PB1_TSTBUS1_OUT        MCHP_PINMUX(b, 1, 0x2c8, 38, periph)
/* pb1_tstbus4_out */
#define PB1_TSTBUS4_OUT        MCHP_PINMUX(b, 1, 0x2c0, 33, periph)
/* pb1_tstbus5_out */
#define PB1_TSTBUS5_OUT        MCHP_PINMUX(b, 1, 0x2c4, 38, periph)
/* pb1_tstbus8_out */
#define PB1_TSTBUS8_OUT        MCHP_PINMUX(b, 1, 0x2c0, 34, periph)
/* pb1_tstbus9_out */
#define PB1_TSTBUS9_OUT        MCHP_PINMUX(b, 1, 0x2c4, 39, periph)
/* pb1_tstbus10_out */
#define PB1_TSTBUS10_OUT       MCHP_PINMUX(b, 1, 0x2c8, 39, periph)
/* pb2_ac_cmp0_out */
#define PB2_AC_CMP0_OUT        MCHP_PINMUX(b, 2, 0x2d0, 40, periph)
/* pb2_ac_cmp1_out */
#define PB2_AC_CMP1_OUT        MCHP_PINMUX(b, 2, 0x2d4, 36, periph)
/* pb2_ac_cmptout_out */
#define PB2_AC_CMPTOUT_OUT     MCHP_PINMUX(b, 2, 0x2d4, 37, periph)
/* pb2_ac_cmptrdy_out */
#define PB2_AC_CMPTRDY_OUT     MCHP_PINMUX(b, 2, 0x2d0, 41, periph)
/* pb2_can1rx_in */
#define PB2_CAN1RX_IN          MCHP_PINMUX(b, 2, 0x190, 4, periph)
/* pb2_can1_tx_out */
#define PB2_CAN1_TX_OUT        MCHP_PINMUX(b, 2, 0x2d4, 38, periph)
/* pb2_cclin1_in */
#define PB2_CCLIN1_IN          MCHP_PINMUX(b, 2, 0xb8, 11, periph)
/* pb2_cclin2_in */
#define PB2_CCLIN2_IN          MCHP_PINMUX(b, 2, 0xbc, 4, periph)
/* pb2_cclin4_in */
#define PB2_CCLIN4_IN          MCHP_PINMUX(b, 2, 0xc4, 11, periph)
/* pb2_cclin5_in */
#define PB2_CCLIN5_IN          MCHP_PINMUX(b, 2, 0xc8, 4, periph)
/* pb2_cclo0_out */
#define PB2_CCLO0_OUT          MCHP_PINMUX(b, 2, 0x2d0, 1, periph)
/* pb2_cclo1_out */
#define PB2_CCLO1_OUT          MCHP_PINMUX(b, 2, 0x2cc, 1, periph)
/* pb2_coexwlanact_in */
#define PB2_COEXWLANACT_IN     MCHP_PINMUX(b, 2, 0x194, 20, periph)
/* pb2_coex_rf_act_out */
#define PB2_COEX_RF_ACT_OUT    MCHP_PINMUX(b, 2, 0x2cc, 41, periph)
/* pb2_extint1_in */
#define PB2_EXTINT1_IN         MCHP_PINMUX(b, 2, 0x4, 11, periph)
/* pb2_extint2_in */
#define PB2_EXTINT2_IN         MCHP_PINMUX(b, 2, 0x8, 4, periph)
/* pb2_extint3_in */
#define PB2_EXTINT3_IN         MCHP_PINMUX(b, 2, 0xc, 20, periph)
/* pb2_fectrl0_out */
#define PB2_FECTRL0_OUT        MCHP_PINMUX(b, 2, 0x2cc, 40, periph)
/* pb2_fectrl3_out */
#define PB2_FECTRL3_OUT        MCHP_PINMUX(b, 2, 0x2d4, 39, periph)
/* pb2_fectrl4_out */
#define PB2_FECTRL4_OUT        MCHP_PINMUX(b, 2, 0x2d0, 42, periph)
/* pb2_fectrl5_out */
#define PB2_FECTRL5_OUT        MCHP_PINMUX(b, 2, 0x2d4, 40, periph)
/* pb2_nmi_in */
#define PB2_NMI_IN             MCHP_PINMUX(b, 2, 0x3c, 20, periph)
/* pb2_qd0_in */
#define PB2_QD0_IN             MCHP_PINMUX(b, 2, 0xa0, 20, periph)
/* pb2_qd0_out */
#define PB2_QD0_OUT            MCHP_PINMUX(b, 2, 0x2cc, 35, periph)
/* pb2_qd1_out */
#define PB2_QD1_OUT            MCHP_PINMUX(b, 2, 0x2d0, 35, periph)
/* pb2_qd2_in */
#define PB2_QD2_IN             MCHP_PINMUX(b, 2, 0xa8, 11, periph)
/* pb2_qd2_out */
#define PB2_QD2_OUT            MCHP_PINMUX(b, 2, 0x2cc, 37, periph)
/* pb2_qd3_in */
#define PB2_QD3_IN             MCHP_PINMUX(b, 2, 0xac, 4, periph)
/* pb2_qd3_out */
#define PB2_QD3_OUT            MCHP_PINMUX(b, 2, 0x2cc, 36, periph)
/* pb2_qeihome0g2_in */
#define PB2_QEIHOME0G2_IN      MCHP_PINMUX(b, 2, 0x170, 11, periph)
