zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz66/pic32cx2051bz66048-pinctrl.h
/* pb2_qeiindx0g2_in */
#define PB2_QEIINDX0G2_IN      MCHP_PINMUX(b, 2, 0x174, 11, periph)
/* pb2_qeiindx0g3_in */
#define PB2_QEIINDX0G3_IN      MCHP_PINMUX(b, 2, 0x178, 4, periph)
/* pb2_qeiqea0g3_in */
#define PB2_QEIQEA0G3_IN       MCHP_PINMUX(b, 2, 0x17c, 4, periph)
/* pb2_qeiqea0g4_in */
#define PB2_QEIQEA0G4_IN       MCHP_PINMUX(b, 2, 0x180, 20, periph)
/* pb2_qeiqeb0g4_in */
#define PB2_QEIQEB0G4_IN       MCHP_PINMUX(b, 2, 0x184, 20, periph)
/* pb2_qspics_out */
#define PB2_QSPICS_OUT         MCHP_PINMUX(b, 2, 0x2cc, 34, periph)
/* pb2_scom0p0_in */
#define PB2_SCOM0P0_IN         MCHP_PINMUX(b, 2, 0x40, 11, periph)
/* pb2_scom0p0_out */
#define PB2_SCOM0P0_OUT        MCHP_PINMUX(b, 2, 0x2cc, 2, periph)
/* pb2_scom0p2_in */
#define PB2_SCOM0P2_IN         MCHP_PINMUX(b, 2, 0x48, 20, periph)
/* pb2_scom0p2_out */
#define PB2_SCOM0P2_OUT        MCHP_PINMUX(b, 2, 0x2cc, 4, periph)
/* pb2_scom0p3_out */
#define PB2_SCOM0P3_OUT        MCHP_PINMUX(b, 2, 0x2cc, 3, periph)
/* pb2_scom1p0_in */
#define PB2_SCOM1P0_IN         MCHP_PINMUX(b, 2, 0x50, 4, periph)
/* pb2_scom1p0_out */
#define PB2_SCOM1P0_OUT        MCHP_PINMUX(b, 2, 0x2d0, 5, periph)
/* pb2_scom1p2_out */
#define PB2_SCOM1P2_OUT        MCHP_PINMUX(b, 2, 0x2cc, 6, periph)
/* pb2_scom1p3_in */
#define PB2_SCOM1P3_IN         MCHP_PINMUX(b, 2, 0x5c, 11, periph)
/* pb2_scom1p3_out */
#define PB2_SCOM1P3_OUT        MCHP_PINMUX(b, 2, 0x2cc, 5, periph)
/* pb2_scom2p0_in */
#define PB2_SCOM2P0_IN         MCHP_PINMUX(b, 2, 0x60, 11, periph)
/* pb2_scom2p0_out */
#define PB2_SCOM2P0_OUT        MCHP_PINMUX(b, 2, 0x2cc, 7, periph)
/* pb2_scom2p2_in */
#define PB2_SCOM2P2_IN         MCHP_PINMUX(b, 2, 0x68, 20, periph)
/* pb2_scom2p2_out */
#define PB2_SCOM2P2_OUT        MCHP_PINMUX(b, 2, 0x2cc, 9, periph)
/* pb2_scom2p3_out */
#define PB2_SCOM2P3_OUT        MCHP_PINMUX(b, 2, 0x2cc, 8, periph)
/* pb2_scom3p0_in */
#define PB2_SCOM3P0_IN         MCHP_PINMUX(b, 2, 0x70, 4, periph)
/* pb2_scom3p0_out */
#define PB2_SCOM3P0_OUT        MCHP_PINMUX(b, 2, 0x2d0, 10, periph)
/* pb2_scom3p2_out */
#define PB2_SCOM3P2_OUT        MCHP_PINMUX(b, 2, 0x2cc, 11, periph)
/* pb2_scom3p3_in */
#define PB2_SCOM3P3_IN         MCHP_PINMUX(b, 2, 0x7c, 11, periph)
/* pb2_scom3p3_out */
#define PB2_SCOM3P3_OUT        MCHP_PINMUX(b, 2, 0x2cc, 10, periph)
/* pb2_tc0wo0g2_in */
#define PB2_TC0WO0G2_IN        MCHP_PINMUX(b, 2, 0xd0, 11, periph)
/* pb2_tc0wo0_out */
#define PB2_TC0WO0_OUT         MCHP_PINMUX(b, 2, 0x2d0, 24, periph)
/* pb2_tc0wo1g3_in */
#define PB2_TC0WO1G3_IN        MCHP_PINMUX(b, 2, 0xd4, 4, periph)
/* pb2_tc0wo1g4_in */
#define PB2_TC0WO1G4_IN        MCHP_PINMUX(b, 2, 0xd8, 20, periph)
/* pb2_tc0wo1_out */
#define PB2_TC0WO1_OUT         MCHP_PINMUX(b, 2, 0x2cc, 24, periph)
/* pb2_tc1wo0_out */
#define PB2_TC1WO0_OUT         MCHP_PINMUX(b, 2, 0x2d0, 25, periph)
/* pb2_tc1wo1g2_in */
#define PB2_TC1WO1G2_IN        MCHP_PINMUX(b, 2, 0xe4, 11, periph)
/* pb2_tc1wo1_out */
#define PB2_TC1WO1_OUT         MCHP_PINMUX(b, 2, 0x2cc, 25, periph)
/* pb2_tc2wo0g3_in */
#define PB2_TC2WO0G3_IN        MCHP_PINMUX(b, 2, 0xf0, 4, periph)
/* pb2_tc2wo0_out */
#define PB2_TC2WO0_OUT         MCHP_PINMUX(b, 2, 0x2d0, 26, periph)
/* pb2_tc2wo1g2_in */
#define PB2_TC2WO1G2_IN        MCHP_PINMUX(b, 2, 0xf4, 11, periph)
/* pb2_tc2wo1g4_in */
#define PB2_TC2WO1G4_IN        MCHP_PINMUX(b, 2, 0xf8, 20, periph)
/* pb2_tc2wo1_out */
#define PB2_TC2WO1_OUT         MCHP_PINMUX(b, 2, 0x2cc, 26, periph)
/* pb2_tc3wo0g3_in */
#define PB2_TC3WO0G3_IN        MCHP_PINMUX(b, 2, 0x100, 4, periph)
/* pb2_tc3wo0_out */
#define PB2_TC3WO0_OUT         MCHP_PINMUX(b, 2, 0x2d0, 27, periph)
/* pb2_tc3wo1g2_in */
#define PB2_TC3WO1G2_IN        MCHP_PINMUX(b, 2, 0x104, 11, periph)
/* pb2_tc3wo1g4_in */
#define PB2_TC3WO1G4_IN        MCHP_PINMUX(b, 2, 0x108, 20, periph)
/* pb2_tc3wo1_out */
#define PB2_TC3WO1_OUT         MCHP_PINMUX(b, 2, 0x2cc, 27, periph)
/* pb2_tc4wo0g3_in */
#define PB2_TC4WO0G3_IN        MCHP_PINMUX(b, 2, 0x110, 4, periph)
/* pb2_tc4wo0_out */
#define PB2_TC4WO0_OUT         MCHP_PINMUX(b, 2, 0x2d0, 28, periph)
/* pb2_tc4wo1g2_in */
#define PB2_TC4WO1G2_IN        MCHP_PINMUX(b, 2, 0x114, 11, periph)
/* pb2_tc4wo1g4_in */
#define PB2_TC4WO1G4_IN        MCHP_PINMUX(b, 2, 0x118, 20, periph)
/* pb2_tc4wo1_out */
#define PB2_TC4WO1_OUT         MCHP_PINMUX(b, 2, 0x2cc, 28, periph)
/* pb2_tc5wo0g3_in */
#define PB2_TC5WO0G3_IN        MCHP_PINMUX(b, 2, 0x120, 4, periph)
/* pb2_tc5wo0_out */
#define PB2_TC5WO0_OUT         MCHP_PINMUX(b, 2, 0x2d0, 29, periph)
/* pb2_tc5wo1g2_in */
#define PB2_TC5WO1G2_IN        MCHP_PINMUX(b, 2, 0x124, 11, periph)
/* pb2_tc5wo1g4_in */
#define PB2_TC5WO1G4_IN        MCHP_PINMUX(b, 2, 0x128, 20, periph)
/* pb2_tc5wo1_out */
#define PB2_TC5WO1_OUT         MCHP_PINMUX(b, 2, 0x2cc, 29, periph)
/* pb2_tc6wo0g3_in */
#define PB2_TC6WO0G3_IN        MCHP_PINMUX(b, 2, 0x130, 4, periph)
/* pb2_tc6wo0_out */
#define PB2_TC6WO0_OUT         MCHP_PINMUX(b, 2, 0x2d0, 30, periph)
/* pb2_tc6wo1g2_in */
#define PB2_TC6WO1G2_IN        MCHP_PINMUX(b, 2, 0x134, 11, periph)
/* pb2_tc6wo1g4_in */
#define PB2_TC6WO1G4_IN        MCHP_PINMUX(b, 2, 0x138, 20, periph)
/* pb2_tc6wo1_out */
#define PB2_TC6WO1_OUT         MCHP_PINMUX(b, 2, 0x2cc, 30, periph)
/* pb2_tc7wo0g3_in */
#define PB2_TC7WO0G3_IN        MCHP_PINMUX(b, 2, 0x140, 4, periph)
/* pb2_tc7wo0_out */
#define PB2_TC7WO0_OUT         MCHP_PINMUX(b, 2, 0x2d0, 31, periph)
/* pb2_tc7wo1g2_in */
#define PB2_TC7WO1G2_IN        MCHP_PINMUX(b, 2, 0x144, 11, periph)
/* pb2_tc7wo1g4_in */
#define PB2_TC7WO1G4_IN        MCHP_PINMUX(b, 2, 0x148, 20, periph)
/* pb2_tc7wo1_out */
#define PB2_TC7WO1_OUT         MCHP_PINMUX(b, 2, 0x2cc, 31, periph)
/* pb2_tc8wo0g3_in */
#define PB2_TC8WO0G3_IN        MCHP_PINMUX(b, 2, 0x150, 4, periph)
/* pb2_tc8wo0_out */
#define PB2_TC8WO0_OUT         MCHP_PINMUX(b, 2, 0x2d0, 32, periph)
/* pb2_tc8wo1g2_in */
#define PB2_TC8WO1G2_IN        MCHP_PINMUX(b, 2, 0x154, 11, periph)
/* pb2_tc8wo1_out */
#define PB2_TC8WO1_OUT         MCHP_PINMUX(b, 2, 0x2cc, 32, periph)
/* pb2_tc9wo0g2_in */
#define PB2_TC9WO0G2_IN        MCHP_PINMUX(b, 2, 0x15c, 11, periph)
/* pb2_tc9wo0g4_in */
#define PB2_TC9WO0G4_IN        MCHP_PINMUX(b, 2, 0x160, 20, periph)
/* pb2_tc9wo0_out */
#define PB2_TC9WO0_OUT         MCHP_PINMUX(b, 2, 0x2cc, 33, periph)
/* pb2_tc9wo1g3_in */
#define PB2_TC9WO1G3_IN        MCHP_PINMUX(b, 2, 0x164, 4, periph)
/* pb2_tc9wo1_out */
#define PB2_TC9WO1_OUT         MCHP_PINMUX(b, 2, 0x2d0, 33, periph)
/* pb2_tcc0wo0_out */
#define PB2_TCC0WO0_OUT        MCHP_PINMUX(b, 2, 0x2d0, 18, periph)
/* pb2_tcc0wo1_out */
#define PB2_TCC0WO1_OUT        MCHP_PINMUX(b, 2, 0x2cc, 17, periph)
/* pb2_tcc0wo2_out */
#define PB2_TCC0WO2_OUT        MCHP_PINMUX(b, 2, 0x2d0, 17, periph)
/* pb2_tcc0wo3_out */
#define PB2_TCC0WO3_OUT        MCHP_PINMUX(b, 2, 0x2cc, 19, periph)
/* pb2_tcc0wo4_out */
#define PB2_TCC0WO4_OUT        MCHP_PINMUX(b, 2, 0x2d0, 19, periph)
/* pb2_tcc0wo5_out */
#define PB2_TCC0WO5_OUT        MCHP_PINMUX(b, 2, 0x2cc, 18, periph)
/* pb2_tcc1wo0_out */
#define PB2_TCC1WO0_OUT        MCHP_PINMUX(b, 2, 0x2d0, 21, periph)
/* pb2_tcc1wo1_out */
#define PB2_TCC1WO1_OUT        MCHP_PINMUX(b, 2, 0x2cc, 20, periph)
/* pb2_tcc1wo2_out */
#define PB2_TCC1WO2_OUT        MCHP_PINMUX(b, 2, 0x2d0, 20, periph)
/* pb2_tcc1wo3_out */
#define PB2_TCC1WO3_OUT        MCHP_PINMUX(b, 2, 0x2cc, 22, periph)
/* pb2_tcc1wo4_out */
#define PB2_TCC1WO4_OUT        MCHP_PINMUX(b, 2, 0x2d0, 22, periph)
/* pb2_tcc1wo5_out */
#define PB2_TCC1WO5_OUT        MCHP_PINMUX(b, 2, 0x2cc, 21, periph)
/* pb2_tcc2wo0_out */
#define PB2_TCC2WO0_OUT        MCHP_PINMUX(b, 2, 0x2d0, 23, periph)
/* pb2_tcc2wo1_out */
#define PB2_TCC2WO1_OUT        MCHP_PINMUX(b, 2, 0x2cc, 23, periph)
/* pb2_tstbus1_out */
#define PB2_TSTBUS1_OUT        MCHP_PINMUX(b, 2, 0x2d0, 38, periph)
/* pb2_tstbus2_out */
#define PB2_TSTBUS2_OUT        MCHP_PINMUX(b, 2, 0x2d4, 34, periph)
/* pb2_tstbus5_out */
#define PB2_TSTBUS5_OUT        MCHP_PINMUX(b, 2, 0x2cc, 38, periph)
/* pb2_tstbus6_out */
#define PB2_TSTBUS6_OUT        MCHP_PINMUX(b, 2, 0x2d4, 35, periph)
/* pb2_tstbus9_out */
#define PB2_TSTBUS9_OUT        MCHP_PINMUX(b, 2, 0x2cc, 39, periph)
/* pb2_tstbus10_out */
#define PB2_TSTBUS10_OUT       MCHP_PINMUX(b, 2, 0x2d0, 39, periph)
/* pb3_accmpten_in */
#define PB3_ACCMPTEN_IN        MCHP_PINMUX(b, 3, 0x18c, 23, periph)
/* pb3_ac_cmp0_out */
#define PB3_AC_CMP0_OUT        MCHP_PINMUX(b, 3, 0x2dc, 40, periph)
/* pb3_ac_cmp1_out */
#define PB3_AC_CMP1_OUT        MCHP_PINMUX(b, 3, 0x2e0, 36, periph)
/* pb3_ac_cmptout_out */
#define PB3_AC_CMPTOUT_OUT     MCHP_PINMUX(b, 3, 0x2e0, 37, periph)
/* pb3_ac_cmptrdy_out */
#define PB3_AC_CMPTRDY_OUT     MCHP_PINMUX(b, 3, 0x2dc, 41, periph)
/* pb3_can1rx_in */
#define PB3_CAN1RX_IN          MCHP_PINMUX(b, 3, 0x190, 11, periph)
/* pb3_can1_tx_out */
#define PB3_CAN1_TX_OUT        MCHP_PINMUX(b, 3, 0x2e0, 38, periph)
/* pb3_cclin0_in */
#define PB3_CCLIN0_IN          MCHP_PINMUX(b, 3, 0xb4, 23, periph)
/* pb3_cclin2_in */
#define PB3_CCLIN2_IN          MCHP_PINMUX(b, 3, 0xbc, 11, periph)
/* pb3_cclin3_in */
#define PB3_CCLIN3_IN          MCHP_PINMUX(b, 3, 0xc0, 23, periph)
/* pb3_cclin5_in */
#define PB3_CCLIN5_IN          MCHP_PINMUX(b, 3, 0xc8, 11, periph)
/* pb3_cclo0_out */
#define PB3_CCLO0_OUT          MCHP_PINMUX(b, 3, 0x2dc, 1, periph)
/* pb3_cclo1_out */
#define PB3_CCLO1_OUT          MCHP_PINMUX(b, 3, 0x2e0, 1, periph)
/* pb3_coexwlanact_in */
#define PB3_COEXWLANACT_IN     MCHP_PINMUX(b, 3, 0x194, 4, periph)
/* pb3_coex_bt_state_out */
#define PB3_COEX_BT_STATE_OUT  MCHP_PINMUX(b, 3, 0x2d8, 37, periph)
/* pb3_extint0_in */
#define PB3_EXTINT0_IN         MCHP_PINMUX(b, 3, 0x0, 23, periph)
/* pb3_extint2_in */
#define PB3_EXTINT2_IN         MCHP_PINMUX(b, 3, 0x8, 11, periph)
/* pb3_extint3_in */
#define PB3_EXTINT3_IN         MCHP_PINMUX(b, 3, 0xc, 4, periph)
/* pb3_fectrl1_out */
#define PB3_FECTRL1_OUT        MCHP_PINMUX(b, 3, 0x2d8, 35, periph)
/* pb3_fectrl2_out */
#define PB3_FECTRL2_OUT        MCHP_PINMUX(b, 3, 0x2d8, 36, periph)
/* pb3_fectrl3_out */
#define PB3_FECTRL3_OUT        MCHP_PINMUX(b, 3, 0x2e0, 39, periph)
/* pb3_fectrl4_out */
#define PB3_FECTRL4_OUT        MCHP_PINMUX(b, 3, 0x2dc, 42, periph)
/* pb3_fectrl5_out */
#define PB3_FECTRL5_OUT        MCHP_PINMUX(b, 3, 0x2e0, 40, periph)
/* pb3_nmi_in */
#define PB3_NMI_IN             MCHP_PINMUX(b, 3, 0x3c, 4, periph)
/* pb3_qd0_in */
#define PB3_QD0_IN             MCHP_PINMUX(b, 3, 0xa0, 4, periph)
/* pb3_qd0_out */
#define PB3_QD0_OUT            MCHP_PINMUX(b, 3, 0x2dc, 36, periph)
/* pb3_qd1_in */
#define PB3_QD1_IN             MCHP_PINMUX(b, 3, 0xa4, 23, periph)
/* pb3_qd1_out */
#define PB3_QD1_OUT            MCHP_PINMUX(b, 3, 0x2d8, 30, periph)
/* pb3_qd2_out */
#define PB3_QD2_OUT            MCHP_PINMUX(b, 3, 0x2d8, 29, periph)
/* pb3_qd3_in */
#define PB3_QD3_IN             MCHP_PINMUX(b, 3, 0xac, 11, periph)
/* pb3_qd3_out */
#define PB3_QD3_OUT            MCHP_PINMUX(b, 3, 0x2d8, 28, periph)
/* pb3_qeiccmp0_out */
#define PB3_QEICCMP0_OUT       MCHP_PINMUX(b, 3, 0x2d8, 31, periph)
/* pb3_qeihome0g1_in */
#define PB3_QEIHOME0G1_IN      MCHP_PINMUX(b, 3, 0x16c, 23, periph)
/* pb3_qeiindx0g3_in */
#define PB3_QEIINDX0G3_IN      MCHP_PINMUX(b, 3, 0x178, 11, periph)
/* pb3_qeiqea0g3_in */
#define PB3_QEIQEA0G3_IN       MCHP_PINMUX(b, 3, 0x17c, 11, periph)
/* pb3_qeiqea0g4_in */
#define PB3_QEIQEA0G4_IN       MCHP_PINMUX(b, 3, 0x180, 4, periph)
/* pb3_qeiqeb0g4_in */
#define PB3_QEIQEB0G4_IN       MCHP_PINMUX(b, 3, 0x184, 4, periph)
/* pb3_qspics_out */
#define PB3_QSPICS_OUT         MCHP_PINMUX(b, 3, 0x2d8, 27, periph)
/* pb3_scom0p0_out */
#define PB3_SCOM0P0_OUT        MCHP_PINMUX(b, 3, 0x2dc, 2, periph)
/* pb3_scom0p2_in */
#define PB3_SCOM0P2_IN         MCHP_PINMUX(b, 3, 0x48, 4, periph)
/* pb3_scom0p2_out */
#define PB3_SCOM0P2_OUT        MCHP_PINMUX(b, 3, 0x2d8, 2, periph)
/* pb3_scom0p3_in */
#define PB3_SCOM0P3_IN         MCHP_PINMUX(b, 3, 0x4c, 23, periph)
/* pb3_scom0p3_out */
#define PB3_SCOM0P3_OUT        MCHP_PINMUX(b, 3, 0x2d8, 1, periph)
/* pb3_scom1p0_in */
#define PB3_SCOM1P0_IN         MCHP_PINMUX(b, 3, 0x50, 11, periph)
/* pb3_scom1p0_out */
#define PB3_SCOM1P0_OUT        MCHP_PINMUX(b, 3, 0x2d8, 3, periph)
/* pb3_scom1p2_in */
#define PB3_SCOM1P2_IN         MCHP_PINMUX(b, 3, 0x58, 23, periph)
/* pb3_scom1p2_out */
#define PB3_SCOM1P2_OUT        MCHP_PINMUX(b, 3, 0x2d8, 4, periph)
/* pb3_scom1p3_out */
#define PB3_SCOM1P3_OUT        MCHP_PINMUX(b, 3, 0x2dc, 6, periph)
/* pb3_scom2p0_out */
#define PB3_SCOM2P0_OUT        MCHP_PINMUX(b, 3, 0x2dc, 7, periph)
/* pb3_scom2p2_in */
#define PB3_SCOM2P2_IN         MCHP_PINMUX(b, 3, 0x68, 4, periph)
/* pb3_scom2p2_out */
#define PB3_SCOM2P2_OUT        MCHP_PINMUX(b, 3, 0x2d8, 6, periph)
/* pb3_scom2p3_in */
#define PB3_SCOM2P3_IN         MCHP_PINMUX(b, 3, 0x6c, 23, periph)
/* pb3_scom2p3_out */
#define PB3_SCOM2P3_OUT        MCHP_PINMUX(b, 3, 0x2d8, 5, periph)
/* pb3_scom3p0_in */
#define PB3_SCOM3P0_IN         MCHP_PINMUX(b, 3, 0x70, 11, periph)
/* pb3_scom3p0_out */
#define PB3_SCOM3P0_OUT        MCHP_PINMUX(b, 3, 0x2d8, 7, periph)
/* pb3_scom3p2_in */
#define PB3_SCOM3P2_IN         MCHP_PINMUX(b, 3, 0x78, 23, periph)
/* pb3_scom3p2_out */
#define PB3_SCOM3P2_OUT        MCHP_PINMUX(b, 3, 0x2d8, 8, periph)
/* pb3_scom3p3_out */
#define PB3_SCOM3P3_OUT        MCHP_PINMUX(b, 3, 0x2dc, 11, periph)
/* pb3_tc0wo0g1_in */
#define PB3_TC0WO0G1_IN        MCHP_PINMUX(b, 3, 0xcc, 23, periph)
/* pb3_tc0wo0_out */
#define PB3_TC0WO0_OUT         MCHP_PINMUX(b, 3, 0x2dc, 24, periph)
/* pb3_tc0wo1g3_in */
#define PB3_TC0WO1G3_IN        MCHP_PINMUX(b, 3, 0xd4, 11, periph)
/* pb3_tc0wo1g4_in */
#define PB3_TC0WO1G4_IN        MCHP_PINMUX(b, 3, 0xd8, 4, periph)
/* pb3_tc0wo1_out */
#define PB3_TC0WO1_OUT         MCHP_PINMUX(b, 3, 0x2d8, 18, periph)
/* pb3_tc1wo0g1_in */
#define PB3_TC1WO0G1_IN        MCHP_PINMUX(b, 3, 0xdc, 23, periph)
/* pb3_tc1wo0_out */
#define PB3_TC1WO0_OUT         MCHP_PINMUX(b, 3, 0x2d8, 19, periph)
/* pb3_tc1wo1_out */
#define PB3_TC1WO1_OUT         MCHP_PINMUX(b, 3, 0x2e0, 22, periph)
/* pb3_tc2wo0g1_in */
#define PB3_TC2WO0G1_IN        MCHP_PINMUX(b, 3, 0xec, 23, periph)
/* pb3_tc2wo0g3_in */
#define PB3_TC2WO0G3_IN        MCHP_PINMUX(b, 3, 0xf0, 11, periph)
/* pb3_tc2wo0_out */
#define PB3_TC2WO0_OUT         MCHP_PINMUX(b, 3, 0x2d8, 20, periph)
/* pb3_tc2wo1g4_in */
#define PB3_TC2WO1G4_IN        MCHP_PINMUX(b, 3, 0xf8, 4, periph)
/* pb3_tc2wo1_out */
#define PB3_TC2WO1_OUT         MCHP_PINMUX(b, 3, 0x2e0, 23, periph)
/* pb3_tc3wo0g1_in */
#define PB3_TC3WO0G1_IN        MCHP_PINMUX(b, 3, 0xfc, 23, periph)
/* pb3_tc3wo0g3_in */
#define PB3_TC3WO0G3_IN        MCHP_PINMUX(b, 3, 0x100, 11, periph)
/* pb3_tc3wo0_out */
#define PB3_TC3WO0_OUT         MCHP_PINMUX(b, 3, 0x2d8, 21, periph)
/* pb3_tc3wo1g4_in */
#define PB3_TC3WO1G4_IN        MCHP_PINMUX(b, 3, 0x108, 4, periph)
/* pb3_tc3wo1_out */
#define PB3_TC3WO1_OUT         MCHP_PINMUX(b, 3, 0x2e0, 24, periph)
/* pb3_tc4wo0g1_in */
#define PB3_TC4WO0G1_IN        MCHP_PINMUX(b, 3, 0x10c, 23, periph)
/* pb3_tc4wo0g3_in */
#define PB3_TC4WO0G3_IN        MCHP_PINMUX(b, 3, 0x110, 11, periph)
/* pb3_tc4wo0_out */
#define PB3_TC4WO0_OUT         MCHP_PINMUX(b, 3, 0x2d8, 22, periph)
/* pb3_tc4wo1g4_in */
#define PB3_TC4WO1G4_IN        MCHP_PINMUX(b, 3, 0x118, 4, periph)
/* pb3_tc4wo1_out */
#define PB3_TC4WO1_OUT         MCHP_PINMUX(b, 3, 0x2e0, 25, periph)
/* pb3_tc5wo0g1_in */
#define PB3_TC5WO0G1_IN        MCHP_PINMUX(b, 3, 0x11c, 23, periph)
/* pb3_tc5wo0g3_in */
#define PB3_TC5WO0G3_IN        MCHP_PINMUX(b, 3, 0x120, 11, periph)
/* pb3_tc5wo0_out */
#define PB3_TC5WO0_OUT         MCHP_PINMUX(b, 3, 0x2d8, 23, periph)
/* pb3_tc5wo1g4_in */
#define PB3_TC5WO1G4_IN        MCHP_PINMUX(b, 3, 0x128, 4, periph)
/* pb3_tc5wo1_out */
#define PB3_TC5WO1_OUT         MCHP_PINMUX(b, 3, 0x2e0, 26, periph)
/* pb3_tc6wo0g1_in */
#define PB3_TC6WO0G1_IN        MCHP_PINMUX(b, 3, 0x12c, 23, periph)
/* pb3_tc6wo0g3_in */
#define PB3_TC6WO0G3_IN        MCHP_PINMUX(b, 3, 0x130, 11, periph)
/* pb3_tc6wo0_out */
#define PB3_TC6WO0_OUT         MCHP_PINMUX(b, 3, 0x2d8, 24, periph)
/* pb3_tc6wo1g4_in */
#define PB3_TC6WO1G4_IN        MCHP_PINMUX(b, 3, 0x138, 4, periph)
/* pb3_tc6wo1_out */
#define PB3_TC6WO1_OUT         MCHP_PINMUX(b, 3, 0x2e0, 27, periph)
/* pb3_tc7wo0g1_in */
#define PB3_TC7WO0G1_IN        MCHP_PINMUX(b, 3, 0x13c, 23, periph)
/* pb3_tc7wo0g3_in */
#define PB3_TC7WO0G3_IN        MCHP_PINMUX(b, 3, 0x140, 11, periph)
/* pb3_tc7wo0_out */
#define PB3_TC7WO0_OUT         MCHP_PINMUX(b, 3, 0x2d8, 25, periph)
/* pb3_tc7wo1g4_in */
#define PB3_TC7WO1G4_IN        MCHP_PINMUX(b, 3, 0x148, 4, periph)
/* pb3_tc7wo1_out */
#define PB3_TC7WO1_OUT         MCHP_PINMUX(b, 3, 0x2e0, 28, periph)
/* pb3_tc8wo0g1_in */
#define PB3_TC8WO0G1_IN        MCHP_PINMUX(b, 3, 0x14c, 23, periph)
/* pb3_tc8wo0g3_in */
#define PB3_TC8WO0G3_IN        MCHP_PINMUX(b, 3, 0x150, 11, periph)
/* pb3_tc8wo0_out */
#define PB3_TC8WO0_OUT         MCHP_PINMUX(b, 3, 0x2d8, 26, periph)
/* pb3_tc9wo0g4_in */
#define PB3_TC9WO0G4_IN        MCHP_PINMUX(b, 3, 0x160, 4, periph)
/* pb3_tc9wo0_out */
#define PB3_TC9WO0_OUT         MCHP_PINMUX(b, 3, 0x2e0, 29, periph)
/* pb3_tc9wo1g3_in */
#define PB3_TC9WO1G3_IN        MCHP_PINMUX(b, 3, 0x164, 11, periph)
/* pb3_tc9wo1_out */
#define PB3_TC9WO1_OUT         MCHP_PINMUX(b, 3, 0x2dc, 33, periph)
/* pb3_tcc0wo0_out */
#define PB3_TCC0WO0_OUT        MCHP_PINMUX(b, 3, 0x2d8, 13, periph)
/* pb3_tcc0wo1_out */
#define PB3_TCC0WO1_OUT        MCHP_PINMUX(b, 3, 0x2e0, 15, periph)
/* pb3_tcc0wo2_out */
#define PB3_TCC0WO2_OUT        MCHP_PINMUX(b, 3, 0x2dc, 17, periph)
/* pb3_tcc0wo3_out */
#define PB3_TCC0WO3_OUT        MCHP_PINMUX(b, 3, 0x2e0, 14, periph)
/* pb3_tcc0wo4_out */
#define PB3_TCC0WO4_OUT        MCHP_PINMUX(b, 3, 0x2d8, 14, periph)
/* pb3_tcc0wo5_out */
#define PB3_TCC0WO5_OUT        MCHP_PINMUX(b, 3, 0x2e0, 16, periph)
/* pb3_tcc1wo0_out */
#define PB3_TCC1WO0_OUT        MCHP_PINMUX(b, 3, 0x2d8, 15, periph)
/* pb3_tcc1wo1_out */
#define PB3_TCC1WO1_OUT        MCHP_PINMUX(b, 3, 0x2e0, 18, periph)
/* pb3_tcc1wo2_out */
#define PB3_TCC1WO2_OUT        MCHP_PINMUX(b, 3, 0x2dc, 20, periph)
/* pb3_tcc1wo3_out */
#define PB3_TCC1WO3_OUT        MCHP_PINMUX(b, 3, 0x2e0, 17, periph)
/* pb3_tcc1wo4_out */
#define PB3_TCC1WO4_OUT        MCHP_PINMUX(b, 3, 0x2d8, 16, periph)
/* pb3_tcc1wo5_out */
#define PB3_TCC1WO5_OUT        MCHP_PINMUX(b, 3, 0x2e0, 19, periph)
/* pb3_tcc2wo0_out */
#define PB3_TCC2WO0_OUT        MCHP_PINMUX(b, 3, 0x2d8, 17, periph)
/* pb3_tcc2wo1_out */
#define PB3_TCC2WO1_OUT        MCHP_PINMUX(b, 3, 0x2e0, 20, periph)
/* pb3_tstbus0_out */
#define PB3_TSTBUS0_OUT        MCHP_PINMUX(b, 3, 0x2d8, 32, periph)
/* pb3_tstbus1_out */
#define PB3_TSTBUS1_OUT        MCHP_PINMUX(b, 3, 0x2dc, 38, periph)
/* pb3_tstbus2_out */
#define PB3_TSTBUS2_OUT        MCHP_PINMUX(b, 3, 0x2e0, 34, periph)
/* pb3_tstbus4_out */
#define PB3_TSTBUS4_OUT        MCHP_PINMUX(b, 3, 0x2d8, 33, periph)
/* pb3_tstbus6_out */
#define PB3_TSTBUS6_OUT        MCHP_PINMUX(b, 3, 0x2e0, 35, periph)
/* pb3_tstbus8_out */
#define PB3_TSTBUS8_OUT        MCHP_PINMUX(b, 3, 0x2d8, 34, periph)
/* pb3_tstbus10_out */
#define PB3_TSTBUS10_OUT       MCHP_PINMUX(b, 3, 0x2dc, 39, periph)
/* pb4_accmpten_in */
#define PB4_ACCMPTEN_IN        MCHP_PINMUX(b, 4, 0x18c, 17, periph)
/* pb4_ac_cmp1_out */
#define PB4_AC_CMP1_OUT        MCHP_PINMUX(b, 4, 0x2ec, 36, periph)
/* pb4_ac_cmptout_out */
#define PB4_AC_CMPTOUT_OUT     MCHP_PINMUX(b, 4, 0x2ec, 37, periph)
/* pb4_can1_tx_out */
#define PB4_CAN1_TX_OUT        MCHP_PINMUX(b, 4, 0x2ec, 38, periph)
/* pb4_cclin0_in */
#define PB4_CCLIN0_IN          MCHP_PINMUX(b, 4, 0xb4, 17, periph)
/* pb4_cclin1_in */
#define PB4_CCLIN1_IN          MCHP_PINMUX(b, 4, 0xb8, 22, periph)
/* pb4_cclin3_in */
#define PB4_CCLIN3_IN          MCHP_PINMUX(b, 4, 0xc0, 17, periph)
/* pb4_cclin4_in */
#define PB4_CCLIN4_IN          MCHP_PINMUX(b, 4, 0xc4, 22, periph)
/* pb4_cclo0_out */
#define PB4_CCLO0_OUT          MCHP_PINMUX(b, 4, 0x2f0, 1, periph)
/* pb4_cclo1_out */
#define PB4_CCLO1_OUT          MCHP_PINMUX(b, 4, 0x2e8, 1, periph)
/* pb4_coexwlanact_in */
#define PB4_COEXWLANACT_IN     MCHP_PINMUX(b, 4, 0x194, 9, periph)
/* pb4_coex_bt_state_out */
#define PB4_COEX_BT_STATE_OUT  MCHP_PINMUX(b, 4, 0x2e4, 37, periph)
/* pb4_coex_rf_act_out */
#define PB4_COEX_RF_ACT_OUT    MCHP_PINMUX(b, 4, 0x2e8, 41, periph)
/* pb4_extint0_in */
#define PB4_EXTINT0_IN         MCHP_PINMUX(b, 4, 0x0, 17, periph)
/* pb4_extint1_in */
#define PB4_EXTINT1_IN         MCHP_PINMUX(b, 4, 0x4, 22, periph)
/* pb4_extint3_in */
#define PB4_EXTINT3_IN         MCHP_PINMUX(b, 4, 0xc, 9, periph)
/* pb4_fectrl0_out */
#define PB4_FECTRL0_OUT        MCHP_PINMUX(b, 4, 0x2e8, 40, periph)
/* pb4_fectrl1_out */
#define PB4_FECTRL1_OUT        MCHP_PINMUX(b, 4, 0x2e4, 35, periph)
/* pb4_fectrl2_out */
#define PB4_FECTRL2_OUT        MCHP_PINMUX(b, 4, 0x2e4, 36, periph)
/* pb4_fectrl3_out */
#define PB4_FECTRL3_OUT        MCHP_PINMUX(b, 4, 0x2ec, 39, periph)
/* pb4_fectrl5_out */
#define PB4_FECTRL5_OUT        MCHP_PINMUX(b, 4, 0x2ec, 40, periph)
/* pb4_nmi_in */
#define PB4_NMI_IN             MCHP_PINMUX(b, 4, 0x3c, 9, periph)
/* pb4_qd0_in */
#define PB4_QD0_IN             MCHP_PINMUX(b, 4, 0xa0, 9, periph)
/* pb4_qd0_out */
#define PB4_QD0_OUT            MCHP_PINMUX(b, 4, 0x2e8, 35, periph)
/* pb4_qd1_in */
#define PB4_QD1_IN             MCHP_PINMUX(b, 4, 0xa4, 17, periph)
/* pb4_qd1_out */
#define PB4_QD1_OUT            MCHP_PINMUX(b, 4, 0x2e4, 30, periph)
/* pb4_qd2_in */
#define PB4_QD2_IN             MCHP_PINMUX(b, 4, 0xa8, 22, periph)
/* pb4_qd2_out */
#define PB4_QD2_OUT            MCHP_PINMUX(b, 4, 0x2e4, 29, periph)
/* pb4_qd3_out */
#define PB4_QD3_OUT            MCHP_PINMUX(b, 4, 0x2e4, 28, periph)
/* pb4_qeiccmp0_out */
#define PB4_QEICCMP0_OUT       MCHP_PINMUX(b, 4, 0x2e4, 31, periph)
/* pb4_qeihome0g1_in */
#define PB4_QEIHOME0G1_IN      MCHP_PINMUX(b, 4, 0x16c, 17, periph)
/* pb4_qeihome0g2_in */
#define PB4_QEIHOME0G2_IN      MCHP_PINMUX(b, 4, 0x170, 22, periph)
/* pb4_qeiindx0g2_in */
#define PB4_QEIINDX0G2_IN      MCHP_PINMUX(b, 4, 0x174, 22, periph)
/* pb4_qeiqea0g4_in */
#define PB4_QEIQEA0G4_IN       MCHP_PINMUX(b, 4, 0x180, 9, periph)
/* pb4_qeiqeb0g4_in */
#define PB4_QEIQEB0G4_IN       MCHP_PINMUX(b, 4, 0x184, 9, periph)
/* pb4_qeiqeb0g5_in */
#define PB4_QEIQEB0G5_IN       MCHP_PINMUX(b, 4, 0x188, 3, periph)
/* pb4_qspics_out */
#define PB4_QSPICS_OUT         MCHP_PINMUX(b, 4, 0x2e4, 27, periph)
/* pb4_scom0p0_in */
#define PB4_SCOM0P0_IN         MCHP_PINMUX(b, 4, 0x40, 22, periph)
/* pb4_scom0p0_out */
#define PB4_SCOM0P0_OUT        MCHP_PINMUX(b, 4, 0x2e8, 2, periph)
/* pb4_scom0p2_in */
#define PB4_SCOM0P2_IN         MCHP_PINMUX(b, 4, 0x48, 9, periph)
/* pb4_scom0p2_out */
#define PB4_SCOM0P2_OUT        MCHP_PINMUX(b, 4, 0x2e4, 2, periph)
/* pb4_scom0p3_in */
#define PB4_SCOM0P3_IN         MCHP_PINMUX(b, 4, 0x4c, 17, periph)
/* pb4_scom0p3_out */
#define PB4_SCOM0P3_OUT        MCHP_PINMUX(b, 4, 0x2e4, 1, periph)
/* pb4_scom1p0_out */
#define PB4_SCOM1P0_OUT        MCHP_PINMUX(b, 4, 0x2e4, 3, periph)
/* pb4_scom1p2_in */
#define PB4_SCOM1P2_IN         MCHP_PINMUX(b, 4, 0x58, 17, periph)
/* pb4_scom1p2_out */
#define PB4_SCOM1P2_OUT        MCHP_PINMUX(b, 4, 0x2e4, 4, periph)
/* pb4_scom1p3_in */
#define PB4_SCOM1P3_IN         MCHP_PINMUX(b, 4, 0x5c, 22, periph)
/* pb4_scom1p3_out */
#define PB4_SCOM1P3_OUT        MCHP_PINMUX(b, 4, 0x2e8, 5, periph)
/* pb4_scom2p0_in */
#define PB4_SCOM2P0_IN         MCHP_PINMUX(b, 4, 0x60, 22, periph)
/* pb4_scom2p0_out */
#define PB4_SCOM2P0_OUT        MCHP_PINMUX(b, 4, 0x2e8, 7, periph)
/* pb4_scom2p2_in */
#define PB4_SCOM2P2_IN         MCHP_PINMUX(b, 4, 0x68, 9, periph)
/* pb4_scom2p2_out */
#define PB4_SCOM2P2_OUT        MCHP_PINMUX(b, 4, 0x2e4, 6, periph)
/* pb4_scom2p3_in */
