zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz66/pic32cx2051bz66048-pinctrl.h
#define PB8_TC3WO0G1_IN        MCHP_PINMUX(b, 8, 0xfc, 18, periph)
/* pb8_tc3wo0g3_in */
#define PB8_TC3WO0G3_IN        MCHP_PINMUX(b, 8, 0x100, 5, periph)
/* pb8_tc3wo0_out */
#define PB8_TC3WO0_OUT         MCHP_PINMUX(b, 8, 0x31c, 21, periph)
/* pb8_tc3wo1g2_in */
#define PB8_TC3WO1G2_IN        MCHP_PINMUX(b, 8, 0x104, 23, periph)
/* pb8_tc3wo1_out */
#define PB8_TC3WO1_OUT         MCHP_PINMUX(b, 8, 0x320, 27, periph)
/* pb8_tc4wo0g1_in */
#define PB8_TC4WO0G1_IN        MCHP_PINMUX(b, 8, 0x10c, 18, periph)
/* pb8_tc4wo0g3_in */
#define PB8_TC4WO0G3_IN        MCHP_PINMUX(b, 8, 0x110, 5, periph)
/* pb8_tc4wo0_out */
#define PB8_TC4WO0_OUT         MCHP_PINMUX(b, 8, 0x31c, 22, periph)
/* pb8_tc4wo1g2_in */
#define PB8_TC4WO1G2_IN        MCHP_PINMUX(b, 8, 0x114, 23, periph)
/* pb8_tc4wo1_out */
#define PB8_TC4WO1_OUT         MCHP_PINMUX(b, 8, 0x320, 28, periph)
/* pb8_tc5wo0g1_in */
#define PB8_TC5WO0G1_IN        MCHP_PINMUX(b, 8, 0x11c, 18, periph)
/* pb8_tc5wo0g3_in */
#define PB8_TC5WO0G3_IN        MCHP_PINMUX(b, 8, 0x120, 5, periph)
/* pb8_tc5wo0_out */
#define PB8_TC5WO0_OUT         MCHP_PINMUX(b, 8, 0x31c, 23, periph)
/* pb8_tc5wo1g2_in */
#define PB8_TC5WO1G2_IN        MCHP_PINMUX(b, 8, 0x124, 23, periph)
/* pb8_tc5wo1_out */
#define PB8_TC5WO1_OUT         MCHP_PINMUX(b, 8, 0x320, 29, periph)
/* pb8_tc6wo0g1_in */
#define PB8_TC6WO0G1_IN        MCHP_PINMUX(b, 8, 0x12c, 18, periph)
/* pb8_tc6wo0g3_in */
#define PB8_TC6WO0G3_IN        MCHP_PINMUX(b, 8, 0x130, 5, periph)
/* pb8_tc6wo0_out */
#define PB8_TC6WO0_OUT         MCHP_PINMUX(b, 8, 0x31c, 24, periph)
/* pb8_tc6wo1g2_in */
#define PB8_TC6WO1G2_IN        MCHP_PINMUX(b, 8, 0x134, 23, periph)
/* pb8_tc6wo1_out */
#define PB8_TC6WO1_OUT         MCHP_PINMUX(b, 8, 0x320, 30, periph)
/* pb8_tc7wo0g1_in */
#define PB8_TC7WO0G1_IN        MCHP_PINMUX(b, 8, 0x13c, 18, periph)
/* pb8_tc7wo0g3_in */
#define PB8_TC7WO0G3_IN        MCHP_PINMUX(b, 8, 0x140, 5, periph)
/* pb8_tc7wo0_out */
#define PB8_TC7WO0_OUT         MCHP_PINMUX(b, 8, 0x31c, 25, periph)
/* pb8_tc7wo1g2_in */
#define PB8_TC7WO1G2_IN        MCHP_PINMUX(b, 8, 0x144, 23, periph)
/* pb8_tc7wo1_out */
#define PB8_TC7WO1_OUT         MCHP_PINMUX(b, 8, 0x320, 31, periph)
/* pb8_tc8wo0g1_in */
#define PB8_TC8WO0G1_IN        MCHP_PINMUX(b, 8, 0x14c, 18, periph)
/* pb8_tc8wo0g3_in */
#define PB8_TC8WO0G3_IN        MCHP_PINMUX(b, 8, 0x150, 5, periph)
/* pb8_tc8wo0_out */
#define PB8_TC8WO0_OUT         MCHP_PINMUX(b, 8, 0x31c, 26, periph)
/* pb8_tc8wo1g2_in */
#define PB8_TC8WO1G2_IN        MCHP_PINMUX(b, 8, 0x154, 23, periph)
/* pb8_tc8wo1_out */
#define PB8_TC8WO1_OUT         MCHP_PINMUX(b, 8, 0x320, 32, periph)
/* pb8_tc9wo0g2_in */
#define PB8_TC9WO0G2_IN        MCHP_PINMUX(b, 8, 0x15c, 23, periph)
/* pb8_tc9wo0_out */
#define PB8_TC9WO0_OUT         MCHP_PINMUX(b, 8, 0x320, 33, periph)
/* pb8_tc9wo1g3_in */
#define PB8_TC9WO1G3_IN        MCHP_PINMUX(b, 8, 0x164, 5, periph)
/* pb8_tc9wo1_out */
#define PB8_TC9WO1_OUT         MCHP_PINMUX(b, 8, 0x324, 33, periph)
/* pb8_tcc0wo0_out */
#define PB8_TCC0WO0_OUT        MCHP_PINMUX(b, 8, 0x31c, 13, periph)
/* pb8_tcc0wo1_out */
#define PB8_TCC0WO1_OUT        MCHP_PINMUX(b, 8, 0x320, 17, periph)
/* pb8_tcc0wo2_out */
#define PB8_TCC0WO2_OUT        MCHP_PINMUX(b, 8, 0x324, 17, periph)
/* pb8_tcc0wo3_out */
#define PB8_TCC0WO3_OUT        MCHP_PINMUX(b, 8, 0x320, 19, periph)
/* pb8_tcc0wo4_out */
#define PB8_TCC0WO4_OUT        MCHP_PINMUX(b, 8, 0x31c, 14, periph)
/* pb8_tcc0wo5_out */
#define PB8_TCC0WO5_OUT        MCHP_PINMUX(b, 8, 0x320, 18, periph)
/* pb8_tcc1wo0_out */
#define PB8_TCC1WO0_OUT        MCHP_PINMUX(b, 8, 0x31c, 15, periph)
/* pb8_tcc1wo1_out */
#define PB8_TCC1WO1_OUT        MCHP_PINMUX(b, 8, 0x320, 20, periph)
/* pb8_tcc1wo2_out */
#define PB8_TCC1WO2_OUT        MCHP_PINMUX(b, 8, 0x324, 20, periph)
/* pb8_tcc1wo3_out */
#define PB8_TCC1WO3_OUT        MCHP_PINMUX(b, 8, 0x320, 22, periph)
/* pb8_tcc1wo4_out */
#define PB8_TCC1WO4_OUT        MCHP_PINMUX(b, 8, 0x31c, 16, periph)
/* pb8_tcc1wo5_out */
#define PB8_TCC1WO5_OUT        MCHP_PINMUX(b, 8, 0x320, 21, periph)
/* pb8_tcc2wo0_out */
#define PB8_TCC2WO0_OUT        MCHP_PINMUX(b, 8, 0x31c, 17, periph)
/* pb8_tcc2wo1_out */
#define PB8_TCC2WO1_OUT        MCHP_PINMUX(b, 8, 0x320, 23, periph)
/* pb8_tstbus0_out */
#define PB8_TSTBUS0_OUT        MCHP_PINMUX(b, 8, 0x31c, 32, periph)
/* pb8_tstbus1_out */
#define PB8_TSTBUS1_OUT        MCHP_PINMUX(b, 8, 0x324, 38, periph)
/* pb8_tstbus4_out */
#define PB8_TSTBUS4_OUT        MCHP_PINMUX(b, 8, 0x31c, 33, periph)
/* pb8_tstbus5_out */
#define PB8_TSTBUS5_OUT        MCHP_PINMUX(b, 8, 0x320, 38, periph)
/* pb8_tstbus8_out */
#define PB8_TSTBUS8_OUT        MCHP_PINMUX(b, 8, 0x31c, 34, periph)
/* pb8_tstbus9_out */
#define PB8_TSTBUS9_OUT        MCHP_PINMUX(b, 8, 0x320, 39, periph)
/* pb8_tstbus10_out */
#define PB8_TSTBUS10_OUT       MCHP_PINMUX(b, 8, 0x324, 39, periph)
/* pb9_ac_cmp0_out */
#define PB9_AC_CMP0_OUT        MCHP_PINMUX(b, 9, 0x330, 40, periph)
/* pb9_ac_cmptrdy_out */
#define PB9_AC_CMPTRDY_OUT     MCHP_PINMUX(b, 9, 0x330, 41, periph)
/* pb9_can1rx_in */
#define PB9_CAN1RX_IN          MCHP_PINMUX(b, 9, 0x190, 22, periph)
/* pb9_cclin1_in */
#define PB9_CCLIN1_IN          MCHP_PINMUX(b, 9, 0xb8, 19, periph)
/* pb9_cclin2_in */
#define PB9_CCLIN2_IN          MCHP_PINMUX(b, 9, 0xbc, 22, periph)
/* pb9_cclin4_in */
#define PB9_CCLIN4_IN          MCHP_PINMUX(b, 9, 0xc4, 19, periph)
/* pb9_cclin5_in */
#define PB9_CCLIN5_IN          MCHP_PINMUX(b, 9, 0xc8, 22, periph)
/* pb9_cclo0_out */
#define PB9_CCLO0_OUT          MCHP_PINMUX(b, 9, 0x330, 1, periph)
/* pb9_cclo1_out */
#define PB9_CCLO1_OUT          MCHP_PINMUX(b, 9, 0x32c, 1, periph)
/* pb9_coex_rf_act_out */
#define PB9_COEX_RF_ACT_OUT    MCHP_PINMUX(b, 9, 0x32c, 41, periph)
/* pb9_extint1_in */
#define PB9_EXTINT1_IN         MCHP_PINMUX(b, 9, 0x4, 19, periph)
/* pb9_extint2_in */
#define PB9_EXTINT2_IN         MCHP_PINMUX(b, 9, 0x8, 22, periph)
/* pb9_fectrl0_out */
#define PB9_FECTRL0_OUT        MCHP_PINMUX(b, 9, 0x32c, 40, periph)
/* pb9_fectrl4_out */
#define PB9_FECTRL4_OUT        MCHP_PINMUX(b, 9, 0x330, 42, periph)
/* pb9_qd0_out */
#define PB9_QD0_OUT            MCHP_PINMUX(b, 9, 0x32c, 35, periph)
/* pb9_qd1_out */
#define PB9_QD1_OUT            MCHP_PINMUX(b, 9, 0x330, 35, periph)
/* pb9_qd2_in */
#define PB9_QD2_IN             MCHP_PINMUX(b, 9, 0xa8, 19, periph)
/* pb9_qd2_out */
#define PB9_QD2_OUT            MCHP_PINMUX(b, 9, 0x32c, 37, periph)
/* pb9_qd3_in */
#define PB9_QD3_IN             MCHP_PINMUX(b, 9, 0xac, 22, periph)
/* pb9_qd3_out */
#define PB9_QD3_OUT            MCHP_PINMUX(b, 9, 0x32c, 36, periph)
/* pb9_qeihome0g2_in */
#define PB9_QEIHOME0G2_IN      MCHP_PINMUX(b, 9, 0x170, 19, periph)
/* pb9_qeiindx0g2_in */
#define PB9_QEIINDX0G2_IN      MCHP_PINMUX(b, 9, 0x174, 19, periph)
/* pb9_qeiindx0g3_in */
#define PB9_QEIINDX0G3_IN      MCHP_PINMUX(b, 9, 0x178, 22, periph)
/* pb9_qeiqea0g3_in */
#define PB9_QEIQEA0G3_IN       MCHP_PINMUX(b, 9, 0x17c, 22, periph)
/* pb9_qspics_out */
#define PB9_QSPICS_OUT         MCHP_PINMUX(b, 9, 0x32c, 34, periph)
/* pb9_qspi_sck_out */
#define PB9_QSPI_SCK_OUT       MCHP_PINMUX(b, 9, 0x334, 7, periph)
/* pb9_refi_in */
#define PB9_REFI_IN            MCHP_PINMUX(b, 9, 0xb0, 3, periph)
/* pb9_refo1_out */
#define PB9_REFO1_OUT          MCHP_PINMUX(b, 9, 0x334, 8, periph)
/* pb9_refo2_out */
#define PB9_REFO2_OUT          MCHP_PINMUX(b, 9, 0x334, 9, periph)
/* pb9_refo3_out */
#define PB9_REFO3_OUT          MCHP_PINMUX(b, 9, 0x334, 10, periph)
/* pb9_refo4_out */
#define PB9_REFO4_OUT          MCHP_PINMUX(b, 9, 0x334, 11, periph)
/* pb9_scom0p0_in */
#define PB9_SCOM0P0_IN         MCHP_PINMUX(b, 9, 0x40, 19, periph)
/* pb9_scom0p0_out */
#define PB9_SCOM0P0_OUT        MCHP_PINMUX(b, 9, 0x32c, 2, periph)
/* pb9_scom0p1_in */
#define PB9_SCOM0P1_IN         MCHP_PINMUX(b, 9, 0x44, 3, periph)
/* pb9_scom0p1_out */
#define PB9_SCOM0P1_OUT        MCHP_PINMUX(b, 9, 0x334, 1, periph)
/* pb9_scom0p2_out */
#define PB9_SCOM0P2_OUT        MCHP_PINMUX(b, 9, 0x32c, 4, periph)
/* pb9_scom0p3_out */
#define PB9_SCOM0P3_OUT        MCHP_PINMUX(b, 9, 0x32c, 3, periph)
/* pb9_scom1p0_in */
#define PB9_SCOM1P0_IN         MCHP_PINMUX(b, 9, 0x50, 22, periph)
/* pb9_scom1p0_out */
#define PB9_SCOM1P0_OUT        MCHP_PINMUX(b, 9, 0x330, 5, periph)
/* pb9_scom1p1_in */
#define PB9_SCOM1P1_IN         MCHP_PINMUX(b, 9, 0x54, 3, periph)
/* pb9_scom1p1_out */
#define PB9_SCOM1P1_OUT        MCHP_PINMUX(b, 9, 0x334, 2, periph)
/* pb9_scom1p2_out */
#define PB9_SCOM1P2_OUT        MCHP_PINMUX(b, 9, 0x32c, 6, periph)
/* pb9_scom1p3_in */
#define PB9_SCOM1P3_IN         MCHP_PINMUX(b, 9, 0x5c, 19, periph)
/* pb9_scom1p3_out */
#define PB9_SCOM1P3_OUT        MCHP_PINMUX(b, 9, 0x32c, 5, periph)
/* pb9_scom2p0_in */
#define PB9_SCOM2P0_IN         MCHP_PINMUX(b, 9, 0x60, 19, periph)
/* pb9_scom2p0_out */
#define PB9_SCOM2P0_OUT        MCHP_PINMUX(b, 9, 0x32c, 7, periph)
/* pb9_scom2p1_in */
#define PB9_SCOM2P1_IN         MCHP_PINMUX(b, 9, 0x64, 3, periph)
/* pb9_scom2p1_out */
#define PB9_SCOM2P1_OUT        MCHP_PINMUX(b, 9, 0x334, 3, periph)
/* pb9_scom2p2_out */
#define PB9_SCOM2P2_OUT        MCHP_PINMUX(b, 9, 0x32c, 9, periph)
/* pb9_scom2p3_out */
#define PB9_SCOM2P3_OUT        MCHP_PINMUX(b, 9, 0x32c, 8, periph)
/* pb9_scom3p0_in */
#define PB9_SCOM3P0_IN         MCHP_PINMUX(b, 9, 0x70, 22, periph)
/* pb9_scom3p0_out */
#define PB9_SCOM3P0_OUT        MCHP_PINMUX(b, 9, 0x330, 10, periph)
/* pb9_scom3p1_in */
#define PB9_SCOM3P1_IN         MCHP_PINMUX(b, 9, 0x74, 3, periph)
/* pb9_scom3p1_out */
#define PB9_SCOM3P1_OUT        MCHP_PINMUX(b, 9, 0x334, 4, periph)
/* pb9_scom3p2_out */
#define PB9_SCOM3P2_OUT        MCHP_PINMUX(b, 9, 0x32c, 11, periph)
/* pb9_scom3p3_in */
#define PB9_SCOM3P3_IN         MCHP_PINMUX(b, 9, 0x7c, 19, periph)
/* pb9_scom3p3_out */
#define PB9_SCOM3P3_OUT        MCHP_PINMUX(b, 9, 0x32c, 10, periph)
/* pb9_tc0wo0g2_in */
#define PB9_TC0WO0G2_IN        MCHP_PINMUX(b, 9, 0xd0, 19, periph)
/* pb9_tc0wo0_out */
#define PB9_TC0WO0_OUT         MCHP_PINMUX(b, 9, 0x330, 24, periph)
/* pb9_tc0wo1g3_in */
#define PB9_TC0WO1G3_IN        MCHP_PINMUX(b, 9, 0xd4, 22, periph)
/* pb9_tc0wo1_out */
#define PB9_TC0WO1_OUT         MCHP_PINMUX(b, 9, 0x32c, 24, periph)
/* pb9_tc1wo0_out */
#define PB9_TC1WO0_OUT         MCHP_PINMUX(b, 9, 0x330, 25, periph)
/* pb9_tc1wo1g2_in */
#define PB9_TC1WO1G2_IN        MCHP_PINMUX(b, 9, 0xe4, 19, periph)
/* pb9_tc1wo1_out */
#define PB9_TC1WO1_OUT         MCHP_PINMUX(b, 9, 0x32c, 25, periph)
/* pb9_tc2wo0g3_in */
#define PB9_TC2WO0G3_IN        MCHP_PINMUX(b, 9, 0xf0, 22, periph)
/* pb9_tc2wo0_out */
#define PB9_TC2WO0_OUT         MCHP_PINMUX(b, 9, 0x330, 26, periph)
/* pb9_tc2wo1g2_in */
#define PB9_TC2WO1G2_IN        MCHP_PINMUX(b, 9, 0xf4, 19, periph)
/* pb9_tc2wo1_out */
#define PB9_TC2WO1_OUT         MCHP_PINMUX(b, 9, 0x32c, 26, periph)
/* pb9_tc3wo0g3_in */
#define PB9_TC3WO0G3_IN        MCHP_PINMUX(b, 9, 0x100, 22, periph)
/* pb9_tc3wo0_out */
#define PB9_TC3WO0_OUT         MCHP_PINMUX(b, 9, 0x330, 27, periph)
/* pb9_tc3wo1g2_in */
#define PB9_TC3WO1G2_IN        MCHP_PINMUX(b, 9, 0x104, 19, periph)
/* pb9_tc3wo1_out */
#define PB9_TC3WO1_OUT         MCHP_PINMUX(b, 9, 0x32c, 27, periph)
/* pb9_tc4wo0g3_in */
#define PB9_TC4WO0G3_IN        MCHP_PINMUX(b, 9, 0x110, 22, periph)
/* pb9_tc4wo0_out */
#define PB9_TC4WO0_OUT         MCHP_PINMUX(b, 9, 0x330, 28, periph)
/* pb9_tc4wo1g2_in */
#define PB9_TC4WO1G2_IN        MCHP_PINMUX(b, 9, 0x114, 19, periph)
/* pb9_tc4wo1_out */
#define PB9_TC4WO1_OUT         MCHP_PINMUX(b, 9, 0x32c, 28, periph)
/* pb9_tc5wo0g3_in */
#define PB9_TC5WO0G3_IN        MCHP_PINMUX(b, 9, 0x120, 22, periph)
/* pb9_tc5wo0_out */
#define PB9_TC5WO0_OUT         MCHP_PINMUX(b, 9, 0x330, 29, periph)
/* pb9_tc5wo1g2_in */
#define PB9_TC5WO1G2_IN        MCHP_PINMUX(b, 9, 0x124, 19, periph)
/* pb9_tc5wo1_out */
#define PB9_TC5WO1_OUT         MCHP_PINMUX(b, 9, 0x32c, 29, periph)
/* pb9_tc6wo0g3_in */
#define PB9_TC6WO0G3_IN        MCHP_PINMUX(b, 9, 0x130, 22, periph)
/* pb9_tc6wo0_out */
#define PB9_TC6WO0_OUT         MCHP_PINMUX(b, 9, 0x330, 30, periph)
/* pb9_tc6wo1g2_in */
#define PB9_TC6WO1G2_IN        MCHP_PINMUX(b, 9, 0x134, 19, periph)
/* pb9_tc6wo1_out */
#define PB9_TC6WO1_OUT         MCHP_PINMUX(b, 9, 0x32c, 30, periph)
/* pb9_tc7wo0g3_in */
#define PB9_TC7WO0G3_IN        MCHP_PINMUX(b, 9, 0x140, 22, periph)
/* pb9_tc7wo0_out */
#define PB9_TC7WO0_OUT         MCHP_PINMUX(b, 9, 0x330, 31, periph)
/* pb9_tc7wo1g2_in */
#define PB9_TC7WO1G2_IN        MCHP_PINMUX(b, 9, 0x144, 19, periph)
/* pb9_tc7wo1_out */
#define PB9_TC7WO1_OUT         MCHP_PINMUX(b, 9, 0x32c, 31, periph)
/* pb9_tc8wo0g3_in */
#define PB9_TC8WO0G3_IN        MCHP_PINMUX(b, 9, 0x150, 22, periph)
/* pb9_tc8wo0_out */
#define PB9_TC8WO0_OUT         MCHP_PINMUX(b, 9, 0x330, 32, periph)
/* pb9_tc8wo1g2_in */
#define PB9_TC8WO1G2_IN        MCHP_PINMUX(b, 9, 0x154, 19, periph)
/* pb9_tc8wo1_out */
#define PB9_TC8WO1_OUT         MCHP_PINMUX(b, 9, 0x32c, 32, periph)
/* pb9_tc9wo0g2_in */
#define PB9_TC9WO0G2_IN        MCHP_PINMUX(b, 9, 0x15c, 19, periph)
/* pb9_tc9wo0_out */
#define PB9_TC9WO0_OUT         MCHP_PINMUX(b, 9, 0x32c, 33, periph)
/* pb9_tc9wo1g3_in */
#define PB9_TC9WO1G3_IN        MCHP_PINMUX(b, 9, 0x164, 22, periph)
/* pb9_tc9wo1_out */
#define PB9_TC9WO1_OUT         MCHP_PINMUX(b, 9, 0x330, 33, periph)
/* pb9_tcc0wo0_out */
#define PB9_TCC0WO0_OUT        MCHP_PINMUX(b, 9, 0x330, 18, periph)
/* pb9_tcc0wo1_out */
#define PB9_TCC0WO1_OUT        MCHP_PINMUX(b, 9, 0x32c, 17, periph)
/* pb9_tcc0wo2_out */
#define PB9_TCC0WO2_OUT        MCHP_PINMUX(b, 9, 0x330, 17, periph)
/* pb9_tcc0wo3_out */
#define PB9_TCC0WO3_OUT        MCHP_PINMUX(b, 9, 0x32c, 19, periph)
/* pb9_tcc0wo4_out */
#define PB9_TCC0WO4_OUT        MCHP_PINMUX(b, 9, 0x330, 19, periph)
/* pb9_tcc0wo5_out */
#define PB9_TCC0WO5_OUT        MCHP_PINMUX(b, 9, 0x32c, 18, periph)
/* pb9_tcc1wo0_out */
#define PB9_TCC1WO0_OUT        MCHP_PINMUX(b, 9, 0x330, 21, periph)
/* pb9_tcc1wo1_out */
#define PB9_TCC1WO1_OUT        MCHP_PINMUX(b, 9, 0x32c, 20, periph)
/* pb9_tcc1wo2_out */
#define PB9_TCC1WO2_OUT        MCHP_PINMUX(b, 9, 0x330, 20, periph)
/* pb9_tcc1wo3_out */
#define PB9_TCC1WO3_OUT        MCHP_PINMUX(b, 9, 0x32c, 22, periph)
/* pb9_tcc1wo4_out */
#define PB9_TCC1WO4_OUT        MCHP_PINMUX(b, 9, 0x330, 22, periph)
/* pb9_tcc1wo5_out */
#define PB9_TCC1WO5_OUT        MCHP_PINMUX(b, 9, 0x32c, 21, periph)
/* pb9_tcc2wo0_out */
#define PB9_TCC2WO0_OUT        MCHP_PINMUX(b, 9, 0x330, 23, periph)
/* pb9_tcc2wo1_out */
#define PB9_TCC2WO1_OUT        MCHP_PINMUX(b, 9, 0x32c, 23, periph)
/* pb9_tstbus1_out */
#define PB9_TSTBUS1_OUT        MCHP_PINMUX(b, 9, 0x330, 38, periph)
/* pb9_tstbus5_out */
#define PB9_TSTBUS5_OUT        MCHP_PINMUX(b, 9, 0x32c, 38, periph)
/* pb9_tstbus9_out */
#define PB9_TSTBUS9_OUT        MCHP_PINMUX(b, 9, 0x32c, 39, periph)
/* pb9_tstbus10_out */
#define PB9_TSTBUS10_OUT       MCHP_PINMUX(b, 9, 0x330, 39, periph)
/* pb10_ac_cmp0_out */
#define PB10_AC_CMP0_OUT       MCHP_PINMUX(b, 10, 0x338, 40, periph)
/* pb10_ac_cmp1_out */
#define PB10_AC_CMP1_OUT       MCHP_PINMUX(b, 10, 0x33c, 36, periph)
/* pb10_ac_cmptout_out */
#define PB10_AC_CMPTOUT_OUT    MCHP_PINMUX(b, 10, 0x33c, 37, periph)
/* pb10_ac_cmptrdy_out */
#define PB10_AC_CMPTRDY_OUT    MCHP_PINMUX(b, 10, 0x338, 41, periph)
/* pb10_can1rx_in */
#define PB10_CAN1RX_IN         MCHP_PINMUX(b, 10, 0x190, 18, periph)
/* pb10_can1_tx_out */
#define PB10_CAN1_TX_OUT       MCHP_PINMUX(b, 10, 0x33c, 38, periph)
/* pb10_cclin2_in */
#define PB10_CCLIN2_IN         MCHP_PINMUX(b, 10, 0xbc, 18, periph)
/* pb10_cclin5_in */
#define PB10_CCLIN5_IN         MCHP_PINMUX(b, 10, 0xc8, 18, periph)
/* pb10_cclo0_out */
#define PB10_CCLO0_OUT         MCHP_PINMUX(b, 10, 0x338, 1, periph)
/* pb10_cclo1_out */
#define PB10_CCLO1_OUT         MCHP_PINMUX(b, 10, 0x33c, 1, periph)
/* pb10_coexwlanact_in */
#define PB10_COEXWLANACT_IN    MCHP_PINMUX(b, 10, 0x194, 22, periph)
/* pb10_extint2_in */
#define PB10_EXTINT2_IN        MCHP_PINMUX(b, 10, 0x8, 18, periph)
/* pb10_extint3_in */
#define PB10_EXTINT3_IN        MCHP_PINMUX(b, 10, 0xc, 22, periph)
/* pb10_fectrl3_out */
#define PB10_FECTRL3_OUT       MCHP_PINMUX(b, 10, 0x33c, 39, periph)
/* pb10_fectrl4_out */
#define PB10_FECTRL4_OUT       MCHP_PINMUX(b, 10, 0x338, 42, periph)
/* pb10_fectrl5_out */
#define PB10_FECTRL5_OUT       MCHP_PINMUX(b, 10, 0x33c, 40, periph)
/* pb10_nmi_in */
#define PB10_NMI_IN            MCHP_PINMUX(b, 10, 0x3c, 22, periph)
/* pb10_qd0_in */
#define PB10_QD0_IN            MCHP_PINMUX(b, 10, 0xa0, 22, periph)
/* pb10_qd0_out */
#define PB10_QD0_OUT           MCHP_PINMUX(b, 10, 0x338, 36, periph)
/* pb10_qd1_out */
#define PB10_QD1_OUT           MCHP_PINMUX(b, 10, 0x338, 35, periph)
/* pb10_qd2_out */
#define PB10_QD2_OUT           MCHP_PINMUX(b, 10, 0x33c, 31, periph)
/* pb10_qd3_in */
#define PB10_QD3_IN            MCHP_PINMUX(b, 10, 0xac, 18, periph)
/* pb10_qd3_out */
#define PB10_QD3_OUT           MCHP_PINMUX(b, 10, 0x338, 37, periph)
/* pb10_qeiccmp0_out */
#define PB10_QEICCMP0_OUT      MCHP_PINMUX(b, 10, 0x340, 13, periph)
/* pb10_qeiindx0g3_in */
#define PB10_QEIINDX0G3_IN     MCHP_PINMUX(b, 10, 0x178, 18, periph)
/* pb10_qeiqea0g3_in */
#define PB10_QEIQEA0G3_IN      MCHP_PINMUX(b, 10, 0x17c, 18, periph)
/* pb10_qeiqea0g4_in */
#define PB10_QEIQEA0G4_IN      MCHP_PINMUX(b, 10, 0x180, 22, periph)
/* pb10_qeiqeb0g4_in */
#define PB10_QEIQEB0G4_IN      MCHP_PINMUX(b, 10, 0x184, 22, periph)
/* pb10_qeiqeb0g5_in */
#define PB10_QEIQEB0G5_IN      MCHP_PINMUX(b, 10, 0x188, 4, periph)
/* pb10_qspics_out */
#define PB10_QSPICS_OUT        MCHP_PINMUX(b, 10, 0x338, 34, periph)
/* pb10_scom0p0_out */
#define PB10_SCOM0P0_OUT       MCHP_PINMUX(b, 10, 0x338, 2, periph)
/* pb10_scom0p2_in */
#define PB10_SCOM0P2_IN        MCHP_PINMUX(b, 10, 0x48, 22, periph)
/* pb10_scom0p2_out */
#define PB10_SCOM0P2_OUT       MCHP_PINMUX(b, 10, 0x33c, 2, periph)
/* pb10_scom0p3_out */
#define PB10_SCOM0P3_OUT       MCHP_PINMUX(b, 10, 0x338, 3, periph)
/* pb10_scom1p0_in */
#define PB10_SCOM1P0_IN        MCHP_PINMUX(b, 10, 0x50, 18, periph)
/* pb10_scom1p0_out */
#define PB10_SCOM1P0_OUT       MCHP_PINMUX(b, 10, 0x338, 5, periph)
/* pb10_scom1p2_out */
#define PB10_SCOM1P2_OUT       MCHP_PINMUX(b, 10, 0x338, 4, periph)
/* pb10_scom1p3_out */
#define PB10_SCOM1P3_OUT       MCHP_PINMUX(b, 10, 0x338, 6, periph)
/* pb10_scom2p0_out */
#define PB10_SCOM2P0_OUT       MCHP_PINMUX(b, 10, 0x338, 7, periph)
/* pb10_scom2p2_in */
#define PB10_SCOM2P2_IN        MCHP_PINMUX(b, 10, 0x68, 22, periph)
/* pb10_scom2p2_out */
#define PB10_SCOM2P2_OUT       MCHP_PINMUX(b, 10, 0x33c, 6, periph)
/* pb10_scom2p3_out */
#define PB10_SCOM2P3_OUT       MCHP_PINMUX(b, 10, 0x338, 8, periph)
/* pb10_scom3p0_in */
#define PB10_SCOM3P0_IN        MCHP_PINMUX(b, 10, 0x70, 18, periph)
/* pb10_scom3p0_out */
#define PB10_SCOM3P0_OUT       MCHP_PINMUX(b, 10, 0x338, 10, periph)
/* pb10_scom3p2_out */
#define PB10_SCOM3P2_OUT       MCHP_PINMUX(b, 10, 0x338, 9, periph)
/* pb10_scom3p3_out */
#define PB10_SCOM3P3_OUT       MCHP_PINMUX(b, 10, 0x338, 11, periph)
/* pb10_tc0wo0_out */
#define PB10_TC0WO0_OUT        MCHP_PINMUX(b, 10, 0x338, 24, periph)
/* pb10_tc0wo1g3_in */
#define PB10_TC0WO1G3_IN       MCHP_PINMUX(b, 10, 0xd4, 18, periph)
/* pb10_tc0wo1g4_in */
#define PB10_TC0WO1G4_IN       MCHP_PINMUX(b, 10, 0xd8, 22, periph)
/* pb10_tc1wo0_out */
#define PB10_TC1WO0_OUT        MCHP_PINMUX(b, 10, 0x338, 25, periph)
/* pb10_tc1wo1_out */
#define PB10_TC1WO1_OUT        MCHP_PINMUX(b, 10, 0x33c, 22, periph)
/* pb10_tc2wo0g3_in */
#define PB10_TC2WO0G3_IN       MCHP_PINMUX(b, 10, 0xf0, 18, periph)
/* pb10_tc2wo0_out */
#define PB10_TC2WO0_OUT        MCHP_PINMUX(b, 10, 0x338, 26, periph)
/* pb10_tc2wo1g4_in */
#define PB10_TC2WO1G4_IN       MCHP_PINMUX(b, 10, 0xf8, 22, periph)
/* pb10_tc2wo1_out */
#define PB10_TC2WO1_OUT        MCHP_PINMUX(b, 10, 0x33c, 23, periph)
/* pb10_tc3wo0g3_in */
#define PB10_TC3WO0G3_IN       MCHP_PINMUX(b, 10, 0x100, 18, periph)
/* pb10_tc3wo0_out */
#define PB10_TC3WO0_OUT        MCHP_PINMUX(b, 10, 0x338, 27, periph)
/* pb10_tc3wo1g4_in */
#define PB10_TC3WO1G4_IN       MCHP_PINMUX(b, 10, 0x108, 22, periph)
/* pb10_tc3wo1_out */
#define PB10_TC3WO1_OUT        MCHP_PINMUX(b, 10, 0x33c, 24, periph)
/* pb10_tc4wo0g3_in */
#define PB10_TC4WO0G3_IN       MCHP_PINMUX(b, 10, 0x110, 18, periph)
/* pb10_tc4wo0_out */
#define PB10_TC4WO0_OUT        MCHP_PINMUX(b, 10, 0x338, 28, periph)
/* pb10_tc4wo1g4_in */
#define PB10_TC4WO1G4_IN       MCHP_PINMUX(b, 10, 0x118, 22, periph)
/* pb10_tc4wo1_out */
#define PB10_TC4WO1_OUT        MCHP_PINMUX(b, 10, 0x33c, 25, periph)
/* pb10_tc5wo0g3_in */
#define PB10_TC5WO0G3_IN       MCHP_PINMUX(b, 10, 0x120, 18, periph)
/* pb10_tc5wo0_out */
#define PB10_TC5WO0_OUT        MCHP_PINMUX(b, 10, 0x338, 29, periph)
/* pb10_tc5wo1g4_in */
#define PB10_TC5WO1G4_IN       MCHP_PINMUX(b, 10, 0x128, 22, periph)
/* pb10_tc5wo1_out */
#define PB10_TC5WO1_OUT        MCHP_PINMUX(b, 10, 0x33c, 26, periph)
/* pb10_tc6wo0g3_in */
#define PB10_TC6WO0G3_IN       MCHP_PINMUX(b, 10, 0x130, 18, periph)
/* pb10_tc6wo0_out */
#define PB10_TC6WO0_OUT        MCHP_PINMUX(b, 10, 0x338, 30, periph)
/* pb10_tc6wo1g4_in */
#define PB10_TC6WO1G4_IN       MCHP_PINMUX(b, 10, 0x138, 22, periph)
/* pb10_tc6wo1_out */
#define PB10_TC6WO1_OUT        MCHP_PINMUX(b, 10, 0x33c, 27, periph)
/* pb10_tc7wo0g3_in */
#define PB10_TC7WO0G3_IN       MCHP_PINMUX(b, 10, 0x140, 18, periph)
/* pb10_tc7wo0_out */
#define PB10_TC7WO0_OUT        MCHP_PINMUX(b, 10, 0x338, 31, periph)
/* pb10_tc7wo1g4_in */
#define PB10_TC7WO1G4_IN       MCHP_PINMUX(b, 10, 0x148, 22, periph)
/* pb10_tc7wo1_out */
#define PB10_TC7WO1_OUT        MCHP_PINMUX(b, 10, 0x33c, 28, periph)
/* pb10_tc8wo0g3_in */
#define PB10_TC8WO0G3_IN       MCHP_PINMUX(b, 10, 0x150, 18, periph)
/* pb10_tc8wo0_out */
#define PB10_TC8WO0_OUT        MCHP_PINMUX(b, 10, 0x338, 32, periph)
/* pb10_tc8wo1g5_in */
#define PB10_TC8WO1G5_IN       MCHP_PINMUX(b, 10, 0x158, 4, periph)
/* pb10_tc8wo1_out */
#define PB10_TC8WO1_OUT        MCHP_PINMUX(b, 10, 0x340, 10, periph)
/* pb10_tc9wo0g4_in */
#define PB10_TC9WO0G4_IN       MCHP_PINMUX(b, 10, 0x160, 22, periph)
/* pb10_tc9wo0_out */
#define PB10_TC9WO0_OUT        MCHP_PINMUX(b, 10, 0x33c, 29, periph)
/* pb10_tc9wo1g3_in */
#define PB10_TC9WO1G3_IN       MCHP_PINMUX(b, 10, 0x164, 18, periph)
/* pb10_tc9wo1g5_in */
#define PB10_TC9WO1G5_IN       MCHP_PINMUX(b, 10, 0x168, 4, periph)
/* pb10_tc9wo1_out */
#define PB10_TC9WO1_OUT        MCHP_PINMUX(b, 10, 0x338, 33, periph)
/* pb10_tcc0wo0_out */
#define PB10_TCC0WO0_OUT       MCHP_PINMUX(b, 10, 0x338, 18, periph)
/* pb10_tcc0wo1_out */
#define PB10_TCC0WO1_OUT       MCHP_PINMUX(b, 10, 0x33c, 15, periph)
/* pb10_tcc0wo2_out */
#define PB10_TCC0WO2_OUT       MCHP_PINMUX(b, 10, 0x338, 17, periph)
/* pb10_tcc0wo3_out */
#define PB10_TCC0WO3_OUT       MCHP_PINMUX(b, 10, 0x33c, 14, periph)
/* pb10_tcc0wo4_out */
#define PB10_TCC0WO4_OUT       MCHP_PINMUX(b, 10, 0x338, 19, periph)
/* pb10_tcc0wo5_out */
#define PB10_TCC0WO5_OUT       MCHP_PINMUX(b, 10, 0x33c, 16, periph)
/* pb10_tcc1wo0_out */
#define PB10_TCC1WO0_OUT       MCHP_PINMUX(b, 10, 0x338, 21, periph)
/* pb10_tcc1wo1_out */
#define PB10_TCC1WO1_OUT       MCHP_PINMUX(b, 10, 0x33c, 18, periph)
/* pb10_tcc1wo2_out */
#define PB10_TCC1WO2_OUT       MCHP_PINMUX(b, 10, 0x338, 20, periph)
/* pb10_tcc1wo3_out */
#define PB10_TCC1WO3_OUT       MCHP_PINMUX(b, 10, 0x33c, 17, periph)
/* pb10_tcc1wo4_out */
#define PB10_TCC1WO4_OUT       MCHP_PINMUX(b, 10, 0x338, 22, periph)
/* pb10_tcc1wo5_out */
#define PB10_TCC1WO5_OUT       MCHP_PINMUX(b, 10, 0x33c, 19, periph)
/* pb10_tcc2wo0_out */
#define PB10_TCC2WO0_OUT       MCHP_PINMUX(b, 10, 0x338, 23, periph)
/* pb10_tcc2wo1_out */
#define PB10_TCC2WO1_OUT       MCHP_PINMUX(b, 10, 0x33c, 20, periph)
