zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz66/pic32cx2051bz66048-pinctrl.h
#define PB13_TC4WO1_OUT        MCHP_PINMUX(b, 13, 0x354, 28, periph)
/* pb13_tc5wo0g3_in */
#define PB13_TC5WO0G3_IN       MCHP_PINMUX(b, 13, 0x120, 6, periph)
/* pb13_tc5wo0_out */
#define PB13_TC5WO0_OUT        MCHP_PINMUX(b, 13, 0x358, 29, periph)
/* pb13_tc5wo1g2_in */
#define PB13_TC5WO1G2_IN       MCHP_PINMUX(b, 13, 0x124, 20, periph)
/* pb13_tc5wo1_out */
#define PB13_TC5WO1_OUT        MCHP_PINMUX(b, 13, 0x354, 29, periph)
/* pb13_tc6wo0g3_in */
#define PB13_TC6WO0G3_IN       MCHP_PINMUX(b, 13, 0x130, 6, periph)
/* pb13_tc6wo0_out */
#define PB13_TC6WO0_OUT        MCHP_PINMUX(b, 13, 0x358, 30, periph)
/* pb13_tc6wo1g2_in */
#define PB13_TC6WO1G2_IN       MCHP_PINMUX(b, 13, 0x134, 20, periph)
/* pb13_tc6wo1_out */
#define PB13_TC6WO1_OUT        MCHP_PINMUX(b, 13, 0x354, 30, periph)
/* pb13_tc7wo0g3_in */
#define PB13_TC7WO0G3_IN       MCHP_PINMUX(b, 13, 0x140, 6, periph)
/* pb13_tc7wo0_out */
#define PB13_TC7WO0_OUT        MCHP_PINMUX(b, 13, 0x358, 31, periph)
/* pb13_tc7wo1g2_in */
#define PB13_TC7WO1G2_IN       MCHP_PINMUX(b, 13, 0x144, 20, periph)
/* pb13_tc7wo1_out */
#define PB13_TC7WO1_OUT        MCHP_PINMUX(b, 13, 0x354, 31, periph)
/* pb13_tc8wo0g3_in */
#define PB13_TC8WO0G3_IN       MCHP_PINMUX(b, 13, 0x150, 6, periph)
/* pb13_tc8wo0_out */
#define PB13_TC8WO0_OUT        MCHP_PINMUX(b, 13, 0x358, 32, periph)
/* pb13_tc8wo1g2_in */
#define PB13_TC8WO1G2_IN       MCHP_PINMUX(b, 13, 0x154, 20, periph)
/* pb13_tc8wo1_out */
#define PB13_TC8WO1_OUT        MCHP_PINMUX(b, 13, 0x354, 32, periph)
/* pb13_tc9wo0g2_in */
#define PB13_TC9WO0G2_IN       MCHP_PINMUX(b, 13, 0x15c, 20, periph)
/* pb13_tc9wo0_out */
#define PB13_TC9WO0_OUT        MCHP_PINMUX(b, 13, 0x354, 33, periph)
/* pb13_tc9wo1g3_in */
#define PB13_TC9WO1G3_IN       MCHP_PINMUX(b, 13, 0x164, 6, periph)
/* pb13_tc9wo1_out */
#define PB13_TC9WO1_OUT        MCHP_PINMUX(b, 13, 0x358, 33, periph)
/* pb13_tcc0wo0_out */
#define PB13_TCC0WO0_OUT       MCHP_PINMUX(b, 13, 0x358, 18, periph)
/* pb13_tcc0wo1_out */
#define PB13_TCC0WO1_OUT       MCHP_PINMUX(b, 13, 0x354, 17, periph)
/* pb13_tcc0wo2_out */
#define PB13_TCC0WO2_OUT       MCHP_PINMUX(b, 13, 0x358, 17, periph)
/* pb13_tcc0wo3_out */
#define PB13_TCC0WO3_OUT       MCHP_PINMUX(b, 13, 0x354, 19, periph)
/* pb13_tcc0wo4_out */
#define PB13_TCC0WO4_OUT       MCHP_PINMUX(b, 13, 0x358, 19, periph)
/* pb13_tcc0wo5_out */
#define PB13_TCC0WO5_OUT       MCHP_PINMUX(b, 13, 0x354, 18, periph)
/* pb13_tcc1wo0_out */
#define PB13_TCC1WO0_OUT       MCHP_PINMUX(b, 13, 0x358, 21, periph)
/* pb13_tcc1wo1_out */
#define PB13_TCC1WO1_OUT       MCHP_PINMUX(b, 13, 0x354, 20, periph)
/* pb13_tcc1wo2_out */
#define PB13_TCC1WO2_OUT       MCHP_PINMUX(b, 13, 0x358, 20, periph)
/* pb13_tcc1wo3_out */
#define PB13_TCC1WO3_OUT       MCHP_PINMUX(b, 13, 0x354, 22, periph)
/* pb13_tcc1wo4_out */
#define PB13_TCC1WO4_OUT       MCHP_PINMUX(b, 13, 0x358, 22, periph)
/* pb13_tcc1wo5_out */
#define PB13_TCC1WO5_OUT       MCHP_PINMUX(b, 13, 0x354, 21, periph)
/* pb13_tcc2wo0_out */
#define PB13_TCC2WO0_OUT       MCHP_PINMUX(b, 13, 0x358, 23, periph)
/* pb13_tcc2wo1_out */
#define PB13_TCC2WO1_OUT       MCHP_PINMUX(b, 13, 0x354, 23, periph)
/* pb13_tstbus1_out */
#define PB13_TSTBUS1_OUT       MCHP_PINMUX(b, 13, 0x358, 38, periph)
/* pb13_tstbus5_out */
#define PB13_TSTBUS5_OUT       MCHP_PINMUX(b, 13, 0x354, 38, periph)
/* pb13_tstbus9_out */
#define PB13_TSTBUS9_OUT       MCHP_PINMUX(b, 13, 0x354, 39, periph)
/* pb13_tstbus10_out */
#define PB13_TSTBUS10_OUT      MCHP_PINMUX(b, 13, 0x358, 39, periph)

#endif /* MICROCHIP_PIC32CX2051BZ66048_PINCTRL_H_ */
